YY-Edwards/STM32_USB-FS-Device_v4.1/mylib/DC2039A/LTC4015/LTC4015_reg_defs.h
/*
LTC4015: Multichemistry Buck Battery Charger Controller with Digital Telemetry System

@verbatim
The  LTC®4015  is  a  complete  synchronous  buck  controller/charger  with pin
selectable,  chemistry specific charging and termination algorithms. The LTC4015
can  charge  Li-Ion/Polymer,  LiFePO4,  or  leadacid  batteries.  Battery charge
voltage  is  pin  selectable and I²C adjustable. Input current limit and charge
current   can   be  accurately  programmed  with  sense  resistors  and  can  be
individually  adjusted  via  the  I²C  serial  port. A digital telemetry system
monitors  all  system  power  parameters.  Safety  timer and current termination
algorithms  are  supported  for  lithium  chemistry  batteries. The LTC4015 also
includes  automatic  recharge, precharge (Li-Ion) and NTC thermistor protection.
The LTC4015's I²C port allows user customization of charger algorithms, reading
of  charger  status  information, configuration of the maskable and programmable
alerts,  plus  use  and  configuration  of  the  Coulomb counter. Available in a
38-Lead 5mm × 7mm QFN package.
@endverbatim

http://www.linear.com/product/LTC4015

http://www.linear.com/product/LTC4015#demoboards

REVISION HISTORY
$Revision: $
$Date: $

Copyright (c) 2016, Linear Technology Corp.(LTC)
All rights reserved.

Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

1.  Redistributions  of source code must retain the above copyright notice, this
    list  of conditions and the following disclaimer.

2.  Redistributions  in  binary  form must reproduce the above copyright notice,
    this  list of conditions and  the following disclaimer in the  documentation
    and/or other materials provided with the distribution.

THIS  SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
ANY  EXPRESS  OR  IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES   OF  MERCHANTABILITY  AND  FITNESS  FOR  A  PARTICULAR  PURPOSE  ARE
DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR
ANY  DIRECT,  INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
(INCLUDING,  BUT  NOT  LIMITED  TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
LOSS  OF  USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
ANY  THEORY  OF  LIABILITY,  WHETHER  IN  CONTRACT,  STRICT  LIABILITY,  OR TORT
(INCLUDING  NEGLIGENCE  OR  OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

The  views and conclusions contained in the software and documentation are those
of  the authors and should not be interpreted as representing official policies,
either expressed or implied, of Linear Technology Corp.

The Linear Technology Linduino is not affiliated with the official Arduino team.
However,  the Linduino is only possible because of the Arduino team's commitment
to   the   open-source   community.   Please,  visit  http://www.arduino.cc  and
http://store.arduino.cc  ,  and  consider  a  purchase that will help fund their
ongoing work.

Generated on: 2016-01-08
*/

/*! @file
 *  @ingroup LTC4015
 *  @brief LTC4015 Register Map Definition Header
 *
 *
 *  This file contains LTC4015 definitions for each command_code as well as
 *  each individual bit field for the case when a register contains multiple
 *  bit-packed fields smaller than the register width.
 *  Each bit field name is prepended with LTC4015_.
 *  Each bit field has individual definitions for its _SIZE, _OFFSET (LSB) and _MASK,
 *  as well as the three fields stored in a single 16-bit word for use with the access
 *  functions provided by LTC4015.c and LTC4015.h.
 *  In the case that the bit field contents represent an enumeration, _PRESET
 *  definitions exists to translate from human readable format to the encoded value.
 *  See @ref LTC4015_register_map for detailed descriptions of each bit field.
 */

/*! @defgroup LTC4015_register_map LTC4015 Register Map Definitions
 *  @ingroup LTC4015
 */

#ifndef LTC4015_REG_DEFS_H_
#define LTC4015_REG_DEFS_H_

#define LTC4015_ADDR_68 0x68 //!<LTC4015 I2C address in 7-bit format
/*! @defgroup LTC4015_VBAT_LO_ALERT_LIMIT VBAT_LO_ALERT_LIMIT
 *  @ingroup LTC4015_register_map
 *  @brief VBAT_LO_ALERT_LIMIT Register
 *
 * |                   15:0 |
 * |:----------------------:|
 * | VBAT_LO_ALERT_LIMIT_BF |
 *
 *   - CommandCode: 1
 *   - Contains Bit Fields:
 *     + @ref LTC4015_VBAT_LO_ALERT_LIMIT_BF "VBAT_LO_ALERT_LIMIT_BF" : Battery voltage low alert limit as reported in VBAT
*/

//!@{
#define LTC4015_VBAT_LO_ALERT_LIMIT_SUBADDR 1
#define LTC4015_VBAT_LO_ALERT_LIMIT (0 << 12 | (16 - 1) << 8 | LTC4015_VBAT_LO_ALERT_LIMIT_SUBADDR)
//!@}
/*! @defgroup LTC4015_VBAT_LO_ALERT_LIMIT_BF VBAT_LO_ALERT_LIMIT_BF
 *  @ingroup LTC4015_register_map
 *  @brief VBAT_LO_ALERT_LIMIT_BF Bit Field
 *
 *  Battery voltage low alert limit as reported in VBAT
 *   - Register: @ref LTC4015_VBAT_LO_ALERT_LIMIT "VBAT_LO_ALERT_LIMIT"
 *   - CommandCode: 1
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_VBAT_LO_ALERT_LIMIT_BF_SUBADDR LTC4015_VBAT_LO_ALERT_LIMIT_SUBADDR //!< @ref LTC4015_VBAT_LO_ALERT_LIMIT_BF "VBAT_LO_ALERT_LIMIT_BF"
#define LTC4015_VBAT_LO_ALERT_LIMIT_BF_SIZE 16
#define LTC4015_VBAT_LO_ALERT_LIMIT_BF_OFFSET 0
#define LTC4015_VBAT_LO_ALERT_LIMIT_BF_MASK 0xFFFF
#define LTC4015_VBAT_LO_ALERT_LIMIT_BF (LTC4015_VBAT_LO_ALERT_LIMIT_BF_OFFSET << 12 | (LTC4015_VBAT_LO_ALERT_LIMIT_BF_SIZE - 1) << 8 | LTC4015_VBAT_LO_ALERT_LIMIT_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_VBAT_HI_ALERT_LIMIT VBAT_HI_ALERT_LIMIT
 *  @ingroup LTC4015_register_map
 *  @brief VBAT_HI_ALERT_LIMIT Register
 *
 * |                   15:0 |
 * |:----------------------:|
 * | VBAT_HI_ALERT_LIMIT_BF |
 *
 *   - CommandCode: 2
 *   - Contains Bit Fields:
 *     + @ref LTC4015_VBAT_HI_ALERT_LIMIT_BF "VBAT_HI_ALERT_LIMIT_BF" : Battery voltage high alert limit as reported in VBAT
*/

//!@{
#define LTC4015_VBAT_HI_ALERT_LIMIT_SUBADDR 2
#define LTC4015_VBAT_HI_ALERT_LIMIT (0 << 12 | (16 - 1) << 8 | LTC4015_VBAT_HI_ALERT_LIMIT_SUBADDR)
//!@}
/*! @defgroup LTC4015_VBAT_HI_ALERT_LIMIT_BF VBAT_HI_ALERT_LIMIT_BF
 *  @ingroup LTC4015_register_map
 *  @brief VBAT_HI_ALERT_LIMIT_BF Bit Field
 *
 *  Battery voltage high alert limit as reported in VBAT
 *   - Register: @ref LTC4015_VBAT_HI_ALERT_LIMIT "VBAT_HI_ALERT_LIMIT"
 *   - CommandCode: 2
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_VBAT_HI_ALERT_LIMIT_BF_SUBADDR LTC4015_VBAT_HI_ALERT_LIMIT_SUBADDR //!< @ref LTC4015_VBAT_HI_ALERT_LIMIT_BF "VBAT_HI_ALERT_LIMIT_BF"
#define LTC4015_VBAT_HI_ALERT_LIMIT_BF_SIZE 16
#define LTC4015_VBAT_HI_ALERT_LIMIT_BF_OFFSET 0
#define LTC4015_VBAT_HI_ALERT_LIMIT_BF_MASK 0xFFFF
#define LTC4015_VBAT_HI_ALERT_LIMIT_BF (LTC4015_VBAT_HI_ALERT_LIMIT_BF_OFFSET << 12 | (LTC4015_VBAT_HI_ALERT_LIMIT_BF_SIZE - 1) << 8 | LTC4015_VBAT_HI_ALERT_LIMIT_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_VIN_LO_ALERT_LIMIT VIN_LO_ALERT_LIMIT
 *  @ingroup LTC4015_register_map
 *  @brief VIN_LO_ALERT_LIMIT Register
 *
 * |                  15:0 |
 * |:---------------------:|
 * | VIN_LO_ALERT_LIMIT_BF |
 *
 *   - CommandCode: 3
 *   - Contains Bit Fields:
 *     + @ref LTC4015_VIN_LO_ALERT_LIMIT_BF "VIN_LO_ALERT_LIMIT_BF" : Input voltage low alert limit as reported in VIN
*/

//!@{
#define LTC4015_VIN_LO_ALERT_LIMIT_SUBADDR 3
#define LTC4015_VIN_LO_ALERT_LIMIT (0 << 12 | (16 - 1) << 8 | LTC4015_VIN_LO_ALERT_LIMIT_SUBADDR)
//!@}
/*! @defgroup LTC4015_VIN_LO_ALERT_LIMIT_BF VIN_LO_ALERT_LIMIT_BF
 *  @ingroup LTC4015_register_map
 *  @brief VIN_LO_ALERT_LIMIT_BF Bit Field
 *
 *  Input voltage low alert limit as reported in VIN
 *   - Register: @ref LTC4015_VIN_LO_ALERT_LIMIT "VIN_LO_ALERT_LIMIT"
 *   - CommandCode: 3
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_VIN_LO_ALERT_LIMIT_BF_SUBADDR LTC4015_VIN_LO_ALERT_LIMIT_SUBADDR //!< @ref LTC4015_VIN_LO_ALERT_LIMIT_BF "VIN_LO_ALERT_LIMIT_BF"
#define LTC4015_VIN_LO_ALERT_LIMIT_BF_SIZE 16
#define LTC4015_VIN_LO_ALERT_LIMIT_BF_OFFSET 0
#define LTC4015_VIN_LO_ALERT_LIMIT_BF_MASK 0xFFFF
#define LTC4015_VIN_LO_ALERT_LIMIT_BF (LTC4015_VIN_LO_ALERT_LIMIT_BF_OFFSET << 12 | (LTC4015_VIN_LO_ALERT_LIMIT_BF_SIZE - 1) << 8 | LTC4015_VIN_LO_ALERT_LIMIT_BF_SUBADDR)
//!@}

