YY-Edwards/STM32_USB-FS-Device_v4.1/mylib/DC2039A/LTC4015/LTC4015_reg_defs.h
/*! @defgroup LTC4015_VIN_HI_ALERT_LIMIT VIN_HI_ALERT_LIMIT
 *  @ingroup LTC4015_register_map
 *  @brief VIN_HI_ALERT_LIMIT Register
 *
 * |                  15:0 |
 * |:---------------------:|
 * | VIN_HI_ALERT_LIMIT_BF |
 *
 *   - CommandCode: 4
 *   - Contains Bit Fields:
 *     + @ref LTC4015_VIN_HI_ALERT_LIMIT_BF "VIN_HI_ALERT_LIMIT_BF" : Input voltage high alert limit as reported in VIN
*/

//!@{
#define LTC4015_VIN_HI_ALERT_LIMIT_SUBADDR 4
#define LTC4015_VIN_HI_ALERT_LIMIT (0 << 12 | (16 - 1) << 8 | LTC4015_VIN_HI_ALERT_LIMIT_SUBADDR)
//!@}
/*! @defgroup LTC4015_VIN_HI_ALERT_LIMIT_BF VIN_HI_ALERT_LIMIT_BF
 *  @ingroup LTC4015_register_map
 *  @brief VIN_HI_ALERT_LIMIT_BF Bit Field
 *
 *  Input voltage high alert limit as reported in VIN
 *   - Register: @ref LTC4015_VIN_HI_ALERT_LIMIT "VIN_HI_ALERT_LIMIT"
 *   - CommandCode: 4
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_VIN_HI_ALERT_LIMIT_BF_SUBADDR LTC4015_VIN_HI_ALERT_LIMIT_SUBADDR //!< @ref LTC4015_VIN_HI_ALERT_LIMIT_BF "VIN_HI_ALERT_LIMIT_BF"
#define LTC4015_VIN_HI_ALERT_LIMIT_BF_SIZE 16
#define LTC4015_VIN_HI_ALERT_LIMIT_BF_OFFSET 0
#define LTC4015_VIN_HI_ALERT_LIMIT_BF_MASK 0xFFFF
#define LTC4015_VIN_HI_ALERT_LIMIT_BF (LTC4015_VIN_HI_ALERT_LIMIT_BF_OFFSET << 12 | (LTC4015_VIN_HI_ALERT_LIMIT_BF_SIZE - 1) << 8 | LTC4015_VIN_HI_ALERT_LIMIT_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_VSYS_LO_ALERT_LIMIT VSYS_LO_ALERT_LIMIT
 *  @ingroup LTC4015_register_map
 *  @brief VSYS_LO_ALERT_LIMIT Register
 *
 * |                   15:0 |
 * |:----------------------:|
 * | VSYS_LO_ALERT_LIMIT_BF |
 *
 *   - CommandCode: 5
 *   - Contains Bit Fields:
 *     + @ref LTC4015_VSYS_LO_ALERT_LIMIT_BF "VSYS_LO_ALERT_LIMIT_BF" : System voltage low alert limit as reported in VSYS
*/

//!@{
#define LTC4015_VSYS_LO_ALERT_LIMIT_SUBADDR 5
#define LTC4015_VSYS_LO_ALERT_LIMIT (0 << 12 | (16 - 1) << 8 | LTC4015_VSYS_LO_ALERT_LIMIT_SUBADDR)
//!@}
/*! @defgroup LTC4015_VSYS_LO_ALERT_LIMIT_BF VSYS_LO_ALERT_LIMIT_BF
 *  @ingroup LTC4015_register_map
 *  @brief VSYS_LO_ALERT_LIMIT_BF Bit Field
 *
 *  System voltage low alert limit as reported in VSYS
 *   - Register: @ref LTC4015_VSYS_LO_ALERT_LIMIT "VSYS_LO_ALERT_LIMIT"
 *   - CommandCode: 5
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_VSYS_LO_ALERT_LIMIT_BF_SUBADDR LTC4015_VSYS_LO_ALERT_LIMIT_SUBADDR //!< @ref LTC4015_VSYS_LO_ALERT_LIMIT_BF "VSYS_LO_ALERT_LIMIT_BF"
#define LTC4015_VSYS_LO_ALERT_LIMIT_BF_SIZE 16
#define LTC4015_VSYS_LO_ALERT_LIMIT_BF_OFFSET 0
#define LTC4015_VSYS_LO_ALERT_LIMIT_BF_MASK 0xFFFF
#define LTC4015_VSYS_LO_ALERT_LIMIT_BF (LTC4015_VSYS_LO_ALERT_LIMIT_BF_OFFSET << 12 | (LTC4015_VSYS_LO_ALERT_LIMIT_BF_SIZE - 1) << 8 | LTC4015_VSYS_LO_ALERT_LIMIT_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_VSYS_HI_ALERT_LIMIT VSYS_HI_ALERT_LIMIT
 *  @ingroup LTC4015_register_map
 *  @brief VSYS_HI_ALERT_LIMIT Register
 *
 * |                   15:0 |
 * |:----------------------:|
 * | VSYS_HI_ALERT_LIMIT_BF |
 *
 *   - CommandCode: 6
 *   - Contains Bit Fields:
 *     + @ref LTC4015_VSYS_HI_ALERT_LIMIT_BF "VSYS_HI_ALERT_LIMIT_BF" : System voltage high alert limit as reported in VSYS
*/

//!@{
#define LTC4015_VSYS_HI_ALERT_LIMIT_SUBADDR 6
#define LTC4015_VSYS_HI_ALERT_LIMIT (0 << 12 | (16 - 1) << 8 | LTC4015_VSYS_HI_ALERT_LIMIT_SUBADDR)
//!@}
/*! @defgroup LTC4015_VSYS_HI_ALERT_LIMIT_BF VSYS_HI_ALERT_LIMIT_BF
 *  @ingroup LTC4015_register_map
 *  @brief VSYS_HI_ALERT_LIMIT_BF Bit Field
 *
 *  System voltage high alert limit as reported in VSYS
 *   - Register: @ref LTC4015_VSYS_HI_ALERT_LIMIT "VSYS_HI_ALERT_LIMIT"
 *   - CommandCode: 6
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_VSYS_HI_ALERT_LIMIT_BF_SUBADDR LTC4015_VSYS_HI_ALERT_LIMIT_SUBADDR //!< @ref LTC4015_VSYS_HI_ALERT_LIMIT_BF "VSYS_HI_ALERT_LIMIT_BF"
#define LTC4015_VSYS_HI_ALERT_LIMIT_BF_SIZE 16
#define LTC4015_VSYS_HI_ALERT_LIMIT_BF_OFFSET 0
#define LTC4015_VSYS_HI_ALERT_LIMIT_BF_MASK 0xFFFF
#define LTC4015_VSYS_HI_ALERT_LIMIT_BF (LTC4015_VSYS_HI_ALERT_LIMIT_BF_OFFSET << 12 | (LTC4015_VSYS_HI_ALERT_LIMIT_BF_SIZE - 1) << 8 | LTC4015_VSYS_HI_ALERT_LIMIT_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_IIN_HI_ALERT_LIMIT IIN_HI_ALERT_LIMIT
 *  @ingroup LTC4015_register_map
 *  @brief IIN_HI_ALERT_LIMIT Register
 *
 * |                  15:0 |
 * |:---------------------:|
 * | IIN_HI_ALERT_LIMIT_BF |
 *
 *   - CommandCode: 7
 *   - Contains Bit Fields:
 *     + @ref LTC4015_IIN_HI_ALERT_LIMIT_BF "IIN_HI_ALERT_LIMIT_BF" : Input current high alert limit as reported in IIN
*/

//!@{
#define LTC4015_IIN_HI_ALERT_LIMIT_SUBADDR 7
#define LTC4015_IIN_HI_ALERT_LIMIT (0 << 12 | (16 - 1) << 8 | LTC4015_IIN_HI_ALERT_LIMIT_SUBADDR)
//!@}
/*! @defgroup LTC4015_IIN_HI_ALERT_LIMIT_BF IIN_HI_ALERT_LIMIT_BF
 *  @ingroup LTC4015_register_map
 *  @brief IIN_HI_ALERT_LIMIT_BF Bit Field
 *
 *  Input current high alert limit as reported in IIN
 *   - Register: @ref LTC4015_IIN_HI_ALERT_LIMIT "IIN_HI_ALERT_LIMIT"
 *   - CommandCode: 7
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_IIN_HI_ALERT_LIMIT_BF_SUBADDR LTC4015_IIN_HI_ALERT_LIMIT_SUBADDR //!< @ref LTC4015_IIN_HI_ALERT_LIMIT_BF "IIN_HI_ALERT_LIMIT_BF"
#define LTC4015_IIN_HI_ALERT_LIMIT_BF_SIZE 16
#define LTC4015_IIN_HI_ALERT_LIMIT_BF_OFFSET 0
#define LTC4015_IIN_HI_ALERT_LIMIT_BF_MASK 0xFFFF
#define LTC4015_IIN_HI_ALERT_LIMIT_BF (LTC4015_IIN_HI_ALERT_LIMIT_BF_OFFSET << 12 | (LTC4015_IIN_HI_ALERT_LIMIT_BF_SIZE - 1) << 8 | LTC4015_IIN_HI_ALERT_LIMIT_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_IBAT_LO_ALERT_LIMIT IBAT_LO_ALERT_LIMIT
 *  @ingroup LTC4015_register_map
 *  @brief IBAT_LO_ALERT_LIMIT Register
 *
 * |                   15:0 |
 * |:----------------------:|
 * | IBAT_LO_ALERT_LIMIT_BF |
 *
 *   - CommandCode: 8
 *   - Contains Bit Fields:
 *     + @ref LTC4015_IBAT_LO_ALERT_LIMIT_BF "IBAT_LO_ALERT_LIMIT_BF" : Charge current low alert limit as reported in IBAT
*/

//!@{
#define LTC4015_IBAT_LO_ALERT_LIMIT_SUBADDR 8
#define LTC4015_IBAT_LO_ALERT_LIMIT (0 << 12 | (16 - 1) << 8 | LTC4015_IBAT_LO_ALERT_LIMIT_SUBADDR)
//!@}
/*! @defgroup LTC4015_IBAT_LO_ALERT_LIMIT_BF IBAT_LO_ALERT_LIMIT_BF
 *  @ingroup LTC4015_register_map
 *  @brief IBAT_LO_ALERT_LIMIT_BF Bit Field
 *
 *  Charge current low alert limit as reported in IBAT
 *   - Register: @ref LTC4015_IBAT_LO_ALERT_LIMIT "IBAT_LO_ALERT_LIMIT"
 *   - CommandCode: 8
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_IBAT_LO_ALERT_LIMIT_BF_SUBADDR LTC4015_IBAT_LO_ALERT_LIMIT_SUBADDR //!< @ref LTC4015_IBAT_LO_ALERT_LIMIT_BF "IBAT_LO_ALERT_LIMIT_BF"
#define LTC4015_IBAT_LO_ALERT_LIMIT_BF_SIZE 16
#define LTC4015_IBAT_LO_ALERT_LIMIT_BF_OFFSET 0
#define LTC4015_IBAT_LO_ALERT_LIMIT_BF_MASK 0xFFFF
#define LTC4015_IBAT_LO_ALERT_LIMIT_BF (LTC4015_IBAT_LO_ALERT_LIMIT_BF_OFFSET << 12 | (LTC4015_IBAT_LO_ALERT_LIMIT_BF_SIZE - 1) << 8 | LTC4015_IBAT_LO_ALERT_LIMIT_BF_SUBADDR)
//!@}

