YY-Edwards/STM32_USB-FS-Device_v4.1/mylib/DC2039A/LTC4015/LTC4015_reg_defs.h
/*! @defgroup LTC4015_DIE_TEMP_HI_ALERT_LIMIT DIE_TEMP_HI_ALERT_LIMIT
 *  @ingroup LTC4015_register_map
 *  @brief DIE_TEMP_HI_ALERT_LIMIT Register
 *
 * |                       15:0 |
 * |:--------------------------:|
 * | DIE_TEMP_HI_ALERT_LIMIT_BF |
 *
 *   - CommandCode: 9
 *   - Contains Bit Fields:
 *     + @ref LTC4015_DIE_TEMP_HI_ALERT_LIMIT_BF "DIE_TEMP_HI_ALERT_LIMIT_BF" : Die temperature high alert limit as reported in DIE_TEMP
*/

//!@{
#define LTC4015_DIE_TEMP_HI_ALERT_LIMIT_SUBADDR 9
#define LTC4015_DIE_TEMP_HI_ALERT_LIMIT (0 << 12 | (16 - 1) << 8 | LTC4015_DIE_TEMP_HI_ALERT_LIMIT_SUBADDR)
//!@}
/*! @defgroup LTC4015_DIE_TEMP_HI_ALERT_LIMIT_BF DIE_TEMP_HI_ALERT_LIMIT_BF
 *  @ingroup LTC4015_register_map
 *  @brief DIE_TEMP_HI_ALERT_LIMIT_BF Bit Field
 *
 *  Die temperature high alert limit as reported in DIE_TEMP
 *   - Register: @ref LTC4015_DIE_TEMP_HI_ALERT_LIMIT "DIE_TEMP_HI_ALERT_LIMIT"
 *   - CommandCode: 9
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_DIE_TEMP_HI_ALERT_LIMIT_BF_SUBADDR LTC4015_DIE_TEMP_HI_ALERT_LIMIT_SUBADDR //!< @ref LTC4015_DIE_TEMP_HI_ALERT_LIMIT_BF "DIE_TEMP_HI_ALERT_LIMIT_BF"
#define LTC4015_DIE_TEMP_HI_ALERT_LIMIT_BF_SIZE 16
#define LTC4015_DIE_TEMP_HI_ALERT_LIMIT_BF_OFFSET 0
#define LTC4015_DIE_TEMP_HI_ALERT_LIMIT_BF_MASK 0xFFFF
#define LTC4015_DIE_TEMP_HI_ALERT_LIMIT_BF (LTC4015_DIE_TEMP_HI_ALERT_LIMIT_BF_OFFSET << 12 | (LTC4015_DIE_TEMP_HI_ALERT_LIMIT_BF_SIZE - 1) << 8 | LTC4015_DIE_TEMP_HI_ALERT_LIMIT_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_BSR_HI_ALERT_LIMIT BSR_HI_ALERT_LIMIT
 *  @ingroup LTC4015_register_map
 *  @brief BSR_HI_ALERT_LIMIT Register
 *
 * |                  15:0 |
 * |:---------------------:|
 * | BSR_HI_ALERT_LIMIT_BF |
 *
 *   - CommandCode: 10
 *   - Contains Bit Fields:
 *     + @ref LTC4015_BSR_HI_ALERT_LIMIT_BF "BSR_HI_ALERT_LIMIT_BF" : Battery series resistance high alert limit as reported in BSR
*/

//!@{
#define LTC4015_BSR_HI_ALERT_LIMIT_SUBADDR 10
#define LTC4015_BSR_HI_ALERT_LIMIT (0 << 12 | (16 - 1) << 8 | LTC4015_BSR_HI_ALERT_LIMIT_SUBADDR)
//!@}
/*! @defgroup LTC4015_BSR_HI_ALERT_LIMIT_BF BSR_HI_ALERT_LIMIT_BF
 *  @ingroup LTC4015_register_map
 *  @brief BSR_HI_ALERT_LIMIT_BF Bit Field
 *
 *  Battery series resistance high alert limit as reported in BSR
 *   - Register: @ref LTC4015_BSR_HI_ALERT_LIMIT "BSR_HI_ALERT_LIMIT"
 *   - CommandCode: 10
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_BSR_HI_ALERT_LIMIT_BF_SUBADDR LTC4015_BSR_HI_ALERT_LIMIT_SUBADDR //!< @ref LTC4015_BSR_HI_ALERT_LIMIT_BF "BSR_HI_ALERT_LIMIT_BF"
#define LTC4015_BSR_HI_ALERT_LIMIT_BF_SIZE 16
#define LTC4015_BSR_HI_ALERT_LIMIT_BF_OFFSET 0
#define LTC4015_BSR_HI_ALERT_LIMIT_BF_MASK 0xFFFF
#define LTC4015_BSR_HI_ALERT_LIMIT_BF (LTC4015_BSR_HI_ALERT_LIMIT_BF_OFFSET << 12 | (LTC4015_BSR_HI_ALERT_LIMIT_BF_SIZE - 1) << 8 | LTC4015_BSR_HI_ALERT_LIMIT_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_NTC_RATIO_HI_ALERT_LIMIT NTC_RATIO_HI_ALERT_LIMIT
 *  @ingroup LTC4015_register_map
 *  @brief NTC_RATIO_HI_ALERT_LIMIT Register
 *
 * |                        15:0 |
 * |:---------------------------:|
 * | NTC_RATIO_HI_ALERT_LIMIT_BF |
 *
 *   - CommandCode: 11
 *   - Contains Bit Fields:
 *     + @ref LTC4015_NTC_RATIO_HI_ALERT_LIMIT_BF "NTC_RATIO_HI_ALERT_LIMIT_BF" : Thermistor ratio high (cold battery) alert limit as reported in NTC_RATIO
*/

//!@{
#define LTC4015_NTC_RATIO_HI_ALERT_LIMIT_SUBADDR 11
#define LTC4015_NTC_RATIO_HI_ALERT_LIMIT (0 << 12 | (16 - 1) << 8 | LTC4015_NTC_RATIO_HI_ALERT_LIMIT_SUBADDR)
//!@}
/*! @defgroup LTC4015_NTC_RATIO_HI_ALERT_LIMIT_BF NTC_RATIO_HI_ALERT_LIMIT_BF
 *  @ingroup LTC4015_register_map
 *  @brief NTC_RATIO_HI_ALERT_LIMIT_BF Bit Field
 *
 *  Thermistor ratio high (cold battery) alert limit as reported in NTC_RATIO
 *   - Register: @ref LTC4015_NTC_RATIO_HI_ALERT_LIMIT "NTC_RATIO_HI_ALERT_LIMIT"
 *   - CommandCode: 11
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_NTC_RATIO_HI_ALERT_LIMIT_BF_SUBADDR LTC4015_NTC_RATIO_HI_ALERT_LIMIT_SUBADDR //!< @ref LTC4015_NTC_RATIO_HI_ALERT_LIMIT_BF "NTC_RATIO_HI_ALERT_LIMIT_BF"
#define LTC4015_NTC_RATIO_HI_ALERT_LIMIT_BF_SIZE 16
#define LTC4015_NTC_RATIO_HI_ALERT_LIMIT_BF_OFFSET 0
#define LTC4015_NTC_RATIO_HI_ALERT_LIMIT_BF_MASK 0xFFFF
#define LTC4015_NTC_RATIO_HI_ALERT_LIMIT_BF (LTC4015_NTC_RATIO_HI_ALERT_LIMIT_BF_OFFSET << 12 | (LTC4015_NTC_RATIO_HI_ALERT_LIMIT_BF_SIZE - 1) << 8 | LTC4015_NTC_RATIO_HI_ALERT_LIMIT_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_NTC_RATIO_LO_ALERT_LIMIT NTC_RATIO_LO_ALERT_LIMIT
 *  @ingroup LTC4015_register_map
 *  @brief NTC_RATIO_LO_ALERT_LIMIT Register
 *
 * |                        15:0 |
 * |:---------------------------:|
 * | NTC_RATIO_LO_ALERT_LIMIT_BF |
 *
 *   - CommandCode: 12
 *   - Contains Bit Fields:
 *     + @ref LTC4015_NTC_RATIO_LO_ALERT_LIMIT_BF "NTC_RATIO_LO_ALERT_LIMIT_BF" : Thermistor ratio low (hot battery) alert limit as reported in NTC_RATIO
*/

//!@{
#define LTC4015_NTC_RATIO_LO_ALERT_LIMIT_SUBADDR 12
#define LTC4015_NTC_RATIO_LO_ALERT_LIMIT (0 << 12 | (16 - 1) << 8 | LTC4015_NTC_RATIO_LO_ALERT_LIMIT_SUBADDR)
//!@}
/*! @defgroup LTC4015_NTC_RATIO_LO_ALERT_LIMIT_BF NTC_RATIO_LO_ALERT_LIMIT_BF
 *  @ingroup LTC4015_register_map
 *  @brief NTC_RATIO_LO_ALERT_LIMIT_BF Bit Field
 *
 *  Thermistor ratio low (hot battery) alert limit as reported in NTC_RATIO
 *   - Register: @ref LTC4015_NTC_RATIO_LO_ALERT_LIMIT "NTC_RATIO_LO_ALERT_LIMIT"
 *   - CommandCode: 12
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_NTC_RATIO_LO_ALERT_LIMIT_BF_SUBADDR LTC4015_NTC_RATIO_LO_ALERT_LIMIT_SUBADDR //!< @ref LTC4015_NTC_RATIO_LO_ALERT_LIMIT_BF "NTC_RATIO_LO_ALERT_LIMIT_BF"
#define LTC4015_NTC_RATIO_LO_ALERT_LIMIT_BF_SIZE 16
#define LTC4015_NTC_RATIO_LO_ALERT_LIMIT_BF_OFFSET 0
#define LTC4015_NTC_RATIO_LO_ALERT_LIMIT_BF_MASK 0xFFFF
#define LTC4015_NTC_RATIO_LO_ALERT_LIMIT_BF (LTC4015_NTC_RATIO_LO_ALERT_LIMIT_BF_OFFSET << 12 | (LTC4015_NTC_RATIO_LO_ALERT_LIMIT_BF_SIZE - 1) << 8 | LTC4015_NTC_RATIO_LO_ALERT_LIMIT_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_EN_LIMIT_ALERTS EN_LIMIT_ALERTS
 *  @ingroup LTC4015_register_map
 *  @brief EN_LIMIT_ALERTS Register
 *
 * |                         15 |  14 |                     13 |                      12 |                  11 |                  10 |                  9 |                  8 |                   7 |                   6 |                  5 |                   4 |                       3 |                  2 |                        1 |                        0 |
 * |:--------------------------:|:---:|:----------------------:|:-----------------------:|:-------------------:|:-------------------:|:------------------:|:------------------:|:-------------------:|:-------------------:|:------------------:|:-------------------:|:-----------------------:|:------------------:|:------------------------:|:------------------------:|
 * | EN_MEAS_SYS_VALID_ALERT_BF | n/a | EN_QCOUNT_LOW_ALERT_BF | EN_QCOUNT_HIGH_ALERT_BF | EN_VBAT_LO_ALERT_BF | EN_VBAT_HI_ALERT_BF | EN_VIN_LO_ALERT_BF | EN_VIN_HI_ALERT_BF | EN_VSYS_LO_ALERT_BF | EN_VSYS_HI_ALERT_BF | EN_IIN_HI_ALERT_BF | EN_IBAT_LO_ALERT_BF | EN_DIE_TEMP_HI_ALERT_BF | EN_BSR_HI_ALERT_BF | EN_NTC_RATIO_HI_ALERT_BF | EN_NTC_RATIO_LO_ALERT_BF |
 *
 * Enable limit monitoring and alert notification via SMBALERT
 *   - CommandCode: 13
 *   - Contains Bit Fields:
 *     + @ref LTC4015_EN_MEAS_SYS_VALID_ALERT_BF "EN_MEAS_SYS_VALID_ALERT_BF" : Enable meas_sys_valid_alert
 *     + @ref LTC4015_EN_QCOUNT_LOW_ALERT_BF "EN_QCOUNT_LOW_ALERT_BF" : Enable coulomb counter value low alert
 *     + @ref LTC4015_EN_QCOUNT_HIGH_ALERT_BF "EN_QCOUNT_HIGH_ALERT_BF" : Enable coulomb counter value high alert
 *     + @ref LTC4015_EN_VBAT_LO_ALERT_BF "EN_VBAT_LO_ALERT_BF" : Enable battery undervoltage alert
 *     + @ref LTC4015_EN_VBAT_HI_ALERT_BF "EN_VBAT_HI_ALERT_BF" : Enable battery overvoltage alert
 *     + @ref LTC4015_EN_VIN_LO_ALERT_BF "EN_VIN_LO_ALERT_BF" : Enable input undervoltage alert
 *     + @ref LTC4015_EN_VIN_HI_ALERT_BF "EN_VIN_HI_ALERT_BF" : Enable input overvoltage alert
 *     + @ref LTC4015_EN_VSYS_LO_ALERT_BF "EN_VSYS_LO_ALERT_BF" : Enable output undervoltage alert
 *     + @ref LTC4015_EN_VSYS_HI_ALERT_BF "EN_VSYS_HI_ALERT_BF" : Enable output overvoltage alert
 *     + @ref LTC4015_EN_IIN_HI_ALERT_BF "EN_IIN_HI_ALERT_BF" : Enable input overcurrent alert
 *     + @ref LTC4015_EN_IBAT_LO_ALERT_BF "EN_IBAT_LO_ALERT_BF" : Enable battery current low alert
 *     + @ref LTC4015_EN_DIE_TEMP_HI_ALERT_BF "EN_DIE_TEMP_HI_ALERT_BF" : Enable die temperature high alert
 *     + @ref LTC4015_EN_BSR_HI_ALERT_BF "EN_BSR_HI_ALERT_BF" : Enable battery series resistance high alert
 *     + @ref LTC4015_EN_NTC_RATIO_HI_ALERT_BF "EN_NTC_RATIO_HI_ALERT_BF" : Enable thermistor ratio high (cold battery) alert
 *     + @ref LTC4015_EN_NTC_RATIO_LO_ALERT_BF "EN_NTC_RATIO_LO_ALERT_BF" : Enable thermistor ratio low (hot battery) alert
*/

//!@{
#define LTC4015_EN_LIMIT_ALERTS_SUBADDR 13
#define LTC4015_EN_LIMIT_ALERTS (0 << 12 | (16 - 1) << 8 | LTC4015_EN_LIMIT_ALERTS_SUBADDR)
//!@}
/*! @defgroup LTC4015_EN_MEAS_SYS_VALID_ALERT_BF EN_MEAS_SYS_VALID_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief EN_MEAS_SYS_VALID_ALERT_BF Bit Field
 *
 *  Enable meas_sys_valid_alert
 *   - Register: @ref LTC4015_EN_LIMIT_ALERTS "EN_LIMIT_ALERTS"
 *   - CommandCode: 13
 *   - Size: 1
 *   - Offset: 15
 *   - MSB: 15
 *   - MASK: 0x8000
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_EN_MEAS_SYS_VALID_ALERT_BF_SUBADDR LTC4015_EN_LIMIT_ALERTS_SUBADDR //!< @ref LTC4015_EN_MEAS_SYS_VALID_ALERT_BF "EN_MEAS_SYS_VALID_ALERT_BF"
#define LTC4015_EN_MEAS_SYS_VALID_ALERT_BF_SIZE 1
#define LTC4015_EN_MEAS_SYS_VALID_ALERT_BF_OFFSET 15
#define LTC4015_EN_MEAS_SYS_VALID_ALERT_BF_MASK 0x8000
#define LTC4015_EN_MEAS_SYS_VALID_ALERT_BF (LTC4015_EN_MEAS_SYS_VALID_ALERT_BF_OFFSET << 12 | (LTC4015_EN_MEAS_SYS_VALID_ALERT_BF_SIZE - 1) << 8 | LTC4015_EN_MEAS_SYS_VALID_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_EN_QCOUNT_LOW_ALERT_BF EN_QCOUNT_LOW_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief EN_QCOUNT_LOW_ALERT_BF Bit Field
 *
 *  Enable coulomb counter value low alert
 *   - Register: @ref LTC4015_EN_LIMIT_ALERTS "EN_LIMIT_ALERTS"
 *   - CommandCode: 13
 *   - Size: 1
 *   - Offset: 13
 *   - MSB: 13
 *   - MASK: 0x2000
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_EN_QCOUNT_LOW_ALERT_BF_SUBADDR LTC4015_EN_LIMIT_ALERTS_SUBADDR //!< @ref LTC4015_EN_QCOUNT_LOW_ALERT_BF "EN_QCOUNT_LOW_ALERT_BF"
#define LTC4015_EN_QCOUNT_LOW_ALERT_BF_SIZE 1
#define LTC4015_EN_QCOUNT_LOW_ALERT_BF_OFFSET 13
#define LTC4015_EN_QCOUNT_LOW_ALERT_BF_MASK 0x2000
#define LTC4015_EN_QCOUNT_LOW_ALERT_BF (LTC4015_EN_QCOUNT_LOW_ALERT_BF_OFFSET << 12 | (LTC4015_EN_QCOUNT_LOW_ALERT_BF_SIZE - 1) << 8 | LTC4015_EN_QCOUNT_LOW_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_EN_QCOUNT_HIGH_ALERT_BF EN_QCOUNT_HIGH_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief EN_QCOUNT_HIGH_ALERT_BF Bit Field
 *
 *  Enable coulomb counter value high alert
 *   - Register: @ref LTC4015_EN_LIMIT_ALERTS "EN_LIMIT_ALERTS"
 *   - CommandCode: 13
 *   - Size: 1
 *   - Offset: 12
 *   - MSB: 12
 *   - MASK: 0x1000
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_EN_QCOUNT_HIGH_ALERT_BF_SUBADDR LTC4015_EN_LIMIT_ALERTS_SUBADDR //!< @ref LTC4015_EN_QCOUNT_HIGH_ALERT_BF "EN_QCOUNT_HIGH_ALERT_BF"
#define LTC4015_EN_QCOUNT_HIGH_ALERT_BF_SIZE 1
#define LTC4015_EN_QCOUNT_HIGH_ALERT_BF_OFFSET 12
#define LTC4015_EN_QCOUNT_HIGH_ALERT_BF_MASK 0x1000
#define LTC4015_EN_QCOUNT_HIGH_ALERT_BF (LTC4015_EN_QCOUNT_HIGH_ALERT_BF_OFFSET << 12 | (LTC4015_EN_QCOUNT_HIGH_ALERT_BF_SIZE - 1) << 8 | LTC4015_EN_QCOUNT_HIGH_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_EN_VBAT_LO_ALERT_BF EN_VBAT_LO_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief EN_VBAT_LO_ALERT_BF Bit Field
 *
 *  Enable battery undervoltage alert
 *   - Register: @ref LTC4015_EN_LIMIT_ALERTS "EN_LIMIT_ALERTS"
 *   - CommandCode: 13
 *   - Size: 1
 *   - Offset: 11
 *   - MSB: 11
 *   - MASK: 0x0800
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_EN_VBAT_LO_ALERT_BF_SUBADDR LTC4015_EN_LIMIT_ALERTS_SUBADDR //!< @ref LTC4015_EN_VBAT_LO_ALERT_BF "EN_VBAT_LO_ALERT_BF"
#define LTC4015_EN_VBAT_LO_ALERT_BF_SIZE 1
#define LTC4015_EN_VBAT_LO_ALERT_BF_OFFSET 11
#define LTC4015_EN_VBAT_LO_ALERT_BF_MASK 0x0800
#define LTC4015_EN_VBAT_LO_ALERT_BF (LTC4015_EN_VBAT_LO_ALERT_BF_OFFSET << 12 | (LTC4015_EN_VBAT_LO_ALERT_BF_SIZE - 1) << 8 | LTC4015_EN_VBAT_LO_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_EN_VBAT_HI_ALERT_BF EN_VBAT_HI_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief EN_VBAT_HI_ALERT_BF Bit Field
 *
 *  Enable battery overvoltage alert
 *   - Register: @ref LTC4015_EN_LIMIT_ALERTS "EN_LIMIT_ALERTS"
 *   - CommandCode: 13
 *   - Size: 1
 *   - Offset: 10
 *   - MSB: 10
 *   - MASK: 0x0400
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_EN_VBAT_HI_ALERT_BF_SUBADDR LTC4015_EN_LIMIT_ALERTS_SUBADDR //!< @ref LTC4015_EN_VBAT_HI_ALERT_BF "EN_VBAT_HI_ALERT_BF"
#define LTC4015_EN_VBAT_HI_ALERT_BF_SIZE 1
#define LTC4015_EN_VBAT_HI_ALERT_BF_OFFSET 10
#define LTC4015_EN_VBAT_HI_ALERT_BF_MASK 0x0400
#define LTC4015_EN_VBAT_HI_ALERT_BF (LTC4015_EN_VBAT_HI_ALERT_BF_OFFSET << 12 | (LTC4015_EN_VBAT_HI_ALERT_BF_SIZE - 1) << 8 | LTC4015_EN_VBAT_HI_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_EN_VIN_LO_ALERT_BF EN_VIN_LO_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief EN_VIN_LO_ALERT_BF Bit Field
 *
 *  Enable input undervoltage alert
 *   - Register: @ref LTC4015_EN_LIMIT_ALERTS "EN_LIMIT_ALERTS"
 *   - CommandCode: 13
 *   - Size: 1
 *   - Offset: 9
 *   - MSB: 9
 *   - MASK: 0x0200
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_EN_VIN_LO_ALERT_BF_SUBADDR LTC4015_EN_LIMIT_ALERTS_SUBADDR //!< @ref LTC4015_EN_VIN_LO_ALERT_BF "EN_VIN_LO_ALERT_BF"
#define LTC4015_EN_VIN_LO_ALERT_BF_SIZE 1
#define LTC4015_EN_VIN_LO_ALERT_BF_OFFSET 9
#define LTC4015_EN_VIN_LO_ALERT_BF_MASK 0x0200
#define LTC4015_EN_VIN_LO_ALERT_BF (LTC4015_EN_VIN_LO_ALERT_BF_OFFSET << 12 | (LTC4015_EN_VIN_LO_ALERT_BF_SIZE - 1) << 8 | LTC4015_EN_VIN_LO_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_EN_VIN_HI_ALERT_BF EN_VIN_HI_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief EN_VIN_HI_ALERT_BF Bit Field
 *
 *  Enable input overvoltage alert
 *   - Register: @ref LTC4015_EN_LIMIT_ALERTS "EN_LIMIT_ALERTS"
 *   - CommandCode: 13
 *   - Size: 1
 *   - Offset: 8
 *   - MSB: 8
 *   - MASK: 0x0100
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_EN_VIN_HI_ALERT_BF_SUBADDR LTC4015_EN_LIMIT_ALERTS_SUBADDR //!< @ref LTC4015_EN_VIN_HI_ALERT_BF "EN_VIN_HI_ALERT_BF"
#define LTC4015_EN_VIN_HI_ALERT_BF_SIZE 1
#define LTC4015_EN_VIN_HI_ALERT_BF_OFFSET 8
#define LTC4015_EN_VIN_HI_ALERT_BF_MASK 0x0100
#define LTC4015_EN_VIN_HI_ALERT_BF (LTC4015_EN_VIN_HI_ALERT_BF_OFFSET << 12 | (LTC4015_EN_VIN_HI_ALERT_BF_SIZE - 1) << 8 | LTC4015_EN_VIN_HI_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_EN_VSYS_LO_ALERT_BF EN_VSYS_LO_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief EN_VSYS_LO_ALERT_BF Bit Field
 *
 *  Enable output undervoltage alert
 *   - Register: @ref LTC4015_EN_LIMIT_ALERTS "EN_LIMIT_ALERTS"
 *   - CommandCode: 13
 *   - Size: 1
 *   - Offset: 7
 *   - MSB: 7
 *   - MASK: 0x0080
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_EN_VSYS_LO_ALERT_BF_SUBADDR LTC4015_EN_LIMIT_ALERTS_SUBADDR //!< @ref LTC4015_EN_VSYS_LO_ALERT_BF "EN_VSYS_LO_ALERT_BF"
#define LTC4015_EN_VSYS_LO_ALERT_BF_SIZE 1
#define LTC4015_EN_VSYS_LO_ALERT_BF_OFFSET 7
#define LTC4015_EN_VSYS_LO_ALERT_BF_MASK 0x0080
#define LTC4015_EN_VSYS_LO_ALERT_BF (LTC4015_EN_VSYS_LO_ALERT_BF_OFFSET << 12 | (LTC4015_EN_VSYS_LO_ALERT_BF_SIZE - 1) << 8 | LTC4015_EN_VSYS_LO_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_EN_VSYS_HI_ALERT_BF EN_VSYS_HI_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief EN_VSYS_HI_ALERT_BF Bit Field
 *
 *  Enable output overvoltage alert
 *   - Register: @ref LTC4015_EN_LIMIT_ALERTS "EN_LIMIT_ALERTS"
 *   - CommandCode: 13
 *   - Size: 1
 *   - Offset: 6
 *   - MSB: 6
 *   - MASK: 0x0040
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_EN_VSYS_HI_ALERT_BF_SUBADDR LTC4015_EN_LIMIT_ALERTS_SUBADDR //!< @ref LTC4015_EN_VSYS_HI_ALERT_BF "EN_VSYS_HI_ALERT_BF"
#define LTC4015_EN_VSYS_HI_ALERT_BF_SIZE 1
#define LTC4015_EN_VSYS_HI_ALERT_BF_OFFSET 6
#define LTC4015_EN_VSYS_HI_ALERT_BF_MASK 0x0040
#define LTC4015_EN_VSYS_HI_ALERT_BF (LTC4015_EN_VSYS_HI_ALERT_BF_OFFSET << 12 | (LTC4015_EN_VSYS_HI_ALERT_BF_SIZE - 1) << 8 | LTC4015_EN_VSYS_HI_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_EN_IIN_HI_ALERT_BF EN_IIN_HI_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief EN_IIN_HI_ALERT_BF Bit Field
 *
 *  Enable input overcurrent alert
 *   - Register: @ref LTC4015_EN_LIMIT_ALERTS "EN_LIMIT_ALERTS"
 *   - CommandCode: 13
 *   - Size: 1
 *   - Offset: 5
 *   - MSB: 5
 *   - MASK: 0x0020
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_EN_IIN_HI_ALERT_BF_SUBADDR LTC4015_EN_LIMIT_ALERTS_SUBADDR //!< @ref LTC4015_EN_IIN_HI_ALERT_BF "EN_IIN_HI_ALERT_BF"
#define LTC4015_EN_IIN_HI_ALERT_BF_SIZE 1
#define LTC4015_EN_IIN_HI_ALERT_BF_OFFSET 5
#define LTC4015_EN_IIN_HI_ALERT_BF_MASK 0x0020
#define LTC4015_EN_IIN_HI_ALERT_BF (LTC4015_EN_IIN_HI_ALERT_BF_OFFSET << 12 | (LTC4015_EN_IIN_HI_ALERT_BF_SIZE - 1) << 8 | LTC4015_EN_IIN_HI_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_EN_IBAT_LO_ALERT_BF EN_IBAT_LO_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief EN_IBAT_LO_ALERT_BF Bit Field
 *
 *  Enable battery current low alert
 *   - Register: @ref LTC4015_EN_LIMIT_ALERTS "EN_LIMIT_ALERTS"
 *   - CommandCode: 13
 *   - Size: 1
 *   - Offset: 4
 *   - MSB: 4
 *   - MASK: 0x0010
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_EN_IBAT_LO_ALERT_BF_SUBADDR LTC4015_EN_LIMIT_ALERTS_SUBADDR //!< @ref LTC4015_EN_IBAT_LO_ALERT_BF "EN_IBAT_LO_ALERT_BF"
#define LTC4015_EN_IBAT_LO_ALERT_BF_SIZE 1
#define LTC4015_EN_IBAT_LO_ALERT_BF_OFFSET 4
#define LTC4015_EN_IBAT_LO_ALERT_BF_MASK 0x0010
#define LTC4015_EN_IBAT_LO_ALERT_BF (LTC4015_EN_IBAT_LO_ALERT_BF_OFFSET << 12 | (LTC4015_EN_IBAT_LO_ALERT_BF_SIZE - 1) << 8 | LTC4015_EN_IBAT_LO_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_EN_DIE_TEMP_HI_ALERT_BF EN_DIE_TEMP_HI_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief EN_DIE_TEMP_HI_ALERT_BF Bit Field
 *
 *  Enable die temperature high alert
 *   - Register: @ref LTC4015_EN_LIMIT_ALERTS "EN_LIMIT_ALERTS"
 *   - CommandCode: 13
 *   - Size: 1
 *   - Offset: 3
 *   - MSB: 3
 *   - MASK: 0x0008
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_EN_DIE_TEMP_HI_ALERT_BF_SUBADDR LTC4015_EN_LIMIT_ALERTS_SUBADDR //!< @ref LTC4015_EN_DIE_TEMP_HI_ALERT_BF "EN_DIE_TEMP_HI_ALERT_BF"
#define LTC4015_EN_DIE_TEMP_HI_ALERT_BF_SIZE 1
#define LTC4015_EN_DIE_TEMP_HI_ALERT_BF_OFFSET 3
#define LTC4015_EN_DIE_TEMP_HI_ALERT_BF_MASK 0x0008
#define LTC4015_EN_DIE_TEMP_HI_ALERT_BF (LTC4015_EN_DIE_TEMP_HI_ALERT_BF_OFFSET << 12 | (LTC4015_EN_DIE_TEMP_HI_ALERT_BF_SIZE - 1) << 8 | LTC4015_EN_DIE_TEMP_HI_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_EN_BSR_HI_ALERT_BF EN_BSR_HI_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief EN_BSR_HI_ALERT_BF Bit Field
 *
 *  Enable battery series resistance high alert
 *   - Register: @ref LTC4015_EN_LIMIT_ALERTS "EN_LIMIT_ALERTS"
 *   - CommandCode: 13
 *   - Size: 1
 *   - Offset: 2
 *   - MSB: 2
 *   - MASK: 0x0004
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_EN_BSR_HI_ALERT_BF_SUBADDR LTC4015_EN_LIMIT_ALERTS_SUBADDR //!< @ref LTC4015_EN_BSR_HI_ALERT_BF "EN_BSR_HI_ALERT_BF"
#define LTC4015_EN_BSR_HI_ALERT_BF_SIZE 1
#define LTC4015_EN_BSR_HI_ALERT_BF_OFFSET 2
#define LTC4015_EN_BSR_HI_ALERT_BF_MASK 0x0004
#define LTC4015_EN_BSR_HI_ALERT_BF (LTC4015_EN_BSR_HI_ALERT_BF_OFFSET << 12 | (LTC4015_EN_BSR_HI_ALERT_BF_SIZE - 1) << 8 | LTC4015_EN_BSR_HI_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_EN_NTC_RATIO_HI_ALERT_BF EN_NTC_RATIO_HI_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief EN_NTC_RATIO_HI_ALERT_BF Bit Field
 *
 *  Enable thermistor ratio high (cold battery) alert
 *   - Register: @ref LTC4015_EN_LIMIT_ALERTS "EN_LIMIT_ALERTS"
 *   - CommandCode: 13
 *   - Size: 1
 *   - Offset: 1
 *   - MSB: 1
 *   - MASK: 0x0002
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_EN_NTC_RATIO_HI_ALERT_BF_SUBADDR LTC4015_EN_LIMIT_ALERTS_SUBADDR //!< @ref LTC4015_EN_NTC_RATIO_HI_ALERT_BF "EN_NTC_RATIO_HI_ALERT_BF"
#define LTC4015_EN_NTC_RATIO_HI_ALERT_BF_SIZE 1
#define LTC4015_EN_NTC_RATIO_HI_ALERT_BF_OFFSET 1
#define LTC4015_EN_NTC_RATIO_HI_ALERT_BF_MASK 0x0002
#define LTC4015_EN_NTC_RATIO_HI_ALERT_BF (LTC4015_EN_NTC_RATIO_HI_ALERT_BF_OFFSET << 12 | (LTC4015_EN_NTC_RATIO_HI_ALERT_BF_SIZE - 1) << 8 | LTC4015_EN_NTC_RATIO_HI_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_EN_NTC_RATIO_LO_ALERT_BF EN_NTC_RATIO_LO_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief EN_NTC_RATIO_LO_ALERT_BF Bit Field
 *
 *  Enable thermistor ratio low (hot battery) alert
 *   - Register: @ref LTC4015_EN_LIMIT_ALERTS "EN_LIMIT_ALERTS"
 *   - CommandCode: 13
 *   - Size: 1
 *   - Offset: 0
 *   - MSB: 0
 *   - MASK: 0x0001
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_EN_NTC_RATIO_LO_ALERT_BF_SUBADDR LTC4015_EN_LIMIT_ALERTS_SUBADDR //!< @ref LTC4015_EN_NTC_RATIO_LO_ALERT_BF "EN_NTC_RATIO_LO_ALERT_BF"
#define LTC4015_EN_NTC_RATIO_LO_ALERT_BF_SIZE 1
#define LTC4015_EN_NTC_RATIO_LO_ALERT_BF_OFFSET 0
#define LTC4015_EN_NTC_RATIO_LO_ALERT_BF_MASK 0x0001
#define LTC4015_EN_NTC_RATIO_LO_ALERT_BF (LTC4015_EN_NTC_RATIO_LO_ALERT_BF_OFFSET << 12 | (LTC4015_EN_NTC_RATIO_LO_ALERT_BF_SIZE - 1) << 8 | LTC4015_EN_NTC_RATIO_LO_ALERT_BF_SUBADDR)
//!@}

