YY-Edwards/STM32_USB-FS-Device_v4.1/mylib/DC2039A/LTC4015/LTC4015_reg_defs.h
/*! @defgroup LTC4015_EN_CHARGER_STATE_ALERTS EN_CHARGER_STATE_ALERTS
 *  @ingroup LTC4015_register_map
 *  @brief EN_CHARGER_STATE_ALERTS Register
 *
 * | 15:11 |                          10 |                         9 |                             8 |                     7 |                        6 |                     5 |                      4 |                         3 |                                 2 |                             1 |                           0 |
 * |:-----:|:---------------------------:|:-------------------------:|:-----------------------------:|:---------------------:|:------------------------:|:---------------------:|:----------------------:|:-------------------------:|:---------------------------------:|:-----------------------------:|:---------------------------:|
 * |   n/a | EN_EQUALIZE_CHARGE_ALERT_BF | EN_ABSORB_CHARGE_ALERT_BF | EN_CHARGER_SUSPENDED_ALERT_BF | EN_PRECHARGE_ALERT_BF | EN_CC_CV_CHARGE_ALERT_BF | EN_NTC_PAUSE_ALERT_BF | EN_TIMER_TERM_ALERT_BF | EN_C_OVER_X_TERM_ALERT_BF | EN_MAX_CHARGE_TIME_FAULT_ALERT_BF | EN_BAT_MISSING_FAULT_ALERT_BF | EN_BAT_SHORT_FAULT_ALERT_BF |
 *
 * Enable charger state notification via SMBALERT
 *   - CommandCode: 14
 *   - Contains Bit Fields:
 *     + @ref LTC4015_EN_EQUALIZE_CHARGE_ALERT_BF "EN_EQUALIZE_CHARGE_ALERT_BF" : Enable alert for lead-acid equalize charge state
 *     + @ref LTC4015_EN_ABSORB_CHARGE_ALERT_BF "EN_ABSORB_CHARGE_ALERT_BF" : Enable alert for absorb charge state
 *     + @ref LTC4015_EN_CHARGER_SUSPENDED_ALERT_BF "EN_CHARGER_SUSPENDED_ALERT_BF" : Enable alert for charger suspended state
 *     + @ref LTC4015_EN_PRECHARGE_ALERT_BF "EN_PRECHARGE_ALERT_BF" : Enable alert for precondition charge state
 *     + @ref LTC4015_EN_CC_CV_CHARGE_ALERT_BF "EN_CC_CV_CHARGE_ALERT_BF" : Enable alert for constant current constant voltage state
 *     + @ref LTC4015_EN_NTC_PAUSE_ALERT_BF "EN_NTC_PAUSE_ALERT_BF" : Enable alert for thermistor pause state
 *     + @ref LTC4015_EN_TIMER_TERM_ALERT_BF "EN_TIMER_TERM_ALERT_BF" : Enable alert for timer termination state
 *     + @ref LTC4015_EN_C_OVER_X_TERM_ALERT_BF "EN_C_OVER_X_TERM_ALERT_BF" : Enable alert for C/x termination state
 *     + @ref LTC4015_EN_MAX_CHARGE_TIME_FAULT_ALERT_BF "EN_MAX_CHARGE_TIME_FAULT_ALERT_BF" : Enable max_charge_time_fault alert
 *     + @ref LTC4015_EN_BAT_MISSING_FAULT_ALERT_BF "EN_BAT_MISSING_FAULT_ALERT_BF" : Enable alert for missing battery fault state
 *     + @ref LTC4015_EN_BAT_SHORT_FAULT_ALERT_BF "EN_BAT_SHORT_FAULT_ALERT_BF" : Enable alert for shorted battery fault state
*/

//!@{
#define LTC4015_EN_CHARGER_STATE_ALERTS_SUBADDR 14
#define LTC4015_EN_CHARGER_STATE_ALERTS (0 << 12 | (16 - 1) << 8 | LTC4015_EN_CHARGER_STATE_ALERTS_SUBADDR)
//!@}
/*! @defgroup LTC4015_EN_EQUALIZE_CHARGE_ALERT_BF EN_EQUALIZE_CHARGE_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief EN_EQUALIZE_CHARGE_ALERT_BF Bit Field
 *
 *  Enable alert for lead-acid equalize charge state
 *   - Register: @ref LTC4015_EN_CHARGER_STATE_ALERTS "EN_CHARGER_STATE_ALERTS"
 *   - CommandCode: 14
 *   - Size: 1
 *   - Offset: 10
 *   - MSB: 10
 *   - MASK: 0x0400
 *   - Access: R/W
 *   - Default: n/a
 */
//!@{
#define LTC4015_EN_EQUALIZE_CHARGE_ALERT_BF_SUBADDR LTC4015_EN_CHARGER_STATE_ALERTS_SUBADDR //!< @ref LTC4015_EN_EQUALIZE_CHARGE_ALERT_BF "EN_EQUALIZE_CHARGE_ALERT_BF"
#define LTC4015_EN_EQUALIZE_CHARGE_ALERT_BF_SIZE 1
#define LTC4015_EN_EQUALIZE_CHARGE_ALERT_BF_OFFSET 10
#define LTC4015_EN_EQUALIZE_CHARGE_ALERT_BF_MASK 0x0400
#define LTC4015_EN_EQUALIZE_CHARGE_ALERT_BF (LTC4015_EN_EQUALIZE_CHARGE_ALERT_BF_OFFSET << 12 | (LTC4015_EN_EQUALIZE_CHARGE_ALERT_BF_SIZE - 1) << 8 | LTC4015_EN_EQUALIZE_CHARGE_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_EN_ABSORB_CHARGE_ALERT_BF EN_ABSORB_CHARGE_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief EN_ABSORB_CHARGE_ALERT_BF Bit Field
 *
 *  Enable alert for absorb charge state
 *   - Register: @ref LTC4015_EN_CHARGER_STATE_ALERTS "EN_CHARGER_STATE_ALERTS"
 *   - CommandCode: 14
 *   - Size: 1
 *   - Offset: 9
 *   - MSB: 9
 *   - MASK: 0x0200
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_EN_ABSORB_CHARGE_ALERT_BF_SUBADDR LTC4015_EN_CHARGER_STATE_ALERTS_SUBADDR //!< @ref LTC4015_EN_ABSORB_CHARGE_ALERT_BF "EN_ABSORB_CHARGE_ALERT_BF"
#define LTC4015_EN_ABSORB_CHARGE_ALERT_BF_SIZE 1
#define LTC4015_EN_ABSORB_CHARGE_ALERT_BF_OFFSET 9
#define LTC4015_EN_ABSORB_CHARGE_ALERT_BF_MASK 0x0200
#define LTC4015_EN_ABSORB_CHARGE_ALERT_BF (LTC4015_EN_ABSORB_CHARGE_ALERT_BF_OFFSET << 12 | (LTC4015_EN_ABSORB_CHARGE_ALERT_BF_SIZE - 1) << 8 | LTC4015_EN_ABSORB_CHARGE_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_EN_CHARGER_SUSPENDED_ALERT_BF EN_CHARGER_SUSPENDED_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief EN_CHARGER_SUSPENDED_ALERT_BF Bit Field
 *
 *  Enable alert for charger suspended state
 *   - Register: @ref LTC4015_EN_CHARGER_STATE_ALERTS "EN_CHARGER_STATE_ALERTS"
 *   - CommandCode: 14
 *   - Size: 1
 *   - Offset: 8
 *   - MSB: 8
 *   - MASK: 0x0100
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_EN_CHARGER_SUSPENDED_ALERT_BF_SUBADDR LTC4015_EN_CHARGER_STATE_ALERTS_SUBADDR //!< @ref LTC4015_EN_CHARGER_SUSPENDED_ALERT_BF "EN_CHARGER_SUSPENDED_ALERT_BF"
#define LTC4015_EN_CHARGER_SUSPENDED_ALERT_BF_SIZE 1
#define LTC4015_EN_CHARGER_SUSPENDED_ALERT_BF_OFFSET 8
#define LTC4015_EN_CHARGER_SUSPENDED_ALERT_BF_MASK 0x0100
#define LTC4015_EN_CHARGER_SUSPENDED_ALERT_BF (LTC4015_EN_CHARGER_SUSPENDED_ALERT_BF_OFFSET << 12 | (LTC4015_EN_CHARGER_SUSPENDED_ALERT_BF_SIZE - 1) << 8 | LTC4015_EN_CHARGER_SUSPENDED_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_EN_PRECHARGE_ALERT_BF EN_PRECHARGE_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief EN_PRECHARGE_ALERT_BF Bit Field
 *
 *  Enable alert for precondition charge state
 *   - Register: @ref LTC4015_EN_CHARGER_STATE_ALERTS "EN_CHARGER_STATE_ALERTS"
 *   - CommandCode: 14
 *   - Size: 1
 *   - Offset: 7
 *   - MSB: 7
 *   - MASK: 0x0080
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_EN_PRECHARGE_ALERT_BF_SUBADDR LTC4015_EN_CHARGER_STATE_ALERTS_SUBADDR //!< @ref LTC4015_EN_PRECHARGE_ALERT_BF "EN_PRECHARGE_ALERT_BF"
#define LTC4015_EN_PRECHARGE_ALERT_BF_SIZE 1
#define LTC4015_EN_PRECHARGE_ALERT_BF_OFFSET 7
#define LTC4015_EN_PRECHARGE_ALERT_BF_MASK 0x0080
#define LTC4015_EN_PRECHARGE_ALERT_BF (LTC4015_EN_PRECHARGE_ALERT_BF_OFFSET << 12 | (LTC4015_EN_PRECHARGE_ALERT_BF_SIZE - 1) << 8 | LTC4015_EN_PRECHARGE_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_EN_CC_CV_CHARGE_ALERT_BF EN_CC_CV_CHARGE_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief EN_CC_CV_CHARGE_ALERT_BF Bit Field
 *
 *  Enable alert for constant current constant voltage state
 *   - Register: @ref LTC4015_EN_CHARGER_STATE_ALERTS "EN_CHARGER_STATE_ALERTS"
 *   - CommandCode: 14
 *   - Size: 1
 *   - Offset: 6
 *   - MSB: 6
 *   - MASK: 0x0040
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_EN_CC_CV_CHARGE_ALERT_BF_SUBADDR LTC4015_EN_CHARGER_STATE_ALERTS_SUBADDR //!< @ref LTC4015_EN_CC_CV_CHARGE_ALERT_BF "EN_CC_CV_CHARGE_ALERT_BF"
#define LTC4015_EN_CC_CV_CHARGE_ALERT_BF_SIZE 1
#define LTC4015_EN_CC_CV_CHARGE_ALERT_BF_OFFSET 6
#define LTC4015_EN_CC_CV_CHARGE_ALERT_BF_MASK 0x0040
#define LTC4015_EN_CC_CV_CHARGE_ALERT_BF (LTC4015_EN_CC_CV_CHARGE_ALERT_BF_OFFSET << 12 | (LTC4015_EN_CC_CV_CHARGE_ALERT_BF_SIZE - 1) << 8 | LTC4015_EN_CC_CV_CHARGE_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_EN_NTC_PAUSE_ALERT_BF EN_NTC_PAUSE_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief EN_NTC_PAUSE_ALERT_BF Bit Field
 *
 *  Enable alert for thermistor pause state
 *   - Register: @ref LTC4015_EN_CHARGER_STATE_ALERTS "EN_CHARGER_STATE_ALERTS"
 *   - CommandCode: 14
 *   - Size: 1
 *   - Offset: 5
 *   - MSB: 5
 *   - MASK: 0x0020
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_EN_NTC_PAUSE_ALERT_BF_SUBADDR LTC4015_EN_CHARGER_STATE_ALERTS_SUBADDR //!< @ref LTC4015_EN_NTC_PAUSE_ALERT_BF "EN_NTC_PAUSE_ALERT_BF"
#define LTC4015_EN_NTC_PAUSE_ALERT_BF_SIZE 1
#define LTC4015_EN_NTC_PAUSE_ALERT_BF_OFFSET 5
#define LTC4015_EN_NTC_PAUSE_ALERT_BF_MASK 0x0020
#define LTC4015_EN_NTC_PAUSE_ALERT_BF (LTC4015_EN_NTC_PAUSE_ALERT_BF_OFFSET << 12 | (LTC4015_EN_NTC_PAUSE_ALERT_BF_SIZE - 1) << 8 | LTC4015_EN_NTC_PAUSE_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_EN_TIMER_TERM_ALERT_BF EN_TIMER_TERM_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief EN_TIMER_TERM_ALERT_BF Bit Field
 *
 *  Enable alert for timer termination state
 *   - Register: @ref LTC4015_EN_CHARGER_STATE_ALERTS "EN_CHARGER_STATE_ALERTS"
 *   - CommandCode: 14
 *   - Size: 1
 *   - Offset: 4
 *   - MSB: 4
 *   - MASK: 0x0010
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_EN_TIMER_TERM_ALERT_BF_SUBADDR LTC4015_EN_CHARGER_STATE_ALERTS_SUBADDR //!< @ref LTC4015_EN_TIMER_TERM_ALERT_BF "EN_TIMER_TERM_ALERT_BF"
#define LTC4015_EN_TIMER_TERM_ALERT_BF_SIZE 1
#define LTC4015_EN_TIMER_TERM_ALERT_BF_OFFSET 4
#define LTC4015_EN_TIMER_TERM_ALERT_BF_MASK 0x0010
#define LTC4015_EN_TIMER_TERM_ALERT_BF (LTC4015_EN_TIMER_TERM_ALERT_BF_OFFSET << 12 | (LTC4015_EN_TIMER_TERM_ALERT_BF_SIZE - 1) << 8 | LTC4015_EN_TIMER_TERM_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_EN_C_OVER_X_TERM_ALERT_BF EN_C_OVER_X_TERM_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief EN_C_OVER_X_TERM_ALERT_BF Bit Field
 *
 *  Enable alert for C/x termination state
 *   - Register: @ref LTC4015_EN_CHARGER_STATE_ALERTS "EN_CHARGER_STATE_ALERTS"
 *   - CommandCode: 14
 *   - Size: 1
 *   - Offset: 3
 *   - MSB: 3
 *   - MASK: 0x0008
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_EN_C_OVER_X_TERM_ALERT_BF_SUBADDR LTC4015_EN_CHARGER_STATE_ALERTS_SUBADDR //!< @ref LTC4015_EN_C_OVER_X_TERM_ALERT_BF "EN_C_OVER_X_TERM_ALERT_BF"
#define LTC4015_EN_C_OVER_X_TERM_ALERT_BF_SIZE 1
#define LTC4015_EN_C_OVER_X_TERM_ALERT_BF_OFFSET 3
#define LTC4015_EN_C_OVER_X_TERM_ALERT_BF_MASK 0x0008
#define LTC4015_EN_C_OVER_X_TERM_ALERT_BF (LTC4015_EN_C_OVER_X_TERM_ALERT_BF_OFFSET << 12 | (LTC4015_EN_C_OVER_X_TERM_ALERT_BF_SIZE - 1) << 8 | LTC4015_EN_C_OVER_X_TERM_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_EN_MAX_CHARGE_TIME_FAULT_ALERT_BF EN_MAX_CHARGE_TIME_FAULT_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief EN_MAX_CHARGE_TIME_FAULT_ALERT_BF Bit Field
 *
 *  Enable max_charge_time_fault alert
 *   - Register: @ref LTC4015_EN_CHARGER_STATE_ALERTS "EN_CHARGER_STATE_ALERTS"
 *   - CommandCode: 14
 *   - Size: 1
 *   - Offset: 2
 *   - MSB: 2
 *   - MASK: 0x0004
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_EN_MAX_CHARGE_TIME_FAULT_ALERT_BF_SUBADDR LTC4015_EN_CHARGER_STATE_ALERTS_SUBADDR //!< @ref LTC4015_EN_MAX_CHARGE_TIME_FAULT_ALERT_BF "EN_MAX_CHARGE_TIME_FAULT_ALERT_BF"
#define LTC4015_EN_MAX_CHARGE_TIME_FAULT_ALERT_BF_SIZE 1
#define LTC4015_EN_MAX_CHARGE_TIME_FAULT_ALERT_BF_OFFSET 2
#define LTC4015_EN_MAX_CHARGE_TIME_FAULT_ALERT_BF_MASK 0x0004
#define LTC4015_EN_MAX_CHARGE_TIME_FAULT_ALERT_BF (LTC4015_EN_MAX_CHARGE_TIME_FAULT_ALERT_BF_OFFSET << 12 | (LTC4015_EN_MAX_CHARGE_TIME_FAULT_ALERT_BF_SIZE - 1) << 8 | LTC4015_EN_MAX_CHARGE_TIME_FAULT_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_EN_BAT_MISSING_FAULT_ALERT_BF EN_BAT_MISSING_FAULT_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief EN_BAT_MISSING_FAULT_ALERT_BF Bit Field
 *
 *  Enable alert for missing battery fault state
 *   - Register: @ref LTC4015_EN_CHARGER_STATE_ALERTS "EN_CHARGER_STATE_ALERTS"
 *   - CommandCode: 14
 *   - Size: 1
 *   - Offset: 1
 *   - MSB: 1
 *   - MASK: 0x0002
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_EN_BAT_MISSING_FAULT_ALERT_BF_SUBADDR LTC4015_EN_CHARGER_STATE_ALERTS_SUBADDR //!< @ref LTC4015_EN_BAT_MISSING_FAULT_ALERT_BF "EN_BAT_MISSING_FAULT_ALERT_BF"
#define LTC4015_EN_BAT_MISSING_FAULT_ALERT_BF_SIZE 1
#define LTC4015_EN_BAT_MISSING_FAULT_ALERT_BF_OFFSET 1
#define LTC4015_EN_BAT_MISSING_FAULT_ALERT_BF_MASK 0x0002
#define LTC4015_EN_BAT_MISSING_FAULT_ALERT_BF (LTC4015_EN_BAT_MISSING_FAULT_ALERT_BF_OFFSET << 12 | (LTC4015_EN_BAT_MISSING_FAULT_ALERT_BF_SIZE - 1) << 8 | LTC4015_EN_BAT_MISSING_FAULT_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_EN_BAT_SHORT_FAULT_ALERT_BF EN_BAT_SHORT_FAULT_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief EN_BAT_SHORT_FAULT_ALERT_BF Bit Field
 *
 *  Enable alert for shorted battery fault state
 *   - Register: @ref LTC4015_EN_CHARGER_STATE_ALERTS "EN_CHARGER_STATE_ALERTS"
 *   - CommandCode: 14
 *   - Size: 1
 *   - Offset: 0
 *   - MSB: 0
 *   - MASK: 0x0001
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_EN_BAT_SHORT_FAULT_ALERT_BF_SUBADDR LTC4015_EN_CHARGER_STATE_ALERTS_SUBADDR //!< @ref LTC4015_EN_BAT_SHORT_FAULT_ALERT_BF "EN_BAT_SHORT_FAULT_ALERT_BF"
#define LTC4015_EN_BAT_SHORT_FAULT_ALERT_BF_SIZE 1
#define LTC4015_EN_BAT_SHORT_FAULT_ALERT_BF_OFFSET 0
#define LTC4015_EN_BAT_SHORT_FAULT_ALERT_BF_MASK 0x0001
#define LTC4015_EN_BAT_SHORT_FAULT_ALERT_BF (LTC4015_EN_BAT_SHORT_FAULT_ALERT_BF_OFFSET << 12 | (LTC4015_EN_BAT_SHORT_FAULT_ALERT_BF_SIZE - 1) << 8 | LTC4015_EN_BAT_SHORT_FAULT_ALERT_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_EN_CHARGE_STATUS_ALERTS EN_CHARGE_STATUS_ALERTS
 *  @ingroup LTC4015_register_map
 *  @brief EN_CHARGE_STATUS_ALERTS Register
 *
 * | 15:4 |                           3 |                            2 |                            1 |                            0 |
 * |:----:|:---------------------------:|:----------------------------:|:----------------------------:|:----------------------------:|
 * |  n/a | EN_VIN_UVCL_ACTIVE_ALERT_BF | EN_IIN_LIMIT_ACTIVE_ALERT_BF | EN_CONSTANT_CURRENT_ALERT_BF | EN_CONSTANT_VOLTAGE_ALERT_BF |
 *
 * Enable charge status notification via SMBALERT
 *   - CommandCode: 15
 *   - Contains Bit Fields:
 *     + @ref LTC4015_EN_VIN_UVCL_ACTIVE_ALERT_BF "EN_VIN_UVCL_ACTIVE_ALERT_BF" : Enable alert for input undervoltage current limit active
 *     + @ref LTC4015_EN_IIN_LIMIT_ACTIVE_ALERT_BF "EN_IIN_LIMIT_ACTIVE_ALERT_BF" : Enable alert for input current limit active
 *     + @ref LTC4015_EN_CONSTANT_CURRENT_ALERT_BF "EN_CONSTANT_CURRENT_ALERT_BF" : Enable alert for constant current status
 *     + @ref LTC4015_EN_CONSTANT_VOLTAGE_ALERT_BF "EN_CONSTANT_VOLTAGE_ALERT_BF" : Enable alert for constant voltage status
*/

//!@{
#define LTC4015_EN_CHARGE_STATUS_ALERTS_SUBADDR 15
#define LTC4015_EN_CHARGE_STATUS_ALERTS (0 << 12 | (16 - 1) << 8 | LTC4015_EN_CHARGE_STATUS_ALERTS_SUBADDR)
//!@}
/*! @defgroup LTC4015_EN_VIN_UVCL_ACTIVE_ALERT_BF EN_VIN_UVCL_ACTIVE_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief EN_VIN_UVCL_ACTIVE_ALERT_BF Bit Field
 *
 *  Enable alert for input undervoltage current limit active
 *   - Register: @ref LTC4015_EN_CHARGE_STATUS_ALERTS "EN_CHARGE_STATUS_ALERTS"
 *   - CommandCode: 15
 *   - Size: 1
 *   - Offset: 3
 *   - MSB: 3
 *   - MASK: 0x0008
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_EN_VIN_UVCL_ACTIVE_ALERT_BF_SUBADDR LTC4015_EN_CHARGE_STATUS_ALERTS_SUBADDR //!< @ref LTC4015_EN_VIN_UVCL_ACTIVE_ALERT_BF "EN_VIN_UVCL_ACTIVE_ALERT_BF"
#define LTC4015_EN_VIN_UVCL_ACTIVE_ALERT_BF_SIZE 1
#define LTC4015_EN_VIN_UVCL_ACTIVE_ALERT_BF_OFFSET 3
#define LTC4015_EN_VIN_UVCL_ACTIVE_ALERT_BF_MASK 0x0008
#define LTC4015_EN_VIN_UVCL_ACTIVE_ALERT_BF (LTC4015_EN_VIN_UVCL_ACTIVE_ALERT_BF_OFFSET << 12 | (LTC4015_EN_VIN_UVCL_ACTIVE_ALERT_BF_SIZE - 1) << 8 | LTC4015_EN_VIN_UVCL_ACTIVE_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_EN_IIN_LIMIT_ACTIVE_ALERT_BF EN_IIN_LIMIT_ACTIVE_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief EN_IIN_LIMIT_ACTIVE_ALERT_BF Bit Field
 *
 *  Enable alert for input current limit active
 *   - Register: @ref LTC4015_EN_CHARGE_STATUS_ALERTS "EN_CHARGE_STATUS_ALERTS"
 *   - CommandCode: 15
 *   - Size: 1
 *   - Offset: 2
 *   - MSB: 2
 *   - MASK: 0x0004
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_EN_IIN_LIMIT_ACTIVE_ALERT_BF_SUBADDR LTC4015_EN_CHARGE_STATUS_ALERTS_SUBADDR //!< @ref LTC4015_EN_IIN_LIMIT_ACTIVE_ALERT_BF "EN_IIN_LIMIT_ACTIVE_ALERT_BF"
#define LTC4015_EN_IIN_LIMIT_ACTIVE_ALERT_BF_SIZE 1
#define LTC4015_EN_IIN_LIMIT_ACTIVE_ALERT_BF_OFFSET 2
#define LTC4015_EN_IIN_LIMIT_ACTIVE_ALERT_BF_MASK 0x0004
#define LTC4015_EN_IIN_LIMIT_ACTIVE_ALERT_BF (LTC4015_EN_IIN_LIMIT_ACTIVE_ALERT_BF_OFFSET << 12 | (LTC4015_EN_IIN_LIMIT_ACTIVE_ALERT_BF_SIZE - 1) << 8 | LTC4015_EN_IIN_LIMIT_ACTIVE_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_EN_CONSTANT_CURRENT_ALERT_BF EN_CONSTANT_CURRENT_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief EN_CONSTANT_CURRENT_ALERT_BF Bit Field
 *
 *  Enable alert for constant current status
 *   - Register: @ref LTC4015_EN_CHARGE_STATUS_ALERTS "EN_CHARGE_STATUS_ALERTS"
 *   - CommandCode: 15
 *   - Size: 1
 *   - Offset: 1
 *   - MSB: 1
 *   - MASK: 0x0002
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_EN_CONSTANT_CURRENT_ALERT_BF_SUBADDR LTC4015_EN_CHARGE_STATUS_ALERTS_SUBADDR //!< @ref LTC4015_EN_CONSTANT_CURRENT_ALERT_BF "EN_CONSTANT_CURRENT_ALERT_BF"
#define LTC4015_EN_CONSTANT_CURRENT_ALERT_BF_SIZE 1
#define LTC4015_EN_CONSTANT_CURRENT_ALERT_BF_OFFSET 1
#define LTC4015_EN_CONSTANT_CURRENT_ALERT_BF_MASK 0x0002
#define LTC4015_EN_CONSTANT_CURRENT_ALERT_BF (LTC4015_EN_CONSTANT_CURRENT_ALERT_BF_OFFSET << 12 | (LTC4015_EN_CONSTANT_CURRENT_ALERT_BF_SIZE - 1) << 8 | LTC4015_EN_CONSTANT_CURRENT_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_EN_CONSTANT_VOLTAGE_ALERT_BF EN_CONSTANT_VOLTAGE_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief EN_CONSTANT_VOLTAGE_ALERT_BF Bit Field
 *
 *  Enable alert for constant voltage status
 *   - Register: @ref LTC4015_EN_CHARGE_STATUS_ALERTS "EN_CHARGE_STATUS_ALERTS"
 *   - CommandCode: 15
 *   - Size: 1
 *   - Offset: 0
 *   - MSB: 0
 *   - MASK: 0x0001
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_EN_CONSTANT_VOLTAGE_ALERT_BF_SUBADDR LTC4015_EN_CHARGE_STATUS_ALERTS_SUBADDR //!< @ref LTC4015_EN_CONSTANT_VOLTAGE_ALERT_BF "EN_CONSTANT_VOLTAGE_ALERT_BF"
#define LTC4015_EN_CONSTANT_VOLTAGE_ALERT_BF_SIZE 1
#define LTC4015_EN_CONSTANT_VOLTAGE_ALERT_BF_OFFSET 0
#define LTC4015_EN_CONSTANT_VOLTAGE_ALERT_BF_MASK 0x0001
#define LTC4015_EN_CONSTANT_VOLTAGE_ALERT_BF (LTC4015_EN_CONSTANT_VOLTAGE_ALERT_BF_OFFSET << 12 | (LTC4015_EN_CONSTANT_VOLTAGE_ALERT_BF_SIZE - 1) << 8 | LTC4015_EN_CONSTANT_VOLTAGE_ALERT_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_QCOUNT_LO_ALERT_LIMIT QCOUNT_LO_ALERT_LIMIT
 *  @ingroup LTC4015_register_map
 *  @brief QCOUNT_LO_ALERT_LIMIT Register
 *
 * |                     15:0 |
 * |:------------------------:|
 * | QCOUNT_LO_ALERT_LIMIT_BF |
 *
 *   - CommandCode: 16
 *   - Contains Bit Fields:
 *     + @ref LTC4015_QCOUNT_LO_ALERT_LIMIT_BF "QCOUNT_LO_ALERT_LIMIT_BF" : Coulomb counter low alert limit as reported in QCOUNT
*/

//!@{
#define LTC4015_QCOUNT_LO_ALERT_LIMIT_SUBADDR 16
#define LTC4015_QCOUNT_LO_ALERT_LIMIT (0 << 12 | (16 - 1) << 8 | LTC4015_QCOUNT_LO_ALERT_LIMIT_SUBADDR)
//!@}
/*! @defgroup LTC4015_QCOUNT_LO_ALERT_LIMIT_BF QCOUNT_LO_ALERT_LIMIT_BF
 *  @ingroup LTC4015_register_map
 *  @brief QCOUNT_LO_ALERT_LIMIT_BF Bit Field
 *
 *  Coulomb counter low alert limit as reported in QCOUNT
 *   - Register: @ref LTC4015_QCOUNT_LO_ALERT_LIMIT "QCOUNT_LO_ALERT_LIMIT"
 *   - CommandCode: 16
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_QCOUNT_LO_ALERT_LIMIT_BF_SUBADDR LTC4015_QCOUNT_LO_ALERT_LIMIT_SUBADDR //!< @ref LTC4015_QCOUNT_LO_ALERT_LIMIT_BF "QCOUNT_LO_ALERT_LIMIT_BF"
#define LTC4015_QCOUNT_LO_ALERT_LIMIT_BF_SIZE 16
#define LTC4015_QCOUNT_LO_ALERT_LIMIT_BF_OFFSET 0
#define LTC4015_QCOUNT_LO_ALERT_LIMIT_BF_MASK 0xFFFF
#define LTC4015_QCOUNT_LO_ALERT_LIMIT_BF (LTC4015_QCOUNT_LO_ALERT_LIMIT_BF_OFFSET << 12 | (LTC4015_QCOUNT_LO_ALERT_LIMIT_BF_SIZE - 1) << 8 | LTC4015_QCOUNT_LO_ALERT_LIMIT_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_QCOUNT_HI_ALERT_LIMIT QCOUNT_HI_ALERT_LIMIT
 *  @ingroup LTC4015_register_map
 *  @brief QCOUNT_HI_ALERT_LIMIT Register
 *
 * |                     15:0 |
 * |:------------------------:|
 * | QCOUNT_HI_ALERT_LIMIT_BF |
 *
 *   - CommandCode: 17
 *   - Contains Bit Fields:
 *     + @ref LTC4015_QCOUNT_HI_ALERT_LIMIT_BF "QCOUNT_HI_ALERT_LIMIT_BF" : Coulomb counter high alert limit as reported in QCOUNT
*/

//!@{
#define LTC4015_QCOUNT_HI_ALERT_LIMIT_SUBADDR 17
#define LTC4015_QCOUNT_HI_ALERT_LIMIT (0 << 12 | (16 - 1) << 8 | LTC4015_QCOUNT_HI_ALERT_LIMIT_SUBADDR)
//!@}
/*! @defgroup LTC4015_QCOUNT_HI_ALERT_LIMIT_BF QCOUNT_HI_ALERT_LIMIT_BF
 *  @ingroup LTC4015_register_map
 *  @brief QCOUNT_HI_ALERT_LIMIT_BF Bit Field
 *
 *  Coulomb counter high alert limit as reported in QCOUNT
 *   - Register: @ref LTC4015_QCOUNT_HI_ALERT_LIMIT "QCOUNT_HI_ALERT_LIMIT"
 *   - CommandCode: 17
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_QCOUNT_HI_ALERT_LIMIT_BF_SUBADDR LTC4015_QCOUNT_HI_ALERT_LIMIT_SUBADDR //!< @ref LTC4015_QCOUNT_HI_ALERT_LIMIT_BF "QCOUNT_HI_ALERT_LIMIT_BF"
#define LTC4015_QCOUNT_HI_ALERT_LIMIT_BF_SIZE 16
#define LTC4015_QCOUNT_HI_ALERT_LIMIT_BF_OFFSET 0
#define LTC4015_QCOUNT_HI_ALERT_LIMIT_BF_MASK 0xFFFF
#define LTC4015_QCOUNT_HI_ALERT_LIMIT_BF (LTC4015_QCOUNT_HI_ALERT_LIMIT_BF_OFFSET << 12 | (LTC4015_QCOUNT_HI_ALERT_LIMIT_BF_SIZE - 1) << 8 | LTC4015_QCOUNT_HI_ALERT_LIMIT_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_QCOUNT_PRESCALE_FACTOR QCOUNT_PRESCALE_FACTOR
 *  @ingroup LTC4015_register_map
 *  @brief QCOUNT_PRESCALE_FACTOR Register
 *
 * |                      15:0 |
 * |:-------------------------:|
 * | QCOUNT_PRESCALE_FACTOR_BF |
 *
 *   - CommandCode: 18
 *   - Contains Bit Fields:
 *     + @ref LTC4015_QCOUNT_PRESCALE_FACTOR_BF "QCOUNT_PRESCALE_FACTOR_BF" : Coulomb counter prescale factor
*/

//!@{
#define LTC4015_QCOUNT_PRESCALE_FACTOR_SUBADDR 18
#define LTC4015_QCOUNT_PRESCALE_FACTOR (0 << 12 | (16 - 1) << 8 | LTC4015_QCOUNT_PRESCALE_FACTOR_SUBADDR)
//!@}
/*! @defgroup LTC4015_QCOUNT_PRESCALE_FACTOR_BF QCOUNT_PRESCALE_FACTOR_BF
 *  @ingroup LTC4015_register_map
 *  @brief QCOUNT_PRESCALE_FACTOR_BF Bit Field
 *
 *  Coulomb counter prescale factor
 *   - Register: @ref LTC4015_QCOUNT_PRESCALE_FACTOR "QCOUNT_PRESCALE_FACTOR"
 *   - CommandCode: 18
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R/W
 *   - Default: 512
 */
//!@{
#define LTC4015_QCOUNT_PRESCALE_FACTOR_BF_SUBADDR LTC4015_QCOUNT_PRESCALE_FACTOR_SUBADDR //!< @ref LTC4015_QCOUNT_PRESCALE_FACTOR_BF "QCOUNT_PRESCALE_FACTOR_BF"
#define LTC4015_QCOUNT_PRESCALE_FACTOR_BF_SIZE 16
#define LTC4015_QCOUNT_PRESCALE_FACTOR_BF_OFFSET 0
#define LTC4015_QCOUNT_PRESCALE_FACTOR_BF_MASK 0xFFFF
#define LTC4015_QCOUNT_PRESCALE_FACTOR_BF (LTC4015_QCOUNT_PRESCALE_FACTOR_BF_OFFSET << 12 | (LTC4015_QCOUNT_PRESCALE_FACTOR_BF_SIZE - 1) << 8 | LTC4015_QCOUNT_PRESCALE_FACTOR_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_QCOUNT QCOUNT
 *  @ingroup LTC4015_register_map
 *  @brief QCOUNT Register
 *
 * |      15:0 |
 * |:---------:|
 * | QCOUNT_BF |
 *
 *   - CommandCode: 19
 *   - Contains Bit Fields:
 *     + @ref LTC4015_QCOUNT_BF "QCOUNT_BF" : Coulomb counter value
*/

//!@{
#define LTC4015_QCOUNT_SUBADDR 19
#define LTC4015_QCOUNT (0 << 12 | (16 - 1) << 8 | LTC4015_QCOUNT_SUBADDR)
//!@}
/*! @defgroup LTC4015_QCOUNT_BF QCOUNT_BF
 *  @ingroup LTC4015_register_map
 *  @brief QCOUNT_BF Bit Field
 *
 *  Coulomb counter value
 *   - Register: @ref LTC4015_QCOUNT "QCOUNT"
 *   - CommandCode: 19
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R/W
 *   - Default: 32768
 */
//!@{
#define LTC4015_QCOUNT_BF_SUBADDR LTC4015_QCOUNT_SUBADDR //!< @ref LTC4015_QCOUNT_BF "QCOUNT_BF"
#define LTC4015_QCOUNT_BF_SIZE 16
#define LTC4015_QCOUNT_BF_OFFSET 0
#define LTC4015_QCOUNT_BF_MASK 0xFFFF
#define LTC4015_QCOUNT_BF (LTC4015_QCOUNT_BF_OFFSET << 12 | (LTC4015_QCOUNT_BF_SIZE - 1) << 8 | LTC4015_QCOUNT_BF_SUBADDR)
//!@}

