YY-Edwards/STM32_USB-FS-Device_v4.1/mylib/DC2039A/LTC4015/LTC4015_reg_defs.h
/*! @defgroup LTC4015_CONFIG_BITS CONFIG_BITS
 *  @ingroup LTC4015_register_map
 *  @brief CONFIG_BITS Register
 *
 * | 15:9 |                  8 | 7:6 |          5 |                    4 |              3 |            2 |
 * |:----:|:------------------:|:---:|:----------:|:--------------------:|:--------------:|:------------:|
 * |  n/a | SUSPEND_CHARGER_BF | n/a | RUN_BSR_BF | FORCE_MEAS_SYS_ON_BF | MPPT_EN_I2C_BF | EN_QCOUNT_BF |
 *
 * Configuration Settings
 *   - CommandCode: 20
 *   - Contains Bit Fields:
 *     + @ref LTC4015_SUSPEND_CHARGER_BF "SUSPEND_CHARGER_BF" : Suspend battery charger operation
 *     + @ref LTC4015_RUN_BSR_BF "RUN_BSR_BF" : Perform a battery series resistance measurement
 *     + @ref LTC4015_FORCE_MEAS_SYS_ON_BF "FORCE_MEAS_SYS_ON_BF" : Force measurement system to operate
 *     + @ref LTC4015_MPPT_EN_I2C_BF "MPPT_EN_I2C_BF" : Enable Maximum Power Point Tracking
 *     + @ref LTC4015_EN_QCOUNT_BF "EN_QCOUNT_BF" : Enable coulomb counter
*/

//!@{
#define LTC4015_CONFIG_BITS_SUBADDR 20
#define LTC4015_CONFIG_BITS (0 << 12 | (16 - 1) << 8 | LTC4015_CONFIG_BITS_SUBADDR)
//!@}
/*! @defgroup LTC4015_SUSPEND_CHARGER_BF SUSPEND_CHARGER_BF
 *  @ingroup LTC4015_register_map
 *  @brief SUSPEND_CHARGER_BF Bit Field
 *
 *  Suspend battery charger operation
 *   - Register: @ref LTC4015_CONFIG_BITS "CONFIG_BITS"
 *   - CommandCode: 20
 *   - Size: 1
 *   - Offset: 8
 *   - MSB: 8
 *   - MASK: 0x0100
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_SUSPEND_CHARGER_BF_SUBADDR LTC4015_CONFIG_BITS_SUBADDR //!< @ref LTC4015_SUSPEND_CHARGER_BF "SUSPEND_CHARGER_BF"
#define LTC4015_SUSPEND_CHARGER_BF_SIZE 1
#define LTC4015_SUSPEND_CHARGER_BF_OFFSET 8
#define LTC4015_SUSPEND_CHARGER_BF_MASK 0x0100
#define LTC4015_SUSPEND_CHARGER_BF (LTC4015_SUSPEND_CHARGER_BF_OFFSET << 12 | (LTC4015_SUSPEND_CHARGER_BF_SIZE - 1) << 8 | LTC4015_SUSPEND_CHARGER_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_RUN_BSR_BF RUN_BSR_BF
 *  @ingroup LTC4015_register_map
 *  @brief RUN_BSR_BF Bit Field
 *
 *  Perform a battery series resistance measurement
 *   - Register: @ref LTC4015_CONFIG_BITS "CONFIG_BITS"
 *   - CommandCode: 20
 *   - Size: 1
 *   - Offset: 5
 *   - MSB: 5
 *   - MASK: 0x0020
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_RUN_BSR_BF_SUBADDR LTC4015_CONFIG_BITS_SUBADDR //!< @ref LTC4015_RUN_BSR_BF "RUN_BSR_BF"
#define LTC4015_RUN_BSR_BF_SIZE 1
#define LTC4015_RUN_BSR_BF_OFFSET 5
#define LTC4015_RUN_BSR_BF_MASK 0x0020
#define LTC4015_RUN_BSR_BF (LTC4015_RUN_BSR_BF_OFFSET << 12 | (LTC4015_RUN_BSR_BF_SIZE - 1) << 8 | LTC4015_RUN_BSR_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_FORCE_MEAS_SYS_ON_BF FORCE_MEAS_SYS_ON_BF
 *  @ingroup LTC4015_register_map
 *  @brief FORCE_MEAS_SYS_ON_BF Bit Field
 *
 *  Force measurement system to operate
 *   - Register: @ref LTC4015_CONFIG_BITS "CONFIG_BITS"
 *   - CommandCode: 20
 *   - Size: 1
 *   - Offset: 4
 *   - MSB: 4
 *   - MASK: 0x0010
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_FORCE_MEAS_SYS_ON_BF_SUBADDR LTC4015_CONFIG_BITS_SUBADDR //!< @ref LTC4015_FORCE_MEAS_SYS_ON_BF "FORCE_MEAS_SYS_ON_BF"
#define LTC4015_FORCE_MEAS_SYS_ON_BF_SIZE 1
#define LTC4015_FORCE_MEAS_SYS_ON_BF_OFFSET 4
#define LTC4015_FORCE_MEAS_SYS_ON_BF_MASK 0x0010
#define LTC4015_FORCE_MEAS_SYS_ON_BF (LTC4015_FORCE_MEAS_SYS_ON_BF_OFFSET << 12 | (LTC4015_FORCE_MEAS_SYS_ON_BF_SIZE - 1) << 8 | LTC4015_FORCE_MEAS_SYS_ON_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_MPPT_EN_I2C_BF MPPT_EN_I2C_BF
 *  @ingroup LTC4015_register_map
 *  @brief MPPT_EN_I2C_BF Bit Field
 *
 *  Enable Maximum Power Point Tracking
 *   - Register: @ref LTC4015_CONFIG_BITS "CONFIG_BITS"
 *   - CommandCode: 20
 *   - Size: 1
 *   - Offset: 3
 *   - MSB: 3
 *   - MASK: 0x0008
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_MPPT_EN_I2C_BF_SUBADDR LTC4015_CONFIG_BITS_SUBADDR //!< @ref LTC4015_MPPT_EN_I2C_BF "MPPT_EN_I2C_BF"
#define LTC4015_MPPT_EN_I2C_BF_SIZE 1
#define LTC4015_MPPT_EN_I2C_BF_OFFSET 3
#define LTC4015_MPPT_EN_I2C_BF_MASK 0x0008
#define LTC4015_MPPT_EN_I2C_BF (LTC4015_MPPT_EN_I2C_BF_OFFSET << 12 | (LTC4015_MPPT_EN_I2C_BF_SIZE - 1) << 8 | LTC4015_MPPT_EN_I2C_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_EN_QCOUNT_BF EN_QCOUNT_BF
 *  @ingroup LTC4015_register_map
 *  @brief EN_QCOUNT_BF Bit Field
 *
 *  Enable coulomb counter
 *   - Register: @ref LTC4015_CONFIG_BITS "CONFIG_BITS"
 *   - CommandCode: 20
 *   - Size: 1
 *   - Offset: 2
 *   - MSB: 2
 *   - MASK: 0x0004
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_EN_QCOUNT_BF_SUBADDR LTC4015_CONFIG_BITS_SUBADDR //!< @ref LTC4015_EN_QCOUNT_BF "EN_QCOUNT_BF"
#define LTC4015_EN_QCOUNT_BF_SIZE 1
#define LTC4015_EN_QCOUNT_BF_OFFSET 2
#define LTC4015_EN_QCOUNT_BF_MASK 0x0004
#define LTC4015_EN_QCOUNT_BF (LTC4015_EN_QCOUNT_BF_OFFSET << 12 | (LTC4015_EN_QCOUNT_BF_SIZE - 1) << 8 | LTC4015_EN_QCOUNT_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_IIN_LIMIT_SETTING IIN_LIMIT_SETTING
 *  @ingroup LTC4015_register_map
 *  @brief IIN_LIMIT_SETTING Register
 *
 * | 15:6 |                  5:0 |
 * |:----:|:--------------------:|
 * |  n/a | IIN_LIMIT_SETTING_BF |
 *
 *   - CommandCode: 21
 *   - Contains Bit Fields:
 *     + @ref LTC4015_IIN_LIMIT_SETTING_BF "IIN_LIMIT_SETTING_BF" : Input current limit setting = (IIN_LIMIT_SETTING + 1) * 500uV / R<sub>SNSI</sub>
*/

//!@{
#define LTC4015_IIN_LIMIT_SETTING_SUBADDR 21
#define LTC4015_IIN_LIMIT_SETTING (0 << 12 | (16 - 1) << 8 | LTC4015_IIN_LIMIT_SETTING_SUBADDR)
//!@}
/*! @defgroup LTC4015_IIN_LIMIT_SETTING_BF IIN_LIMIT_SETTING_BF
 *  @ingroup LTC4015_register_map
 *  @brief IIN_LIMIT_SETTING_BF Bit Field
 *
 *  Input current limit setting = (IIN_LIMIT_SETTING + 1) * 500uV / R<sub>SNSI</sub>
 *   - Register: @ref LTC4015_IIN_LIMIT_SETTING "IIN_LIMIT_SETTING"
 *   - CommandCode: 21
 *   - Size: 6
 *   - Offset: 0
 *   - MSB: 5
 *   - MASK: 0x003F
 *   - Access: R/W
 *   - Default: 63
 */
//!@{
#define LTC4015_IIN_LIMIT_SETTING_BF_SUBADDR LTC4015_IIN_LIMIT_SETTING_SUBADDR //!< @ref LTC4015_IIN_LIMIT_SETTING_BF "IIN_LIMIT_SETTING_BF"
#define LTC4015_IIN_LIMIT_SETTING_BF_SIZE 6
#define LTC4015_IIN_LIMIT_SETTING_BF_OFFSET 0
#define LTC4015_IIN_LIMIT_SETTING_BF_MASK 0x003F
#define LTC4015_IIN_LIMIT_SETTING_BF (LTC4015_IIN_LIMIT_SETTING_BF_OFFSET << 12 | (LTC4015_IIN_LIMIT_SETTING_BF_SIZE - 1) << 8 | LTC4015_IIN_LIMIT_SETTING_BF_SUBADDR)
//!@}

