YY-Edwards/STM32_USB-FS-Device_v4.1/mylib/DC2039A/LTC4015/LTC4015_reg_defs.h
/*! @defgroup LTC4015_VIN_UVCL_SETTING VIN_UVCL_SETTING
 *  @ingroup LTC4015_register_map
 *  @brief VIN_UVCL_SETTING Register
 *
 * | 15:8 |                 7:0 |
 * |:----:|:-------------------:|
 * |  n/a | VIN_UVCL_SETTING_BF |
 *
 *   - CommandCode: 22
 *   - Contains Bit Fields:
 *     + @ref LTC4015_VIN_UVCL_SETTING_BF "VIN_UVCL_SETTING_BF" : UVCLFB input undervoltage limit = (VIN_UVCL_SETTING + 1) * 4.6875mV
*/

//!@{
#define LTC4015_VIN_UVCL_SETTING_SUBADDR 22
#define LTC4015_VIN_UVCL_SETTING (0 << 12 | (16 - 1) << 8 | LTC4015_VIN_UVCL_SETTING_SUBADDR)
//!@}
/*! @defgroup LTC4015_VIN_UVCL_SETTING_BF VIN_UVCL_SETTING_BF
 *  @ingroup LTC4015_register_map
 *  @brief VIN_UVCL_SETTING_BF Bit Field
 *
 *  UVCLFB input undervoltage limit = (VIN_UVCL_SETTING + 1) * 4.6875mV
 *   - Register: @ref LTC4015_VIN_UVCL_SETTING "VIN_UVCL_SETTING"
 *   - CommandCode: 22
 *   - Size: 8
 *   - Offset: 0
 *   - MSB: 7
 *   - MASK: 0x00FF
 *   - Access: R/W
 *   - Default: 255
 */
//!@{
#define LTC4015_VIN_UVCL_SETTING_BF_SUBADDR LTC4015_VIN_UVCL_SETTING_SUBADDR //!< @ref LTC4015_VIN_UVCL_SETTING_BF "VIN_UVCL_SETTING_BF"
#define LTC4015_VIN_UVCL_SETTING_BF_SIZE 8
#define LTC4015_VIN_UVCL_SETTING_BF_OFFSET 0
#define LTC4015_VIN_UVCL_SETTING_BF_MASK 0x00FF
#define LTC4015_VIN_UVCL_SETTING_BF (LTC4015_VIN_UVCL_SETTING_BF_OFFSET << 12 | (LTC4015_VIN_UVCL_SETTING_BF_SIZE - 1) << 8 | LTC4015_VIN_UVCL_SETTING_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_RESERVED_0X17 RESERVED_0X17
 *  @ingroup LTC4015_register_map
 *  @brief RESERVED_0X17 Register
 *
 * |             15:0 |
 * |:----------------:|
 * | RESERVED_0X17_BF |
 *
 *   - CommandCode: 23
 *   - Contains Bit Fields:
 *     + @ref LTC4015_RESERVED_0X17_BF "RESERVED_0X17_BF" : Scratchpad register
*/

//!@{
#define LTC4015_RESERVED_0X17_SUBADDR 23
#define LTC4015_RESERVED_0X17 (0 << 12 | (16 - 1) << 8 | LTC4015_RESERVED_0X17_SUBADDR)
//!@}
/*! @defgroup LTC4015_RESERVED_0X17_BF RESERVED_0X17_BF
 *  @ingroup LTC4015_register_map
 *  @brief RESERVED_0X17_BF Bit Field
 *
 *  Scratchpad register
 *   - Register: @ref LTC4015_RESERVED_0X17 "RESERVED_0X17"
 *   - CommandCode: 23
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_RESERVED_0X17_BF_SUBADDR LTC4015_RESERVED_0X17_SUBADDR //!< @ref LTC4015_RESERVED_0X17_BF "RESERVED_0X17_BF"
#define LTC4015_RESERVED_0X17_BF_SIZE 16
#define LTC4015_RESERVED_0X17_BF_OFFSET 0
#define LTC4015_RESERVED_0X17_BF_MASK 0xFFFF
#define LTC4015_RESERVED_0X17_BF (LTC4015_RESERVED_0X17_BF_OFFSET << 12 | (LTC4015_RESERVED_0X17_BF_SIZE - 1) << 8 | LTC4015_RESERVED_0X17_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_RESERVED_0X18 RESERVED_0X18
 *  @ingroup LTC4015_register_map
 *  @brief RESERVED_0X18 Register
 *
 * |             15:0 |
 * |:----------------:|
 * | RESERVED_0X18_BF |
 *
 *   - CommandCode: 24
 *   - Contains Bit Fields:
 *     + @ref LTC4015_RESERVED_0X18_BF "RESERVED_0X18_BF" : Password
*/

//!@{
#define LTC4015_RESERVED_0X18_SUBADDR 24
#define LTC4015_RESERVED_0X18 (0 << 12 | (16 - 1) << 8 | LTC4015_RESERVED_0X18_SUBADDR)
//!@}
/*! @defgroup LTC4015_RESERVED_0X18_BF RESERVED_0X18_BF
 *  @ingroup LTC4015_register_map
 *  @brief RESERVED_0X18_BF Bit Field
 *
 *  Password
 *   - Register: @ref LTC4015_RESERVED_0X18 "RESERVED_0X18"
 *   - CommandCode: 24
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R/W
 *   - Default: n/a
 */
//!@{
#define LTC4015_RESERVED_0X18_BF_SUBADDR LTC4015_RESERVED_0X18_SUBADDR //!< @ref LTC4015_RESERVED_0X18_BF "RESERVED_0X18_BF"
#define LTC4015_RESERVED_0X18_BF_SIZE 16
#define LTC4015_RESERVED_0X18_BF_OFFSET 0
#define LTC4015_RESERVED_0X18_BF_MASK 0xFFFF
#define LTC4015_RESERVED_0X18_BF (LTC4015_RESERVED_0X18_BF_OFFSET << 12 | (LTC4015_RESERVED_0X18_BF_SIZE - 1) << 8 | LTC4015_RESERVED_0X18_BF_SUBADDR)
#define LTC4015_RESERVED_0X18_BF_PRESET_UNLOCKKEY 19540
#define LTC4015_RESERVED_0X18_BF_PRESET_OFF 0
//!@}

/*! @defgroup LTC4015_ARM_SHIP_MODE ARM_SHIP_MODE
 *  @ingroup LTC4015_register_map
 *  @brief ARM_SHIP_MODE Register
 *
 * |             15:0 |
 * |:----------------:|
 * | ARM_SHIP_MODE_BF |
 *
 *   - CommandCode: 25
 *   - Contains Bit Fields:
 *     + @ref LTC4015_ARM_SHIP_MODE_BF "ARM_SHIP_MODE_BF" : Arm low-current ship mode to activate upon VIN power removal
*/

//!@{
#define LTC4015_ARM_SHIP_MODE_SUBADDR 25
#define LTC4015_ARM_SHIP_MODE (0 << 12 | (16 - 1) << 8 | LTC4015_ARM_SHIP_MODE_SUBADDR)
//!@}
/*! @defgroup LTC4015_ARM_SHIP_MODE_BF ARM_SHIP_MODE_BF
 *  @ingroup LTC4015_register_map
 *  @brief ARM_SHIP_MODE_BF Bit Field
 *
 *  Arm low-current ship mode to activate upon VIN power removal
 *   - Register: @ref LTC4015_ARM_SHIP_MODE "ARM_SHIP_MODE"
 *   - CommandCode: 25
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_ARM_SHIP_MODE_BF_SUBADDR LTC4015_ARM_SHIP_MODE_SUBADDR //!< @ref LTC4015_ARM_SHIP_MODE_BF "ARM_SHIP_MODE_BF"
#define LTC4015_ARM_SHIP_MODE_BF_SIZE 16
#define LTC4015_ARM_SHIP_MODE_BF_OFFSET 0
#define LTC4015_ARM_SHIP_MODE_BF_MASK 0xFFFF
#define LTC4015_ARM_SHIP_MODE_BF (LTC4015_ARM_SHIP_MODE_BF_OFFSET << 12 | (LTC4015_ARM_SHIP_MODE_BF_SIZE - 1) << 8 | LTC4015_ARM_SHIP_MODE_BF_SUBADDR)
#define LTC4015_ARM_SHIP_MODE_BF_PRESET_ARM 21325
//!@}

/*! @defgroup LTC4015_ICHARGE_TARGET ICHARGE_TARGET
 *  @ingroup LTC4015_register_map
 *  @brief ICHARGE_TARGET Register
 *
 * | 15:5 |               4:0 |
 * |:----:|:-----------------:|
 * |  n/a | ICHARGE_TARGET_BF |
 *
 *   - CommandCode: 26
 *   - Contains Bit Fields:
 *     + @ref LTC4015_ICHARGE_TARGET_BF "ICHARGE_TARGET_BF" : Maximum charge current target = (ICHARGE_TARGET + 1) * 1mV / R<sub>SNSB</sub>
*/

//!@{
#define LTC4015_ICHARGE_TARGET_SUBADDR 26
#define LTC4015_ICHARGE_TARGET (0 << 12 | (16 - 1) << 8 | LTC4015_ICHARGE_TARGET_SUBADDR)
//!@}
/*! @defgroup LTC4015_ICHARGE_TARGET_BF ICHARGE_TARGET_BF
 *  @ingroup LTC4015_register_map
 *  @brief ICHARGE_TARGET_BF Bit Field
 *
 *  Maximum charge current target = (ICHARGE_TARGET + 1) * 1mV / R<sub>SNSB</sub>
 *   - Register: @ref LTC4015_ICHARGE_TARGET "ICHARGE_TARGET"
 *   - CommandCode: 26
 *   - Size: 5
 *   - Offset: 0
 *   - MSB: 4
 *   - MASK: 0x001F
 *   - Access: R/W
 *   - Default: 31
 */
//!@{
#define LTC4015_ICHARGE_TARGET_BF_SUBADDR LTC4015_ICHARGE_TARGET_SUBADDR //!< @ref LTC4015_ICHARGE_TARGET_BF "ICHARGE_TARGET_BF"
#define LTC4015_ICHARGE_TARGET_BF_SIZE 5
#define LTC4015_ICHARGE_TARGET_BF_OFFSET 0
#define LTC4015_ICHARGE_TARGET_BF_MASK 0x001F
#define LTC4015_ICHARGE_TARGET_BF (LTC4015_ICHARGE_TARGET_BF_OFFSET << 12 | (LTC4015_ICHARGE_TARGET_BF_SIZE - 1) << 8 | LTC4015_ICHARGE_TARGET_BF_SUBADDR)
#define LTC4015_ICHARGE_TARGET_BF_PRESET_MAX 31
#define LTC4015_ICHARGE_TARGET_BF_PRESET_MID 15
#define LTC4015_ICHARGE_TARGET_BF_PRESET_MIN 0
//!@}

/*! @defgroup LTC4015_VCHARGE_SETTING VCHARGE_SETTING
 *  @ingroup LTC4015_register_map
 *  @brief VCHARGE_SETTING Register
 *
 * | 15:6 |                5:0 |
 * |:----:|:------------------:|
 * |  n/a | VCHARGE_SETTING_BF |
 *
 *   - CommandCode: 27
 *   - Contains Bit Fields:
 *     + @ref LTC4015_VCHARGE_SETTING_BF "VCHARGE_SETTING_BF" : For Li-Ion batteries, only the lower five bits (4:0) are active, charge voltage level is given by (VCHARGE_SETTING/80.0 + 3.8125)V/cell.
				For LiFePO4 batteries, only the lower five bits (4:0) are active, charge voltage level is given by (VCHARGE_SETTING/80.0 + 3.4125)V/cell.
				For lead-acid batteries, charge voltage level is given by (VCHARGE_SETTING/105.0 + 2.0)V/cell. 
*/

//!@{
#define LTC4015_VCHARGE_SETTING_SUBADDR 27
#define LTC4015_VCHARGE_SETTING (0 << 12 | (16 - 1) << 8 | LTC4015_VCHARGE_SETTING_SUBADDR)
//!@}
/*! @defgroup LTC4015_VCHARGE_SETTING_BF VCHARGE_SETTING_BF
 *  @ingroup LTC4015_register_map
 *  @brief VCHARGE_SETTING_BF Bit Field
 *
 *  For Li-Ion batteries, only the lower five bits (4:0) are active, charge voltage level is given by (VCHARGE_SETTING/80.0 + 3.8125)V/cell.
				For LiFePO4 batteries, only the lower five bits (4:0) are active, charge voltage level is given by (VCHARGE_SETTING/80.0 + 3.4125)V/cell.
				For lead-acid batteries, charge voltage level is given by (VCHARGE_SETTING/105.0 + 2.0)V/cell. 
 *   - Register: @ref LTC4015_VCHARGE_SETTING "VCHARGE_SETTING"
 *   - CommandCode: 27
 *   - Size: 6
 *   - Offset: 0
 *   - MSB: 5
 *   - MASK: 0x003F
 *   - Access: R/W
 *   - Default: 63
 */
//!@{
#define LTC4015_VCHARGE_SETTING_BF_SUBADDR LTC4015_VCHARGE_SETTING_SUBADDR //!< @ref LTC4015_VCHARGE_SETTING_BF "VCHARGE_SETTING_BF"
#define LTC4015_VCHARGE_SETTING_BF_SIZE 6
#define LTC4015_VCHARGE_SETTING_BF_OFFSET 0
#define LTC4015_VCHARGE_SETTING_BF_MASK 0x003F
#define LTC4015_VCHARGE_SETTING_BF (LTC4015_VCHARGE_SETTING_BF_OFFSET << 12 | (LTC4015_VCHARGE_SETTING_BF_SIZE - 1) << 8 | LTC4015_VCHARGE_SETTING_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_C_OVER_X_THRESHOLD C_OVER_X_THRESHOLD
 *  @ingroup LTC4015_register_map
 *  @brief C_OVER_X_THRESHOLD Register
 *
 * |                  15:0 |
 * |:---------------------:|
 * | C_OVER_X_THRESHOLD_BF |
 *
 *   - CommandCode: 28
 *   - Contains Bit Fields:
 *     + @ref LTC4015_C_OVER_X_THRESHOLD_BF "C_OVER_X_THRESHOLD_BF" : Low IBAT threshold for C/x termination
*/

//!@{
#define LTC4015_C_OVER_X_THRESHOLD_SUBADDR 28
#define LTC4015_C_OVER_X_THRESHOLD (0 << 12 | (16 - 1) << 8 | LTC4015_C_OVER_X_THRESHOLD_SUBADDR)
//!@}
/*! @defgroup LTC4015_C_OVER_X_THRESHOLD_BF C_OVER_X_THRESHOLD_BF
 *  @ingroup LTC4015_register_map
 *  @brief C_OVER_X_THRESHOLD_BF Bit Field
 *
 *  Low IBAT threshold for C/x termination
 *   - Register: @ref LTC4015_C_OVER_X_THRESHOLD "C_OVER_X_THRESHOLD"
 *   - CommandCode: 28
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R/W
 *   - Default: 2184
 */
//!@{
#define LTC4015_C_OVER_X_THRESHOLD_BF_SUBADDR LTC4015_C_OVER_X_THRESHOLD_SUBADDR //!< @ref LTC4015_C_OVER_X_THRESHOLD_BF "C_OVER_X_THRESHOLD_BF"
#define LTC4015_C_OVER_X_THRESHOLD_BF_SIZE 16
#define LTC4015_C_OVER_X_THRESHOLD_BF_OFFSET 0
#define LTC4015_C_OVER_X_THRESHOLD_BF_MASK 0xFFFF
#define LTC4015_C_OVER_X_THRESHOLD_BF (LTC4015_C_OVER_X_THRESHOLD_BF_OFFSET << 12 | (LTC4015_C_OVER_X_THRESHOLD_BF_SIZE - 1) << 8 | LTC4015_C_OVER_X_THRESHOLD_BF_SUBADDR)
#define LTC4015_C_OVER_X_THRESHOLD_BF_PRESET_C_OVER_10 2184
//!@}

/*! @defgroup LTC4015_MAX_CV_TIME MAX_CV_TIME
 *  @ingroup LTC4015_register_map
 *  @brief MAX_CV_TIME Register
 *
 * |           15:0 |
 * |:--------------:|
 * | MAX_CV_TIME_BF |
 *
 *   - CommandCode: 29
 *   - Contains Bit Fields:
 *     + @ref LTC4015_MAX_CV_TIME_BF "MAX_CV_TIME_BF" : Time in seconds with Charger in CV state before timer termination occurs [(Li Only)]
*/

//!@{
#define LTC4015_MAX_CV_TIME_SUBADDR 29
#define LTC4015_MAX_CV_TIME (0 << 12 | (16 - 1) << 8 | LTC4015_MAX_CV_TIME_SUBADDR)
//!@}
/*! @defgroup LTC4015_MAX_CV_TIME_BF MAX_CV_TIME_BF
 *  @ingroup LTC4015_register_map
 *  @brief MAX_CV_TIME_BF Bit Field
 *
 *  Time in seconds with Charger in CV state before timer termination occurs [(Li Only)]
 *   - Register: @ref LTC4015_MAX_CV_TIME "MAX_CV_TIME"
 *   - CommandCode: 29
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R/W
 *   - Default: 65535
 */
//!@{
#define LTC4015_MAX_CV_TIME_BF_SUBADDR LTC4015_MAX_CV_TIME_SUBADDR //!< @ref LTC4015_MAX_CV_TIME_BF "MAX_CV_TIME_BF"
#define LTC4015_MAX_CV_TIME_BF_SIZE 16
#define LTC4015_MAX_CV_TIME_BF_OFFSET 0
#define LTC4015_MAX_CV_TIME_BF_MASK 0xFFFF
#define LTC4015_MAX_CV_TIME_BF (LTC4015_MAX_CV_TIME_BF_OFFSET << 12 | (LTC4015_MAX_CV_TIME_BF_SIZE - 1) << 8 | LTC4015_MAX_CV_TIME_BF_SUBADDR)
#define LTC4015_MAX_CV_TIME_BF_PRESET__30SEC 30
#define LTC4015_MAX_CV_TIME_BF_PRESET__1MIN 60
#define LTC4015_MAX_CV_TIME_BF_PRESET__30MINS 1800
#define LTC4015_MAX_CV_TIME_BF_PRESET__1HOUR 3600
#define LTC4015_MAX_CV_TIME_BF_PRESET__2HOURS 7200
#define LTC4015_MAX_CV_TIME_BF_PRESET__4HOURS 14400
#define LTC4015_MAX_CV_TIME_BF_PRESET__8HOURS 28800
#define LTC4015_MAX_CV_TIME_BF_PRESET_MAX 65535
//!@}

/*! @defgroup LTC4015_MAX_CHARGE_TIME MAX_CHARGE_TIME
 *  @ingroup LTC4015_register_map
 *  @brief MAX_CHARGE_TIME Register
 *
 * |               15:0 |
 * |:------------------:|
 * | MAX_CHARGE_TIME_BF |
 *
 *   - CommandCode: 30
 *   - Contains Bit Fields:
 *     + @ref LTC4015_MAX_CHARGE_TIME_BF "MAX_CHARGE_TIME_BF" : Time in seconds before a max_charge_time fault is declared.
*/

//!@{
#define LTC4015_MAX_CHARGE_TIME_SUBADDR 30
#define LTC4015_MAX_CHARGE_TIME (0 << 12 | (16 - 1) << 8 | LTC4015_MAX_CHARGE_TIME_SUBADDR)
//!@}
/*! @defgroup LTC4015_MAX_CHARGE_TIME_BF MAX_CHARGE_TIME_BF
 *  @ingroup LTC4015_register_map
 *  @brief MAX_CHARGE_TIME_BF Bit Field
 *
 *  Time in seconds before a max_charge_time fault is declared.
 *   - Register: @ref LTC4015_MAX_CHARGE_TIME "MAX_CHARGE_TIME"
 *   - CommandCode: 30
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R/W
 *   - Default: 65535
 */
//!@{
#define LTC4015_MAX_CHARGE_TIME_BF_SUBADDR LTC4015_MAX_CHARGE_TIME_SUBADDR //!< @ref LTC4015_MAX_CHARGE_TIME_BF "MAX_CHARGE_TIME_BF"
#define LTC4015_MAX_CHARGE_TIME_BF_SIZE 16
#define LTC4015_MAX_CHARGE_TIME_BF_OFFSET 0
#define LTC4015_MAX_CHARGE_TIME_BF_MASK 0xFFFF
#define LTC4015_MAX_CHARGE_TIME_BF (LTC4015_MAX_CHARGE_TIME_BF_OFFSET << 12 | (LTC4015_MAX_CHARGE_TIME_BF_SIZE - 1) << 8 | LTC4015_MAX_CHARGE_TIME_BF_SUBADDR)
#define LTC4015_MAX_CHARGE_TIME_BF_PRESET__30SEC 30
#define LTC4015_MAX_CHARGE_TIME_BF_PRESET__1MIN 60
#define LTC4015_MAX_CHARGE_TIME_BF_PRESET__30MINS 1800
#define LTC4015_MAX_CHARGE_TIME_BF_PRESET__1HOUR 3600
#define LTC4015_MAX_CHARGE_TIME_BF_PRESET__2HOURS 7200
#define LTC4015_MAX_CHARGE_TIME_BF_PRESET__4HOURS 14400
#define LTC4015_MAX_CHARGE_TIME_BF_PRESET__8HOURS 28800
#define LTC4015_MAX_CHARGE_TIME_BF_PRESET_MAX 65535
//!@}

/*! @defgroup LTC4015_JEITA_T1 JEITA_T1
 *  @ingroup LTC4015_register_map
 *  @brief JEITA_T1 Register
 *
 * |        15:0 |
 * |:-----------:|
 * | JEITA_T1_BF |
 *
 *   - CommandCode: 31
 *   - Contains Bit Fields:
 *     + @ref LTC4015_JEITA_T1_BF "JEITA_T1_BF" : Value of NTC_RATIO for transition between JEITA regions 2 and 1 (off)
*/

//!@{
#define LTC4015_JEITA_T1_SUBADDR 31
#define LTC4015_JEITA_T1 (0 << 12 | (16 - 1) << 8 | LTC4015_JEITA_T1_SUBADDR)
//!@}
/*! @defgroup LTC4015_JEITA_T1_BF JEITA_T1_BF
 *  @ingroup LTC4015_register_map
 *  @brief JEITA_T1_BF Bit Field
 *
 *  Value of NTC_RATIO for transition between JEITA regions 2 and 1 (off)
 *   - Register: @ref LTC4015_JEITA_T1 "JEITA_T1"
 *   - CommandCode: 31
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R/W
 *   - Default: 16128
 */
//!@{
#define LTC4015_JEITA_T1_BF_SUBADDR LTC4015_JEITA_T1_SUBADDR //!< @ref LTC4015_JEITA_T1_BF "JEITA_T1_BF"
#define LTC4015_JEITA_T1_BF_SIZE 16
#define LTC4015_JEITA_T1_BF_OFFSET 0
#define LTC4015_JEITA_T1_BF_MASK 0xFFFF
#define LTC4015_JEITA_T1_BF (LTC4015_JEITA_T1_BF_OFFSET << 12 | (LTC4015_JEITA_T1_BF_SIZE - 1) << 8 | LTC4015_JEITA_T1_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_JEITA_T2 JEITA_T2
 *  @ingroup LTC4015_register_map
 *  @brief JEITA_T2 Register
 *
 * |        15:0 |
 * |:-----------:|
 * | JEITA_T2_BF |
 *
 *   - CommandCode: 32
 *   - Contains Bit Fields:
 *     + @ref LTC4015_JEITA_T2_BF "JEITA_T2_BF" : Value of NTC_RATIO for transition between JEITA regions 3 and 2
*/

//!@{
#define LTC4015_JEITA_T2_SUBADDR 32
#define LTC4015_JEITA_T2 (0 << 12 | (16 - 1) << 8 | LTC4015_JEITA_T2_SUBADDR)
//!@}
/*! @defgroup LTC4015_JEITA_T2_BF JEITA_T2_BF
 *  @ingroup LTC4015_register_map
 *  @brief JEITA_T2_BF Bit Field
 *
 *  Value of NTC_RATIO for transition between JEITA regions 3 and 2
 *   - Register: @ref LTC4015_JEITA_T2 "JEITA_T2"
 *   - CommandCode: 32
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R/W
 *   - Default: 14122
 */
//!@{
#define LTC4015_JEITA_T2_BF_SUBADDR LTC4015_JEITA_T2_SUBADDR //!< @ref LTC4015_JEITA_T2_BF "JEITA_T2_BF"
#define LTC4015_JEITA_T2_BF_SIZE 16
#define LTC4015_JEITA_T2_BF_OFFSET 0
#define LTC4015_JEITA_T2_BF_MASK 0xFFFF
#define LTC4015_JEITA_T2_BF (LTC4015_JEITA_T2_BF_OFFSET << 12 | (LTC4015_JEITA_T2_BF_SIZE - 1) << 8 | LTC4015_JEITA_T2_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_JEITA_T3 JEITA_T3
 *  @ingroup LTC4015_register_map
 *  @brief JEITA_T3 Register
 *
 * |        15:0 |
 * |:-----------:|
 * | JEITA_T3_BF |
 *
 *   - CommandCode: 33
 *   - Contains Bit Fields:
 *     + @ref LTC4015_JEITA_T3_BF "JEITA_T3_BF" : Value of NTC_RATIO for transition between JEITA regions 4 and 3
*/

//!@{
#define LTC4015_JEITA_T3_SUBADDR 33
#define LTC4015_JEITA_T3 (0 << 12 | (16 - 1) << 8 | LTC4015_JEITA_T3_SUBADDR)
//!@}
/*! @defgroup LTC4015_JEITA_T3_BF JEITA_T3_BF
 *  @ingroup LTC4015_register_map
 *  @brief JEITA_T3_BF Bit Field
 *
 *  Value of NTC_RATIO for transition between JEITA regions 4 and 3
 *   - Register: @ref LTC4015_JEITA_T3 "JEITA_T3"
 *   - CommandCode: 33
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R/W
 *   - Default: 7975
 */
//!@{
#define LTC4015_JEITA_T3_BF_SUBADDR LTC4015_JEITA_T3_SUBADDR //!< @ref LTC4015_JEITA_T3_BF "JEITA_T3_BF"
#define LTC4015_JEITA_T3_BF_SIZE 16
#define LTC4015_JEITA_T3_BF_OFFSET 0
#define LTC4015_JEITA_T3_BF_MASK 0xFFFF
#define LTC4015_JEITA_T3_BF (LTC4015_JEITA_T3_BF_OFFSET << 12 | (LTC4015_JEITA_T3_BF_SIZE - 1) << 8 | LTC4015_JEITA_T3_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_JEITA_T4 JEITA_T4
 *  @ingroup LTC4015_register_map
 *  @brief JEITA_T4 Register
 *
 * |        15:0 |
 * |:-----------:|
 * | JEITA_T4_BF |
 *
 *   - CommandCode: 34
 *   - Contains Bit Fields:
 *     + @ref LTC4015_JEITA_T4_BF "JEITA_T4_BF" : Value of NTC_RATIO for transition between JEITA regions 5 and 4
*/

//!@{
#define LTC4015_JEITA_T4_SUBADDR 34
#define LTC4015_JEITA_T4 (0 << 12 | (16 - 1) << 8 | LTC4015_JEITA_T4_SUBADDR)
//!@}
/*! @defgroup LTC4015_JEITA_T4_BF JEITA_T4_BF
 *  @ingroup LTC4015_register_map
 *  @brief JEITA_T4_BF Bit Field
 *
 *  Value of NTC_RATIO for transition between JEITA regions 5 and 4
 *   - Register: @ref LTC4015_JEITA_T4 "JEITA_T4"
 *   - CommandCode: 34
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R/W
 *   - Default: 7116
 */
//!@{
#define LTC4015_JEITA_T4_BF_SUBADDR LTC4015_JEITA_T4_SUBADDR //!< @ref LTC4015_JEITA_T4_BF "JEITA_T4_BF"
#define LTC4015_JEITA_T4_BF_SIZE 16
#define LTC4015_JEITA_T4_BF_OFFSET 0
#define LTC4015_JEITA_T4_BF_MASK 0xFFFF
#define LTC4015_JEITA_T4_BF (LTC4015_JEITA_T4_BF_OFFSET << 12 | (LTC4015_JEITA_T4_BF_SIZE - 1) << 8 | LTC4015_JEITA_T4_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_JEITA_T5 JEITA_T5
 *  @ingroup LTC4015_register_map
 *  @brief JEITA_T5 Register
 *
 * |        15:0 |
 * |:-----------:|
 * | JEITA_T5_BF |
 *
 *   - CommandCode: 35
 *   - Contains Bit Fields:
 *     + @ref LTC4015_JEITA_T5_BF "JEITA_T5_BF" : Value of NTC_RATIO for transition between JEITA regions 6 and 5
*/

//!@{
#define LTC4015_JEITA_T5_SUBADDR 35
#define LTC4015_JEITA_T5 (0 << 12 | (16 - 1) << 8 | LTC4015_JEITA_T5_SUBADDR)
//!@}
/*! @defgroup LTC4015_JEITA_T5_BF JEITA_T5_BF
 *  @ingroup LTC4015_register_map
 *  @brief JEITA_T5_BF Bit Field
 *
 *  Value of NTC_RATIO for transition between JEITA regions 6 and 5
 *   - Register: @ref LTC4015_JEITA_T5 "JEITA_T5"
 *   - CommandCode: 35
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R/W
 *   - Default: 6329
 */
//!@{
#define LTC4015_JEITA_T5_BF_SUBADDR LTC4015_JEITA_T5_SUBADDR //!< @ref LTC4015_JEITA_T5_BF "JEITA_T5_BF"
#define LTC4015_JEITA_T5_BF_SIZE 16
#define LTC4015_JEITA_T5_BF_OFFSET 0
#define LTC4015_JEITA_T5_BF_MASK 0xFFFF
#define LTC4015_JEITA_T5_BF (LTC4015_JEITA_T5_BF_OFFSET << 12 | (LTC4015_JEITA_T5_BF_SIZE - 1) << 8 | LTC4015_JEITA_T5_BF_SUBADDR)
//!@}

