YY-Edwards/STM32_USB-FS-Device_v4.1/mylib/DC2039A/LTC4015/LTC4015_reg_defs.h
/*! @defgroup LTC4015_JEITA_T6 JEITA_T6
 *  @ingroup LTC4015_register_map
 *  @brief JEITA_T6 Register
 *
 * |        15:0 |
 * |:-----------:|
 * | JEITA_T6_BF |
 *
 *   - CommandCode: 36
 *   - Contains Bit Fields:
 *     + @ref LTC4015_JEITA_T6_BF "JEITA_T6_BF" : Value of NTC_RATIO for transition between JEITA regions 7 (off) and 6
*/

//!@{
#define LTC4015_JEITA_T6_SUBADDR 36
#define LTC4015_JEITA_T6 (0 << 12 | (16 - 1) << 8 | LTC4015_JEITA_T6_SUBADDR)
//!@}
/*! @defgroup LTC4015_JEITA_T6_BF JEITA_T6_BF
 *  @ingroup LTC4015_register_map
 *  @brief JEITA_T6_BF Bit Field
 *
 *  Value of NTC_RATIO for transition between JEITA regions 7 (off) and 6
 *   - Register: @ref LTC4015_JEITA_T6 "JEITA_T6"
 *   - CommandCode: 36
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R/W
 *   - Default: 4973
 */
//!@{
#define LTC4015_JEITA_T6_BF_SUBADDR LTC4015_JEITA_T6_SUBADDR //!< @ref LTC4015_JEITA_T6_BF "JEITA_T6_BF"
#define LTC4015_JEITA_T6_BF_SIZE 16
#define LTC4015_JEITA_T6_BF_OFFSET 0
#define LTC4015_JEITA_T6_BF_MASK 0xFFFF
#define LTC4015_JEITA_T6_BF (LTC4015_JEITA_T6_BF_OFFSET << 12 | (LTC4015_JEITA_T6_BF_SIZE - 1) << 8 | LTC4015_JEITA_T6_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_VCHARGE_JEITA_6_5 VCHARGE_JEITA_6_5
 *  @ingroup LTC4015_register_map
 *  @brief VCHARGE_JEITA_6_5 Register
 *
 * | 15:10 |                9:5 |                4:0 |
 * |:-----:|:------------------:|:------------------:|
 * |   n/a | VCHARGE_JEITA_6_BF | VCHARGE_JEITA_5_BF |
 *
 * VCHARGE values for JEITA temperature regions 6 and 5
 *   - CommandCode: 37
 *   - Contains Bit Fields:
 *     + @ref LTC4015_VCHARGE_JEITA_6_BF "VCHARGE_JEITA_6_BF" : vcharge_jeita_6
 *     + @ref LTC4015_VCHARGE_JEITA_5_BF "VCHARGE_JEITA_5_BF" : vcharge_jeita_5
*/

//!@{
#define LTC4015_VCHARGE_JEITA_6_5_SUBADDR 37
#define LTC4015_VCHARGE_JEITA_6_5 (0 << 12 | (16 - 1) << 8 | LTC4015_VCHARGE_JEITA_6_5_SUBADDR)
//!@}
/*! @defgroup LTC4015_VCHARGE_JEITA_6_BF VCHARGE_JEITA_6_BF
 *  @ingroup LTC4015_register_map
 *  @brief VCHARGE_JEITA_6_BF Bit Field
 *
 *  vcharge_jeita_6
 *   - Register: @ref LTC4015_VCHARGE_JEITA_6_5 "VCHARGE_JEITA_6_5"
 *   - CommandCode: 37
 *   - Size: 5
 *   - Offset: 5
 *   - MSB: 9
 *   - MASK: 0x03E0
 *   - Access: R/W
 *   - Default: n/a
 */
//!@{
#define LTC4015_VCHARGE_JEITA_6_BF_SUBADDR LTC4015_VCHARGE_JEITA_6_5_SUBADDR //!< @ref LTC4015_VCHARGE_JEITA_6_BF "VCHARGE_JEITA_6_BF"
#define LTC4015_VCHARGE_JEITA_6_BF_SIZE 5
#define LTC4015_VCHARGE_JEITA_6_BF_OFFSET 5
#define LTC4015_VCHARGE_JEITA_6_BF_MASK 0x03E0
#define LTC4015_VCHARGE_JEITA_6_BF (LTC4015_VCHARGE_JEITA_6_BF_OFFSET << 12 | (LTC4015_VCHARGE_JEITA_6_BF_SIZE - 1) << 8 | LTC4015_VCHARGE_JEITA_6_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_VCHARGE_JEITA_5_BF VCHARGE_JEITA_5_BF
 *  @ingroup LTC4015_register_map
 *  @brief VCHARGE_JEITA_5_BF Bit Field
 *
 *  vcharge_jeita_5
 *   - Register: @ref LTC4015_VCHARGE_JEITA_6_5 "VCHARGE_JEITA_6_5"
 *   - CommandCode: 37
 *   - Size: 5
 *   - Offset: 0
 *   - MSB: 4
 *   - MASK: 0x001F
 *   - Access: R/W
 *   - Default: n/a
 */
//!@{
#define LTC4015_VCHARGE_JEITA_5_BF_SUBADDR LTC4015_VCHARGE_JEITA_6_5_SUBADDR //!< @ref LTC4015_VCHARGE_JEITA_5_BF "VCHARGE_JEITA_5_BF"
#define LTC4015_VCHARGE_JEITA_5_BF_SIZE 5
#define LTC4015_VCHARGE_JEITA_5_BF_OFFSET 0
#define LTC4015_VCHARGE_JEITA_5_BF_MASK 0x001F
#define LTC4015_VCHARGE_JEITA_5_BF (LTC4015_VCHARGE_JEITA_5_BF_OFFSET << 12 | (LTC4015_VCHARGE_JEITA_5_BF_SIZE - 1) << 8 | LTC4015_VCHARGE_JEITA_5_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_VCHARGE_JEITA_4_3_2 VCHARGE_JEITA_4_3_2
 *  @ingroup LTC4015_register_map
 *  @brief VCHARGE_JEITA_4_3_2 Register
 *
 * |  15 |              14:10 |                9:5 |                4:0 |
 * |:---:|:------------------:|:------------------:|:------------------:|
 * | n/a | VCHARGE_JEITA_4_BF | VCHARGE_JEITA_3_BF | VCHARGE_JEITA_2_BF |
 *
 * VCHARGE values for JEITA temperature regions 4, 3, and 2
 *   - CommandCode: 38
 *   - Contains Bit Fields:
 *     + @ref LTC4015_VCHARGE_JEITA_4_BF "VCHARGE_JEITA_4_BF" : vcharge_jeita_4
 *     + @ref LTC4015_VCHARGE_JEITA_3_BF "VCHARGE_JEITA_3_BF" : vcharge_jeita_3
 *     + @ref LTC4015_VCHARGE_JEITA_2_BF "VCHARGE_JEITA_2_BF" : vcharge_jeita_2
*/

//!@{
#define LTC4015_VCHARGE_JEITA_4_3_2_SUBADDR 38
#define LTC4015_VCHARGE_JEITA_4_3_2 (0 << 12 | (16 - 1) << 8 | LTC4015_VCHARGE_JEITA_4_3_2_SUBADDR)
//!@}
/*! @defgroup LTC4015_VCHARGE_JEITA_4_BF VCHARGE_JEITA_4_BF
 *  @ingroup LTC4015_register_map
 *  @brief VCHARGE_JEITA_4_BF Bit Field
 *
 *  vcharge_jeita_4
 *   - Register: @ref LTC4015_VCHARGE_JEITA_4_3_2 "VCHARGE_JEITA_4_3_2"
 *   - CommandCode: 38
 *   - Size: 5
 *   - Offset: 10
 *   - MSB: 14
 *   - MASK: 0x7C00
 *   - Access: R/W
 *   - Default: n/a
 */
//!@{
#define LTC4015_VCHARGE_JEITA_4_BF_SUBADDR LTC4015_VCHARGE_JEITA_4_3_2_SUBADDR //!< @ref LTC4015_VCHARGE_JEITA_4_BF "VCHARGE_JEITA_4_BF"
#define LTC4015_VCHARGE_JEITA_4_BF_SIZE 5
#define LTC4015_VCHARGE_JEITA_4_BF_OFFSET 10
#define LTC4015_VCHARGE_JEITA_4_BF_MASK 0x7C00
#define LTC4015_VCHARGE_JEITA_4_BF (LTC4015_VCHARGE_JEITA_4_BF_OFFSET << 12 | (LTC4015_VCHARGE_JEITA_4_BF_SIZE - 1) << 8 | LTC4015_VCHARGE_JEITA_4_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_VCHARGE_JEITA_3_BF VCHARGE_JEITA_3_BF
 *  @ingroup LTC4015_register_map
 *  @brief VCHARGE_JEITA_3_BF Bit Field
 *
 *  vcharge_jeita_3
 *   - Register: @ref LTC4015_VCHARGE_JEITA_4_3_2 "VCHARGE_JEITA_4_3_2"
 *   - CommandCode: 38
 *   - Size: 5
 *   - Offset: 5
 *   - MSB: 9
 *   - MASK: 0x03E0
 *   - Access: R/W
 *   - Default: n/a
 */
//!@{
#define LTC4015_VCHARGE_JEITA_3_BF_SUBADDR LTC4015_VCHARGE_JEITA_4_3_2_SUBADDR //!< @ref LTC4015_VCHARGE_JEITA_3_BF "VCHARGE_JEITA_3_BF"
#define LTC4015_VCHARGE_JEITA_3_BF_SIZE 5
#define LTC4015_VCHARGE_JEITA_3_BF_OFFSET 5
#define LTC4015_VCHARGE_JEITA_3_BF_MASK 0x03E0
#define LTC4015_VCHARGE_JEITA_3_BF (LTC4015_VCHARGE_JEITA_3_BF_OFFSET << 12 | (LTC4015_VCHARGE_JEITA_3_BF_SIZE - 1) << 8 | LTC4015_VCHARGE_JEITA_3_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_VCHARGE_JEITA_2_BF VCHARGE_JEITA_2_BF
 *  @ingroup LTC4015_register_map
 *  @brief VCHARGE_JEITA_2_BF Bit Field
 *
 *  vcharge_jeita_2
 *   - Register: @ref LTC4015_VCHARGE_JEITA_4_3_2 "VCHARGE_JEITA_4_3_2"
 *   - CommandCode: 38
 *   - Size: 5
 *   - Offset: 0
 *   - MSB: 4
 *   - MASK: 0x001F
 *   - Access: R/W
 *   - Default: n/a
 */
//!@{
#define LTC4015_VCHARGE_JEITA_2_BF_SUBADDR LTC4015_VCHARGE_JEITA_4_3_2_SUBADDR //!< @ref LTC4015_VCHARGE_JEITA_2_BF "VCHARGE_JEITA_2_BF"
#define LTC4015_VCHARGE_JEITA_2_BF_SIZE 5
#define LTC4015_VCHARGE_JEITA_2_BF_OFFSET 0
#define LTC4015_VCHARGE_JEITA_2_BF_MASK 0x001F
#define LTC4015_VCHARGE_JEITA_2_BF (LTC4015_VCHARGE_JEITA_2_BF_OFFSET << 12 | (LTC4015_VCHARGE_JEITA_2_BF_SIZE - 1) << 8 | LTC4015_VCHARGE_JEITA_2_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_ICHARGE_JEITA_6_5 ICHARGE_JEITA_6_5
 *  @ingroup LTC4015_register_map
 *  @brief ICHARGE_JEITA_6_5 Register
 *
 * | 15:10 |                9:5 |                4:0 |
 * |:-----:|:------------------:|:------------------:|
 * |   n/a | ICHARGE_JEITA_6_BF | ICHARGE_JEITA_5_BF |
 *
 * ICHARGE_TARGET values for JEITA temperature regions 6 and 5
 *   - CommandCode: 39
 *   - Contains Bit Fields:
 *     + @ref LTC4015_ICHARGE_JEITA_6_BF "ICHARGE_JEITA_6_BF" : icharge_jeita_6
 *     + @ref LTC4015_ICHARGE_JEITA_5_BF "ICHARGE_JEITA_5_BF" : icharge_jeita_5
*/

//!@{
#define LTC4015_ICHARGE_JEITA_6_5_SUBADDR 39
#define LTC4015_ICHARGE_JEITA_6_5 (0 << 12 | (16 - 1) << 8 | LTC4015_ICHARGE_JEITA_6_5_SUBADDR)
//!@}
/*! @defgroup LTC4015_ICHARGE_JEITA_6_BF ICHARGE_JEITA_6_BF
 *  @ingroup LTC4015_register_map
 *  @brief ICHARGE_JEITA_6_BF Bit Field
 *
 *  icharge_jeita_6
 *   - Register: @ref LTC4015_ICHARGE_JEITA_6_5 "ICHARGE_JEITA_6_5"
 *   - CommandCode: 39
 *   - Size: 5
 *   - Offset: 5
 *   - MSB: 9
 *   - MASK: 0x03E0
 *   - Access: R/W
 *   - Default: 15
 */
//!@{
#define LTC4015_ICHARGE_JEITA_6_BF_SUBADDR LTC4015_ICHARGE_JEITA_6_5_SUBADDR //!< @ref LTC4015_ICHARGE_JEITA_6_BF "ICHARGE_JEITA_6_BF"
#define LTC4015_ICHARGE_JEITA_6_BF_SIZE 5
#define LTC4015_ICHARGE_JEITA_6_BF_OFFSET 5
#define LTC4015_ICHARGE_JEITA_6_BF_MASK 0x03E0
#define LTC4015_ICHARGE_JEITA_6_BF (LTC4015_ICHARGE_JEITA_6_BF_OFFSET << 12 | (LTC4015_ICHARGE_JEITA_6_BF_SIZE - 1) << 8 | LTC4015_ICHARGE_JEITA_6_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_ICHARGE_JEITA_5_BF ICHARGE_JEITA_5_BF
 *  @ingroup LTC4015_register_map
 *  @brief ICHARGE_JEITA_5_BF Bit Field
 *
 *  icharge_jeita_5
 *   - Register: @ref LTC4015_ICHARGE_JEITA_6_5 "ICHARGE_JEITA_6_5"
 *   - CommandCode: 39
 *   - Size: 5
 *   - Offset: 0
 *   - MSB: 4
 *   - MASK: 0x001F
 *   - Access: R/W
 *   - Default: 15
 */
//!@{
#define LTC4015_ICHARGE_JEITA_5_BF_SUBADDR LTC4015_ICHARGE_JEITA_6_5_SUBADDR //!< @ref LTC4015_ICHARGE_JEITA_5_BF "ICHARGE_JEITA_5_BF"
#define LTC4015_ICHARGE_JEITA_5_BF_SIZE 5
#define LTC4015_ICHARGE_JEITA_5_BF_OFFSET 0
#define LTC4015_ICHARGE_JEITA_5_BF_MASK 0x001F
#define LTC4015_ICHARGE_JEITA_5_BF (LTC4015_ICHARGE_JEITA_5_BF_OFFSET << 12 | (LTC4015_ICHARGE_JEITA_5_BF_SIZE - 1) << 8 | LTC4015_ICHARGE_JEITA_5_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_ICHARGE_JEITA_4_3_2 ICHARGE_JEITA_4_3_2
 *  @ingroup LTC4015_register_map
 *  @brief ICHARGE_JEITA_4_3_2 Register
 *
 * |  15 |              14:10 |                9:5 |                4:0 |
 * |:---:|:------------------:|:------------------:|:------------------:|
 * | n/a | ICHARGE_JEITA_4_BF | ICHARGE_JEITA_3_BF | ICHARGE_JEITA_2_BF |
 *
 * ICHARGE_TARGET value for JEITA temperature regions 4, 3, and 2
 *   - CommandCode: 40
 *   - Contains Bit Fields:
 *     + @ref LTC4015_ICHARGE_JEITA_4_BF "ICHARGE_JEITA_4_BF" : icharge_jeita_4
 *     + @ref LTC4015_ICHARGE_JEITA_3_BF "ICHARGE_JEITA_3_BF" : icharge_jeita_3
 *     + @ref LTC4015_ICHARGE_JEITA_2_BF "ICHARGE_JEITA_2_BF" : icharge_jeita_2
*/

//!@{
#define LTC4015_ICHARGE_JEITA_4_3_2_SUBADDR 40
#define LTC4015_ICHARGE_JEITA_4_3_2 (0 << 12 | (16 - 1) << 8 | LTC4015_ICHARGE_JEITA_4_3_2_SUBADDR)
//!@}
/*! @defgroup LTC4015_ICHARGE_JEITA_4_BF ICHARGE_JEITA_4_BF
 *  @ingroup LTC4015_register_map
 *  @brief ICHARGE_JEITA_4_BF Bit Field
 *
 *  icharge_jeita_4
 *   - Register: @ref LTC4015_ICHARGE_JEITA_4_3_2 "ICHARGE_JEITA_4_3_2"
 *   - CommandCode: 40
 *   - Size: 5
 *   - Offset: 10
 *   - MSB: 14
 *   - MASK: 0x7C00
 *   - Access: R/W
 *   - Default: 31
 */
//!@{
#define LTC4015_ICHARGE_JEITA_4_BF_SUBADDR LTC4015_ICHARGE_JEITA_4_3_2_SUBADDR //!< @ref LTC4015_ICHARGE_JEITA_4_BF "ICHARGE_JEITA_4_BF"
#define LTC4015_ICHARGE_JEITA_4_BF_SIZE 5
#define LTC4015_ICHARGE_JEITA_4_BF_OFFSET 10
#define LTC4015_ICHARGE_JEITA_4_BF_MASK 0x7C00
#define LTC4015_ICHARGE_JEITA_4_BF (LTC4015_ICHARGE_JEITA_4_BF_OFFSET << 12 | (LTC4015_ICHARGE_JEITA_4_BF_SIZE - 1) << 8 | LTC4015_ICHARGE_JEITA_4_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_ICHARGE_JEITA_3_BF ICHARGE_JEITA_3_BF
 *  @ingroup LTC4015_register_map
 *  @brief ICHARGE_JEITA_3_BF Bit Field
 *
 *  icharge_jeita_3
 *   - Register: @ref LTC4015_ICHARGE_JEITA_4_3_2 "ICHARGE_JEITA_4_3_2"
 *   - CommandCode: 40
 *   - Size: 5
 *   - Offset: 5
 *   - MSB: 9
 *   - MASK: 0x03E0
 *   - Access: R/W
 *   - Default: 31
 */
//!@{
#define LTC4015_ICHARGE_JEITA_3_BF_SUBADDR LTC4015_ICHARGE_JEITA_4_3_2_SUBADDR //!< @ref LTC4015_ICHARGE_JEITA_3_BF "ICHARGE_JEITA_3_BF"
#define LTC4015_ICHARGE_JEITA_3_BF_SIZE 5
#define LTC4015_ICHARGE_JEITA_3_BF_OFFSET 5
#define LTC4015_ICHARGE_JEITA_3_BF_MASK 0x03E0
#define LTC4015_ICHARGE_JEITA_3_BF (LTC4015_ICHARGE_JEITA_3_BF_OFFSET << 12 | (LTC4015_ICHARGE_JEITA_3_BF_SIZE - 1) << 8 | LTC4015_ICHARGE_JEITA_3_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_ICHARGE_JEITA_2_BF ICHARGE_JEITA_2_BF
 *  @ingroup LTC4015_register_map
 *  @brief ICHARGE_JEITA_2_BF Bit Field
 *
 *  icharge_jeita_2
 *   - Register: @ref LTC4015_ICHARGE_JEITA_4_3_2 "ICHARGE_JEITA_4_3_2"
 *   - CommandCode: 40
 *   - Size: 5
 *   - Offset: 0
 *   - MSB: 4
 *   - MASK: 0x001F
 *   - Access: R/W
 *   - Default: 15
 */
//!@{
#define LTC4015_ICHARGE_JEITA_2_BF_SUBADDR LTC4015_ICHARGE_JEITA_4_3_2_SUBADDR //!< @ref LTC4015_ICHARGE_JEITA_2_BF "ICHARGE_JEITA_2_BF"
#define LTC4015_ICHARGE_JEITA_2_BF_SIZE 5
#define LTC4015_ICHARGE_JEITA_2_BF_OFFSET 0
#define LTC4015_ICHARGE_JEITA_2_BF_MASK 0x001F
#define LTC4015_ICHARGE_JEITA_2_BF (LTC4015_ICHARGE_JEITA_2_BF_OFFSET << 12 | (LTC4015_ICHARGE_JEITA_2_BF_SIZE - 1) << 8 | LTC4015_ICHARGE_JEITA_2_BF_SUBADDR)
//!@}

