YY-Edwards/STM32_USB-FS-Device_v4.1/mylib/DC2039A/LTC4015/LTC4015_reg_defs.h
/*! @defgroup LTC4015_CHARGER_CONFIG_BITS CHARGER_CONFIG_BITS
 *  @ingroup LTC4015_register_map
 *  @brief CHARGER_CONFIG_BITS Register
 *
 * | 15:3 |                   2 |                         1 |           0 |
 * |:----:|:-------------------:|:-------------------------:|:-----------:|
 * |  n/a | EN_C_OVER_X_TERM_BF | EN_LEAD_ACID_TEMP_COMP_BF | EN_JEITA_BF |
 *
 * Battery charger configuration setting
 *   - CommandCode: 41
 *   - Contains Bit Fields:
 *     + @ref LTC4015_EN_C_OVER_X_TERM_BF "EN_C_OVER_X_TERM_BF" : Enable C/x termination
 *     + @ref LTC4015_EN_LEAD_ACID_TEMP_COMP_BF "EN_LEAD_ACID_TEMP_COMP_BF" : Enable lead acid charge voltage temperature compensation
 *     + @ref LTC4015_EN_JEITA_BF "EN_JEITA_BF" : Enable JEITA temperature profile
*/

//!@{
#define LTC4015_CHARGER_CONFIG_BITS_SUBADDR 41
#define LTC4015_CHARGER_CONFIG_BITS (0 << 12 | (16 - 1) << 8 | LTC4015_CHARGER_CONFIG_BITS_SUBADDR)
//!@}
/*! @defgroup LTC4015_EN_C_OVER_X_TERM_BF EN_C_OVER_X_TERM_BF
 *  @ingroup LTC4015_register_map
 *  @brief EN_C_OVER_X_TERM_BF Bit Field
 *
 *  Enable C/x termination
 *   - Register: @ref LTC4015_CHARGER_CONFIG_BITS "CHARGER_CONFIG_BITS"
 *   - CommandCode: 41
 *   - Size: 1
 *   - Offset: 2
 *   - MSB: 2
 *   - MASK: 0x0004
 *   - Access: R/W
 *   - Default: 1
 */
//!@{
#define LTC4015_EN_C_OVER_X_TERM_BF_SUBADDR LTC4015_CHARGER_CONFIG_BITS_SUBADDR //!< @ref LTC4015_EN_C_OVER_X_TERM_BF "EN_C_OVER_X_TERM_BF"
#define LTC4015_EN_C_OVER_X_TERM_BF_SIZE 1
#define LTC4015_EN_C_OVER_X_TERM_BF_OFFSET 2
#define LTC4015_EN_C_OVER_X_TERM_BF_MASK 0x0004
#define LTC4015_EN_C_OVER_X_TERM_BF (LTC4015_EN_C_OVER_X_TERM_BF_OFFSET << 12 | (LTC4015_EN_C_OVER_X_TERM_BF_SIZE - 1) << 8 | LTC4015_EN_C_OVER_X_TERM_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_EN_LEAD_ACID_TEMP_COMP_BF EN_LEAD_ACID_TEMP_COMP_BF
 *  @ingroup LTC4015_register_map
 *  @brief EN_LEAD_ACID_TEMP_COMP_BF Bit Field
 *
 *  Enable lead acid charge voltage temperature compensation
 *   - Register: @ref LTC4015_CHARGER_CONFIG_BITS "CHARGER_CONFIG_BITS"
 *   - CommandCode: 41
 *   - Size: 1
 *   - Offset: 1
 *   - MSB: 1
 *   - MASK: 0x0002
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_EN_LEAD_ACID_TEMP_COMP_BF_SUBADDR LTC4015_CHARGER_CONFIG_BITS_SUBADDR //!< @ref LTC4015_EN_LEAD_ACID_TEMP_COMP_BF "EN_LEAD_ACID_TEMP_COMP_BF"
#define LTC4015_EN_LEAD_ACID_TEMP_COMP_BF_SIZE 1
#define LTC4015_EN_LEAD_ACID_TEMP_COMP_BF_OFFSET 1
#define LTC4015_EN_LEAD_ACID_TEMP_COMP_BF_MASK 0x0002
#define LTC4015_EN_LEAD_ACID_TEMP_COMP_BF (LTC4015_EN_LEAD_ACID_TEMP_COMP_BF_OFFSET << 12 | (LTC4015_EN_LEAD_ACID_TEMP_COMP_BF_SIZE - 1) << 8 | LTC4015_EN_LEAD_ACID_TEMP_COMP_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_EN_JEITA_BF EN_JEITA_BF
 *  @ingroup LTC4015_register_map
 *  @brief EN_JEITA_BF Bit Field
 *
 *  Enable JEITA temperature profile
 *   - Register: @ref LTC4015_CHARGER_CONFIG_BITS "CHARGER_CONFIG_BITS"
 *   - CommandCode: 41
 *   - Size: 1
 *   - Offset: 0
 *   - MSB: 0
 *   - MASK: 0x0001
 *   - Access: R/W
 *   - Default: 1
 */
//!@{
#define LTC4015_EN_JEITA_BF_SUBADDR LTC4015_CHARGER_CONFIG_BITS_SUBADDR //!< @ref LTC4015_EN_JEITA_BF "EN_JEITA_BF"
#define LTC4015_EN_JEITA_BF_SIZE 1
#define LTC4015_EN_JEITA_BF_OFFSET 0
#define LTC4015_EN_JEITA_BF_MASK 0x0001
#define LTC4015_EN_JEITA_BF (LTC4015_EN_JEITA_BF_OFFSET << 12 | (LTC4015_EN_JEITA_BF_SIZE - 1) << 8 | LTC4015_EN_JEITA_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_VABSORB_DELTA VABSORB_DELTA
 *  @ingroup LTC4015_register_map
 *  @brief VABSORB_DELTA Register
 *
 * | 15:6 |              5:0 |
 * |:----:|:----------------:|
 * |  n/a | VABSORB_DELTA_BF |
 *
 *   - CommandCode: 42
 *   - Contains Bit Fields:
 *     + @ref LTC4015_VABSORB_DELTA_BF "VABSORB_DELTA_BF" : LiFePO4[/lead-acid] absorb voltage adder
*/

//!@{
#define LTC4015_VABSORB_DELTA_SUBADDR 42
#define LTC4015_VABSORB_DELTA (0 << 12 | (16 - 1) << 8 | LTC4015_VABSORB_DELTA_SUBADDR)
//!@}
/*! @defgroup LTC4015_VABSORB_DELTA_BF VABSORB_DELTA_BF
 *  @ingroup LTC4015_register_map
 *  @brief VABSORB_DELTA_BF Bit Field
 *
 *  LiFePO4[/lead-acid] absorb voltage adder
 *   - Register: @ref LTC4015_VABSORB_DELTA "VABSORB_DELTA"
 *   - CommandCode: 42
 *   - Size: 6
 *   - Offset: 0
 *   - MSB: 5
 *   - MASK: 0x003F
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_VABSORB_DELTA_BF_SUBADDR LTC4015_VABSORB_DELTA_SUBADDR //!< @ref LTC4015_VABSORB_DELTA_BF "VABSORB_DELTA_BF"
#define LTC4015_VABSORB_DELTA_BF_SIZE 6
#define LTC4015_VABSORB_DELTA_BF_OFFSET 0
#define LTC4015_VABSORB_DELTA_BF_MASK 0x003F
#define LTC4015_VABSORB_DELTA_BF (LTC4015_VABSORB_DELTA_BF_OFFSET << 12 | (LTC4015_VABSORB_DELTA_BF_SIZE - 1) << 8 | LTC4015_VABSORB_DELTA_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_MAX_ABSORB_TIME MAX_ABSORB_TIME
 *  @ingroup LTC4015_register_map
 *  @brief MAX_ABSORB_TIME Register
 *
 * |               15:0 |
 * |:------------------:|
 * | MAX_ABSORB_TIME_BF |
 *
 *   - CommandCode: 43
 *   - Contains Bit Fields:
 *     + @ref LTC4015_MAX_ABSORB_TIME_BF "MAX_ABSORB_TIME_BF" : Maximum time for LiFePO4[/lead-acid] absorb charge
*/

//!@{
#define LTC4015_MAX_ABSORB_TIME_SUBADDR 43
#define LTC4015_MAX_ABSORB_TIME (0 << 12 | (16 - 1) << 8 | LTC4015_MAX_ABSORB_TIME_SUBADDR)
//!@}
/*! @defgroup LTC4015_MAX_ABSORB_TIME_BF MAX_ABSORB_TIME_BF
 *  @ingroup LTC4015_register_map
 *  @brief MAX_ABSORB_TIME_BF Bit Field
 *
 *  Maximum time for LiFePO4[/lead-acid] absorb charge
 *   - Register: @ref LTC4015_MAX_ABSORB_TIME "MAX_ABSORB_TIME"
 *   - CommandCode: 43
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_MAX_ABSORB_TIME_BF_SUBADDR LTC4015_MAX_ABSORB_TIME_SUBADDR //!< @ref LTC4015_MAX_ABSORB_TIME_BF "MAX_ABSORB_TIME_BF"
#define LTC4015_MAX_ABSORB_TIME_BF_SIZE 16
#define LTC4015_MAX_ABSORB_TIME_BF_OFFSET 0
#define LTC4015_MAX_ABSORB_TIME_BF_MASK 0xFFFF
#define LTC4015_MAX_ABSORB_TIME_BF (LTC4015_MAX_ABSORB_TIME_BF_OFFSET << 12 | (LTC4015_MAX_ABSORB_TIME_BF_SIZE - 1) << 8 | LTC4015_MAX_ABSORB_TIME_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_VEQUALIZE_DELTA VEQUALIZE_DELTA
 *  @ingroup LTC4015_register_map
 *  @brief VEQUALIZE_DELTA Register
 *
 * | 15:6 |                5:0 |
 * |:----:|:------------------:|
 * |  n/a | VEQUALIZE_DELTA_BF |
 *
 *   - CommandCode: 44
 *   - Contains Bit Fields:
 *     + @ref LTC4015_VEQUALIZE_DELTA_BF "VEQUALIZE_DELTA_BF" : Lead acid equalize charge voltage adder
*/

//!@{
#define LTC4015_VEQUALIZE_DELTA_SUBADDR 44
#define LTC4015_VEQUALIZE_DELTA (0 << 12 | (16 - 1) << 8 | LTC4015_VEQUALIZE_DELTA_SUBADDR)
//!@}
/*! @defgroup LTC4015_VEQUALIZE_DELTA_BF VEQUALIZE_DELTA_BF
 *  @ingroup LTC4015_register_map
 *  @brief VEQUALIZE_DELTA_BF Bit Field
 *
 *  Lead acid equalize charge voltage adder
 *   - Register: @ref LTC4015_VEQUALIZE_DELTA "VEQUALIZE_DELTA"
 *   - CommandCode: 44
 *   - Size: 6
 *   - Offset: 0
 *   - MSB: 5
 *   - MASK: 0x003F
 *   - Access: R/W
 *   - Default: 42
 */
//!@{
#define LTC4015_VEQUALIZE_DELTA_BF_SUBADDR LTC4015_VEQUALIZE_DELTA_SUBADDR //!< @ref LTC4015_VEQUALIZE_DELTA_BF "VEQUALIZE_DELTA_BF"
#define LTC4015_VEQUALIZE_DELTA_BF_SIZE 6
#define LTC4015_VEQUALIZE_DELTA_BF_OFFSET 0
#define LTC4015_VEQUALIZE_DELTA_BF_MASK 0x003F
#define LTC4015_VEQUALIZE_DELTA_BF (LTC4015_VEQUALIZE_DELTA_BF_OFFSET << 12 | (LTC4015_VEQUALIZE_DELTA_BF_SIZE - 1) << 8 | LTC4015_VEQUALIZE_DELTA_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_EQUALIZE_TIME EQUALIZE_TIME
 *  @ingroup LTC4015_register_map
 *  @brief EQUALIZE_TIME Register
 *
 * |             15:0 |
 * |:----------------:|
 * | EQUALIZE_TIME_BF |
 *
 *   - CommandCode: 45
 *   - Contains Bit Fields:
 *     + @ref LTC4015_EQUALIZE_TIME_BF "EQUALIZE_TIME_BF" : Lead acid equalization time
*/

//!@{
#define LTC4015_EQUALIZE_TIME_SUBADDR 45
#define LTC4015_EQUALIZE_TIME (0 << 12 | (16 - 1) << 8 | LTC4015_EQUALIZE_TIME_SUBADDR)
//!@}
/*! @defgroup LTC4015_EQUALIZE_TIME_BF EQUALIZE_TIME_BF
 *  @ingroup LTC4015_register_map
 *  @brief EQUALIZE_TIME_BF Bit Field
 *
 *  Lead acid equalization time
 *   - Register: @ref LTC4015_EQUALIZE_TIME "EQUALIZE_TIME"
 *   - CommandCode: 45
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R/W
 *   - Default: 3600
 */
//!@{
#define LTC4015_EQUALIZE_TIME_BF_SUBADDR LTC4015_EQUALIZE_TIME_SUBADDR //!< @ref LTC4015_EQUALIZE_TIME_BF "EQUALIZE_TIME_BF"
#define LTC4015_EQUALIZE_TIME_BF_SIZE 16
#define LTC4015_EQUALIZE_TIME_BF_OFFSET 0
#define LTC4015_EQUALIZE_TIME_BF_MASK 0xFFFF
#define LTC4015_EQUALIZE_TIME_BF (LTC4015_EQUALIZE_TIME_BF_OFFSET << 12 | (LTC4015_EQUALIZE_TIME_BF_SIZE - 1) << 8 | LTC4015_EQUALIZE_TIME_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_LIFEPO4_RECHARGE_THRESHOLD LIFEPO4_RECHARGE_THRESHOLD
 *  @ingroup LTC4015_register_map
 *  @brief LIFEPO4_RECHARGE_THRESHOLD Register
 *
 * |                          15:0 |
 * |:-----------------------------:|
 * | LIFEPO4_RECHARGE_THRESHOLD_BF |
 *
 *   - CommandCode: 46
 *   - Contains Bit Fields:
 *     + @ref LTC4015_LIFEPO4_RECHARGE_THRESHOLD_BF "LIFEPO4_RECHARGE_THRESHOLD_BF" : LIFEPO4_RECHARGE_THRESHOLD
*/

//!@{
#define LTC4015_LIFEPO4_RECHARGE_THRESHOLD_SUBADDR 46
#define LTC4015_LIFEPO4_RECHARGE_THRESHOLD (0 << 12 | (16 - 1) << 8 | LTC4015_LIFEPO4_RECHARGE_THRESHOLD_SUBADDR)
//!@}
/*! @defgroup LTC4015_LIFEPO4_RECHARGE_THRESHOLD_BF LIFEPO4_RECHARGE_THRESHOLD_BF
 *  @ingroup LTC4015_register_map
 *  @brief LIFEPO4_RECHARGE_THRESHOLD_BF Bit Field
 *
 *  LIFEPO4_RECHARGE_THRESHOLD
 *   - Register: @ref LTC4015_LIFEPO4_RECHARGE_THRESHOLD "LIFEPO4_RECHARGE_THRESHOLD"
 *   - CommandCode: 46
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R/W
 *   - Default: 17424
 */
//!@{
#define LTC4015_LIFEPO4_RECHARGE_THRESHOLD_BF_SUBADDR LTC4015_LIFEPO4_RECHARGE_THRESHOLD_SUBADDR //!< @ref LTC4015_LIFEPO4_RECHARGE_THRESHOLD_BF "LIFEPO4_RECHARGE_THRESHOLD_BF"
#define LTC4015_LIFEPO4_RECHARGE_THRESHOLD_BF_SIZE 16
#define LTC4015_LIFEPO4_RECHARGE_THRESHOLD_BF_OFFSET 0
#define LTC4015_LIFEPO4_RECHARGE_THRESHOLD_BF_MASK 0xFFFF
#define LTC4015_LIFEPO4_RECHARGE_THRESHOLD_BF (LTC4015_LIFEPO4_RECHARGE_THRESHOLD_BF_OFFSET << 12 | (LTC4015_LIFEPO4_RECHARGE_THRESHOLD_BF_SIZE - 1) << 8 | LTC4015_LIFEPO4_RECHARGE_THRESHOLD_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_RESERVED_0X2F RESERVED_0X2F
 *  @ingroup LTC4015_register_map
 *  @brief RESERVED_0X2F Register
 *
 * |             15:0 |
 * |:----------------:|
 * | RESERVED_0X2F_BF |
 *
 *   - CommandCode: 47
 *   - Contains Bit Fields:
 *     + @ref LTC4015_RESERVED_0X2F_BF "RESERVED_0X2F_BF" : RESERVED
*/

//!@{
#define LTC4015_RESERVED_0X2F_SUBADDR 47
#define LTC4015_RESERVED_0X2F (0 << 12 | (16 - 1) << 8 | LTC4015_RESERVED_0X2F_SUBADDR)
//!@}
/*! @defgroup LTC4015_RESERVED_0X2F_BF RESERVED_0X2F_BF
 *  @ingroup LTC4015_register_map
 *  @brief RESERVED_0X2F_BF Bit Field
 *
 *  RESERVED
 *   - Register: @ref LTC4015_RESERVED_0X2F "RESERVED_0X2F"
 *   - CommandCode: 47
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R/W
 *   - Default: 0
 */
//!@{
#define LTC4015_RESERVED_0X2F_BF_SUBADDR LTC4015_RESERVED_0X2F_SUBADDR //!< @ref LTC4015_RESERVED_0X2F_BF "RESERVED_0X2F_BF"
#define LTC4015_RESERVED_0X2F_BF_SIZE 16
#define LTC4015_RESERVED_0X2F_BF_OFFSET 0
#define LTC4015_RESERVED_0X2F_BF_MASK 0xFFFF
#define LTC4015_RESERVED_0X2F_BF (LTC4015_RESERVED_0X2F_BF_OFFSET << 12 | (LTC4015_RESERVED_0X2F_BF_SIZE - 1) << 8 | LTC4015_RESERVED_0X2F_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_MAX_CHARGE_TIMER MAX_CHARGE_TIMER
 *  @ingroup LTC4015_register_map
 *  @brief MAX_CHARGE_TIMER Register
 *
 * |                15:0 |
 * |:-------------------:|
 * | MAX_CHARGE_TIMER_BF |
 *
 *   - CommandCode: 48
 *   - Contains Bit Fields:
 *     + @ref LTC4015_MAX_CHARGE_TIMER_BF "MAX_CHARGE_TIMER_BF" : For lithium chemistries, indicates the time (in sec) that the battery has been charging
*/

//!@{
#define LTC4015_MAX_CHARGE_TIMER_SUBADDR 48
#define LTC4015_MAX_CHARGE_TIMER (0 << 12 | (16 - 1) << 8 | LTC4015_MAX_CHARGE_TIMER_SUBADDR)
//!@}
/*! @defgroup LTC4015_MAX_CHARGE_TIMER_BF MAX_CHARGE_TIMER_BF
 *  @ingroup LTC4015_register_map
 *  @brief MAX_CHARGE_TIMER_BF Bit Field
 *
 *  For lithium chemistries, indicates the time (in sec) that the battery has been charging
 *   - Register: @ref LTC4015_MAX_CHARGE_TIMER "MAX_CHARGE_TIMER"
 *   - CommandCode: 48
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_MAX_CHARGE_TIMER_BF_SUBADDR LTC4015_MAX_CHARGE_TIMER_SUBADDR //!< @ref LTC4015_MAX_CHARGE_TIMER_BF "MAX_CHARGE_TIMER_BF"
#define LTC4015_MAX_CHARGE_TIMER_BF_SIZE 16
#define LTC4015_MAX_CHARGE_TIMER_BF_OFFSET 0
#define LTC4015_MAX_CHARGE_TIMER_BF_MASK 0xFFFF
#define LTC4015_MAX_CHARGE_TIMER_BF (LTC4015_MAX_CHARGE_TIMER_BF_OFFSET << 12 | (LTC4015_MAX_CHARGE_TIMER_BF_SIZE - 1) << 8 | LTC4015_MAX_CHARGE_TIMER_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_CV_TIMER CV_TIMER
 *  @ingroup LTC4015_register_map
 *  @brief CV_TIMER Register
 *
 * |        15:0 |
 * |:-----------:|
 * | CV_TIMER_BF |
 *
 *   - CommandCode: 49
 *   - Contains Bit Fields:
 *     + @ref LTC4015_CV_TIMER_BF "CV_TIMER_BF" : For lithium chemistries, indicates the time (in sec) that the battery has been in constant-voltage regulation
*/

//!@{
#define LTC4015_CV_TIMER_SUBADDR 49
#define LTC4015_CV_TIMER (0 << 12 | (16 - 1) << 8 | LTC4015_CV_TIMER_SUBADDR)
//!@}
/*! @defgroup LTC4015_CV_TIMER_BF CV_TIMER_BF
 *  @ingroup LTC4015_register_map
 *  @brief CV_TIMER_BF Bit Field
 *
 *  For lithium chemistries, indicates the time (in sec) that the battery has been in constant-voltage regulation
 *   - Register: @ref LTC4015_CV_TIMER "CV_TIMER"
 *   - CommandCode: 49
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_CV_TIMER_BF_SUBADDR LTC4015_CV_TIMER_SUBADDR //!< @ref LTC4015_CV_TIMER_BF "CV_TIMER_BF"
#define LTC4015_CV_TIMER_BF_SIZE 16
#define LTC4015_CV_TIMER_BF_OFFSET 0
#define LTC4015_CV_TIMER_BF_MASK 0xFFFF
#define LTC4015_CV_TIMER_BF (LTC4015_CV_TIMER_BF_OFFSET << 12 | (LTC4015_CV_TIMER_BF_SIZE - 1) << 8 | LTC4015_CV_TIMER_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_ABSORB_TIMER ABSORB_TIMER
 *  @ingroup LTC4015_register_map
 *  @brief ABSORB_TIMER Register
 *
 * |            15:0 |
 * |:---------------:|
 * | ABSORB_TIMER_BF |
 *
 *   - CommandCode: 50
 *   - Contains Bit Fields:
 *     + @ref LTC4015_ABSORB_TIMER_BF "ABSORB_TIMER_BF" : For LiFePO4 and lead-acid batteries, indicates the time (in sec) that the battery has been in absorb phase
*/

//!@{
#define LTC4015_ABSORB_TIMER_SUBADDR 50
#define LTC4015_ABSORB_TIMER (0 << 12 | (16 - 1) << 8 | LTC4015_ABSORB_TIMER_SUBADDR)
//!@}
/*! @defgroup LTC4015_ABSORB_TIMER_BF ABSORB_TIMER_BF
 *  @ingroup LTC4015_register_map
 *  @brief ABSORB_TIMER_BF Bit Field
 *
 *  For LiFePO4 and lead-acid batteries, indicates the time (in sec) that the battery has been in absorb phase
 *   - Register: @ref LTC4015_ABSORB_TIMER "ABSORB_TIMER"
 *   - CommandCode: 50
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_ABSORB_TIMER_BF_SUBADDR LTC4015_ABSORB_TIMER_SUBADDR //!< @ref LTC4015_ABSORB_TIMER_BF "ABSORB_TIMER_BF"
#define LTC4015_ABSORB_TIMER_BF_SIZE 16
#define LTC4015_ABSORB_TIMER_BF_OFFSET 0
#define LTC4015_ABSORB_TIMER_BF_MASK 0xFFFF
#define LTC4015_ABSORB_TIMER_BF (LTC4015_ABSORB_TIMER_BF_OFFSET << 12 | (LTC4015_ABSORB_TIMER_BF_SIZE - 1) << 8 | LTC4015_ABSORB_TIMER_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_EQUALIZE_TIMER EQUALIZE_TIMER
 *  @ingroup LTC4015_register_map
 *  @brief EQUALIZE_TIMER Register
 *
 * |              15:0 |
 * |:-----------------:|
 * | EQUALIZE_TIMER_BF |
 *
 *   - CommandCode: 51
 *   - Contains Bit Fields:
 *     + @ref LTC4015_EQUALIZE_TIMER_BF "EQUALIZE_TIMER_BF" : For lead-acid batteries, indicates the time (in sec) that the battery has been in EQUALIZE phase
*/

//!@{
#define LTC4015_EQUALIZE_TIMER_SUBADDR 51
#define LTC4015_EQUALIZE_TIMER (0 << 12 | (16 - 1) << 8 | LTC4015_EQUALIZE_TIMER_SUBADDR)
//!@}
/*! @defgroup LTC4015_EQUALIZE_TIMER_BF EQUALIZE_TIMER_BF
 *  @ingroup LTC4015_register_map
 *  @brief EQUALIZE_TIMER_BF Bit Field
 *
 *  For lead-acid batteries, indicates the time (in sec) that the battery has been in EQUALIZE phase
 *   - Register: @ref LTC4015_EQUALIZE_TIMER "EQUALIZE_TIMER"
 *   - CommandCode: 51
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_EQUALIZE_TIMER_BF_SUBADDR LTC4015_EQUALIZE_TIMER_SUBADDR //!< @ref LTC4015_EQUALIZE_TIMER_BF "EQUALIZE_TIMER_BF"
#define LTC4015_EQUALIZE_TIMER_BF_SIZE 16
#define LTC4015_EQUALIZE_TIMER_BF_OFFSET 0
#define LTC4015_EQUALIZE_TIMER_BF_MASK 0xFFFF
#define LTC4015_EQUALIZE_TIMER_BF (LTC4015_EQUALIZE_TIMER_BF_OFFSET << 12 | (LTC4015_EQUALIZE_TIMER_BF_SIZE - 1) << 8 | LTC4015_EQUALIZE_TIMER_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_CHARGER_STATE CHARGER_STATE
 *  @ingroup LTC4015_register_map
 *  @brief CHARGER_STATE Register
 *
 * | 15:11 |                 10 |                9 |                    8 |            7 |               6 |            5 |             4 |                3 |                        2 |                    1 |                  0 |
 * |:-----:|:------------------:|:----------------:|:--------------------:|:------------:|:---------------:|:------------:|:-------------:|:----------------:|:------------------------:|:--------------------:|:------------------:|
 * |   n/a | EQUALIZE_CHARGE_BF | ABSORB_CHARGE_BF | CHARGER_SUSPENDED_BF | PRECHARGE_BF | CC_CV_CHARGE_BF | NTC_PAUSE_BF | TIMER_TERM_BF | C_OVER_X_TERM_BF | MAX_CHARGE_TIME_FAULT_BF | BAT_MISSING_FAULT_BF | BAT_SHORT_FAULT_BF |
 *
 * Real time battery charger state indicator. Individual bits are mutually exclusive. Bits 15:11 are reserved.
 *   - CommandCode: 52
 *   - Contains Bit Fields:
 *     + @ref LTC4015_EQUALIZE_CHARGE_BF "EQUALIZE_CHARGE_BF" : Indicates battery charger is in lead-acid equalization charge state
 *     + @ref LTC4015_ABSORB_CHARGE_BF "ABSORB_CHARGE_BF" : Indicates battery charger is in absorb charge state
 *     + @ref LTC4015_CHARGER_SUSPENDED_BF "CHARGER_SUSPENDED_BF" : Indicates battery charger is in charger suspended state
 *     + @ref LTC4015_PRECHARGE_BF "PRECHARGE_BF" : Indicates battery charger is in precondition charge state
 *     + @ref LTC4015_CC_CV_CHARGE_BF "CC_CV_CHARGE_BF" : Indicates battery charger is in CC-CV state
 *     + @ref LTC4015_NTC_PAUSE_BF "NTC_PAUSE_BF" : Indicates battery charger is in thermistor pause state
 *     + @ref LTC4015_TIMER_TERM_BF "TIMER_TERM_BF" : Indicates battery charger is in timer termination state
 *     + @ref LTC4015_C_OVER_X_TERM_BF "C_OVER_X_TERM_BF" : Indicates battery charger is in C/x termination state
 *     + @ref LTC4015_MAX_CHARGE_TIME_FAULT_BF "MAX_CHARGE_TIME_FAULT_BF" : indicates battery charger is in max_charge_time_fault state
 *     + @ref LTC4015_BAT_MISSING_FAULT_BF "BAT_MISSING_FAULT_BF" : Indicates battery charger is in missing battery fault state
 *     + @ref LTC4015_BAT_SHORT_FAULT_BF "BAT_SHORT_FAULT_BF" : Indicates battery charger is in shorted battery fault state
*/

