YY-Edwards/STM32_USB-FS-Device_v4.1/mylib/DC2039A/LTC4015/LTC4015_reg_defs.h
//!@{
#define LTC4015_CHARGER_STATE_SUBADDR 52
#define LTC4015_CHARGER_STATE (0 << 12 | (16 - 1) << 8 | LTC4015_CHARGER_STATE_SUBADDR)
//!@}
/*! @defgroup LTC4015_EQUALIZE_CHARGE_BF EQUALIZE_CHARGE_BF
 *  @ingroup LTC4015_register_map
 *  @brief EQUALIZE_CHARGE_BF Bit Field
 *
 *  Indicates battery charger is in lead-acid equalization charge state
 *   - Register: @ref LTC4015_CHARGER_STATE "CHARGER_STATE"
 *   - CommandCode: 52
 *   - Size: 1
 *   - Offset: 10
 *   - MSB: 10
 *   - MASK: 0x0400
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_EQUALIZE_CHARGE_BF_SUBADDR LTC4015_CHARGER_STATE_SUBADDR //!< @ref LTC4015_EQUALIZE_CHARGE_BF "EQUALIZE_CHARGE_BF"
#define LTC4015_EQUALIZE_CHARGE_BF_SIZE 1
#define LTC4015_EQUALIZE_CHARGE_BF_OFFSET 10
#define LTC4015_EQUALIZE_CHARGE_BF_MASK 0x0400
#define LTC4015_EQUALIZE_CHARGE_BF (LTC4015_EQUALIZE_CHARGE_BF_OFFSET << 12 | (LTC4015_EQUALIZE_CHARGE_BF_SIZE - 1) << 8 | LTC4015_EQUALIZE_CHARGE_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_ABSORB_CHARGE_BF ABSORB_CHARGE_BF
 *  @ingroup LTC4015_register_map
 *  @brief ABSORB_CHARGE_BF Bit Field
 *
 *  Indicates battery charger is in absorb charge state
 *   - Register: @ref LTC4015_CHARGER_STATE "CHARGER_STATE"
 *   - CommandCode: 52
 *   - Size: 1
 *   - Offset: 9
 *   - MSB: 9
 *   - MASK: 0x0200
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_ABSORB_CHARGE_BF_SUBADDR LTC4015_CHARGER_STATE_SUBADDR //!< @ref LTC4015_ABSORB_CHARGE_BF "ABSORB_CHARGE_BF"
#define LTC4015_ABSORB_CHARGE_BF_SIZE 1
#define LTC4015_ABSORB_CHARGE_BF_OFFSET 9
#define LTC4015_ABSORB_CHARGE_BF_MASK 0x0200
#define LTC4015_ABSORB_CHARGE_BF (LTC4015_ABSORB_CHARGE_BF_OFFSET << 12 | (LTC4015_ABSORB_CHARGE_BF_SIZE - 1) << 8 | LTC4015_ABSORB_CHARGE_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_CHARGER_SUSPENDED_BF CHARGER_SUSPENDED_BF
 *  @ingroup LTC4015_register_map
 *  @brief CHARGER_SUSPENDED_BF Bit Field
 *
 *  Indicates battery charger is in charger suspended state
 *   - Register: @ref LTC4015_CHARGER_STATE "CHARGER_STATE"
 *   - CommandCode: 52
 *   - Size: 1
 *   - Offset: 8
 *   - MSB: 8
 *   - MASK: 0x0100
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_CHARGER_SUSPENDED_BF_SUBADDR LTC4015_CHARGER_STATE_SUBADDR //!< @ref LTC4015_CHARGER_SUSPENDED_BF "CHARGER_SUSPENDED_BF"
#define LTC4015_CHARGER_SUSPENDED_BF_SIZE 1
#define LTC4015_CHARGER_SUSPENDED_BF_OFFSET 8
#define LTC4015_CHARGER_SUSPENDED_BF_MASK 0x0100
#define LTC4015_CHARGER_SUSPENDED_BF (LTC4015_CHARGER_SUSPENDED_BF_OFFSET << 12 | (LTC4015_CHARGER_SUSPENDED_BF_SIZE - 1) << 8 | LTC4015_CHARGER_SUSPENDED_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_PRECHARGE_BF PRECHARGE_BF
 *  @ingroup LTC4015_register_map
 *  @brief PRECHARGE_BF Bit Field
 *
 *  Indicates battery charger is in precondition charge state
 *   - Register: @ref LTC4015_CHARGER_STATE "CHARGER_STATE"
 *   - CommandCode: 52
 *   - Size: 1
 *   - Offset: 7
 *   - MSB: 7
 *   - MASK: 0x0080
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_PRECHARGE_BF_SUBADDR LTC4015_CHARGER_STATE_SUBADDR //!< @ref LTC4015_PRECHARGE_BF "PRECHARGE_BF"
#define LTC4015_PRECHARGE_BF_SIZE 1
#define LTC4015_PRECHARGE_BF_OFFSET 7
#define LTC4015_PRECHARGE_BF_MASK 0x0080
#define LTC4015_PRECHARGE_BF (LTC4015_PRECHARGE_BF_OFFSET << 12 | (LTC4015_PRECHARGE_BF_SIZE - 1) << 8 | LTC4015_PRECHARGE_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_CC_CV_CHARGE_BF CC_CV_CHARGE_BF
 *  @ingroup LTC4015_register_map
 *  @brief CC_CV_CHARGE_BF Bit Field
 *
 *  Indicates battery charger is in CC-CV state
 *   - Register: @ref LTC4015_CHARGER_STATE "CHARGER_STATE"
 *   - CommandCode: 52
 *   - Size: 1
 *   - Offset: 6
 *   - MSB: 6
 *   - MASK: 0x0040
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_CC_CV_CHARGE_BF_SUBADDR LTC4015_CHARGER_STATE_SUBADDR //!< @ref LTC4015_CC_CV_CHARGE_BF "CC_CV_CHARGE_BF"
#define LTC4015_CC_CV_CHARGE_BF_SIZE 1
#define LTC4015_CC_CV_CHARGE_BF_OFFSET 6
#define LTC4015_CC_CV_CHARGE_BF_MASK 0x0040
#define LTC4015_CC_CV_CHARGE_BF (LTC4015_CC_CV_CHARGE_BF_OFFSET << 12 | (LTC4015_CC_CV_CHARGE_BF_SIZE - 1) << 8 | LTC4015_CC_CV_CHARGE_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_NTC_PAUSE_BF NTC_PAUSE_BF
 *  @ingroup LTC4015_register_map
 *  @brief NTC_PAUSE_BF Bit Field
 *
 *  Indicates battery charger is in thermistor pause state
 *   - Register: @ref LTC4015_CHARGER_STATE "CHARGER_STATE"
 *   - CommandCode: 52
 *   - Size: 1
 *   - Offset: 5
 *   - MSB: 5
 *   - MASK: 0x0020
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_NTC_PAUSE_BF_SUBADDR LTC4015_CHARGER_STATE_SUBADDR //!< @ref LTC4015_NTC_PAUSE_BF "NTC_PAUSE_BF"
#define LTC4015_NTC_PAUSE_BF_SIZE 1
#define LTC4015_NTC_PAUSE_BF_OFFSET 5
#define LTC4015_NTC_PAUSE_BF_MASK 0x0020
#define LTC4015_NTC_PAUSE_BF (LTC4015_NTC_PAUSE_BF_OFFSET << 12 | (LTC4015_NTC_PAUSE_BF_SIZE - 1) << 8 | LTC4015_NTC_PAUSE_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_TIMER_TERM_BF TIMER_TERM_BF
 *  @ingroup LTC4015_register_map
 *  @brief TIMER_TERM_BF Bit Field
 *
 *  Indicates battery charger is in timer termination state
 *   - Register: @ref LTC4015_CHARGER_STATE "CHARGER_STATE"
 *   - CommandCode: 52
 *   - Size: 1
 *   - Offset: 4
 *   - MSB: 4
 *   - MASK: 0x0010
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_TIMER_TERM_BF_SUBADDR LTC4015_CHARGER_STATE_SUBADDR //!< @ref LTC4015_TIMER_TERM_BF "TIMER_TERM_BF"
#define LTC4015_TIMER_TERM_BF_SIZE 1
#define LTC4015_TIMER_TERM_BF_OFFSET 4
#define LTC4015_TIMER_TERM_BF_MASK 0x0010
#define LTC4015_TIMER_TERM_BF (LTC4015_TIMER_TERM_BF_OFFSET << 12 | (LTC4015_TIMER_TERM_BF_SIZE - 1) << 8 | LTC4015_TIMER_TERM_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_C_OVER_X_TERM_BF C_OVER_X_TERM_BF
 *  @ingroup LTC4015_register_map
 *  @brief C_OVER_X_TERM_BF Bit Field
 *
 *  Indicates battery charger is in C/x termination state
 *   - Register: @ref LTC4015_CHARGER_STATE "CHARGER_STATE"
 *   - CommandCode: 52
 *   - Size: 1
 *   - Offset: 3
 *   - MSB: 3
 *   - MASK: 0x0008
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_C_OVER_X_TERM_BF_SUBADDR LTC4015_CHARGER_STATE_SUBADDR //!< @ref LTC4015_C_OVER_X_TERM_BF "C_OVER_X_TERM_BF"
#define LTC4015_C_OVER_X_TERM_BF_SIZE 1
#define LTC4015_C_OVER_X_TERM_BF_OFFSET 3
#define LTC4015_C_OVER_X_TERM_BF_MASK 0x0008
#define LTC4015_C_OVER_X_TERM_BF (LTC4015_C_OVER_X_TERM_BF_OFFSET << 12 | (LTC4015_C_OVER_X_TERM_BF_SIZE - 1) << 8 | LTC4015_C_OVER_X_TERM_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_MAX_CHARGE_TIME_FAULT_BF MAX_CHARGE_TIME_FAULT_BF
 *  @ingroup LTC4015_register_map
 *  @brief MAX_CHARGE_TIME_FAULT_BF Bit Field
 *
 *  indicates battery charger is in max_charge_time_fault state
 *   - Register: @ref LTC4015_CHARGER_STATE "CHARGER_STATE"
 *   - CommandCode: 52
 *   - Size: 1
 *   - Offset: 2
 *   - MSB: 2
 *   - MASK: 0x0004
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_MAX_CHARGE_TIME_FAULT_BF_SUBADDR LTC4015_CHARGER_STATE_SUBADDR //!< @ref LTC4015_MAX_CHARGE_TIME_FAULT_BF "MAX_CHARGE_TIME_FAULT_BF"
#define LTC4015_MAX_CHARGE_TIME_FAULT_BF_SIZE 1
#define LTC4015_MAX_CHARGE_TIME_FAULT_BF_OFFSET 2
#define LTC4015_MAX_CHARGE_TIME_FAULT_BF_MASK 0x0004
#define LTC4015_MAX_CHARGE_TIME_FAULT_BF (LTC4015_MAX_CHARGE_TIME_FAULT_BF_OFFSET << 12 | (LTC4015_MAX_CHARGE_TIME_FAULT_BF_SIZE - 1) << 8 | LTC4015_MAX_CHARGE_TIME_FAULT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_BAT_MISSING_FAULT_BF BAT_MISSING_FAULT_BF
 *  @ingroup LTC4015_register_map
 *  @brief BAT_MISSING_FAULT_BF Bit Field
 *
 *  Indicates battery charger is in missing battery fault state
 *   - Register: @ref LTC4015_CHARGER_STATE "CHARGER_STATE"
 *   - CommandCode: 52
 *   - Size: 1
 *   - Offset: 1
 *   - MSB: 1
 *   - MASK: 0x0002
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_BAT_MISSING_FAULT_BF_SUBADDR LTC4015_CHARGER_STATE_SUBADDR //!< @ref LTC4015_BAT_MISSING_FAULT_BF "BAT_MISSING_FAULT_BF"
#define LTC4015_BAT_MISSING_FAULT_BF_SIZE 1
#define LTC4015_BAT_MISSING_FAULT_BF_OFFSET 1
#define LTC4015_BAT_MISSING_FAULT_BF_MASK 0x0002
#define LTC4015_BAT_MISSING_FAULT_BF (LTC4015_BAT_MISSING_FAULT_BF_OFFSET << 12 | (LTC4015_BAT_MISSING_FAULT_BF_SIZE - 1) << 8 | LTC4015_BAT_MISSING_FAULT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_BAT_SHORT_FAULT_BF BAT_SHORT_FAULT_BF
 *  @ingroup LTC4015_register_map
 *  @brief BAT_SHORT_FAULT_BF Bit Field
 *
 *  Indicates battery charger is in shorted battery fault state
 *   - Register: @ref LTC4015_CHARGER_STATE "CHARGER_STATE"
 *   - CommandCode: 52
 *   - Size: 1
 *   - Offset: 0
 *   - MSB: 0
 *   - MASK: 0x0001
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_BAT_SHORT_FAULT_BF_SUBADDR LTC4015_CHARGER_STATE_SUBADDR //!< @ref LTC4015_BAT_SHORT_FAULT_BF "BAT_SHORT_FAULT_BF"
#define LTC4015_BAT_SHORT_FAULT_BF_SIZE 1
#define LTC4015_BAT_SHORT_FAULT_BF_OFFSET 0
#define LTC4015_BAT_SHORT_FAULT_BF_MASK 0x0001
#define LTC4015_BAT_SHORT_FAULT_BF (LTC4015_BAT_SHORT_FAULT_BF_OFFSET << 12 | (LTC4015_BAT_SHORT_FAULT_BF_SIZE - 1) << 8 | LTC4015_BAT_SHORT_FAULT_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_CHARGE_STATUS CHARGE_STATUS
 *  @ingroup LTC4015_register_map
 *  @brief CHARGE_STATUS Register
 *
 * | 15:4 |                  3 |                   2 |                   1 |                   0 |
 * |:----:|:------------------:|:-------------------:|:-------------------:|:-------------------:|
 * |  n/a | VIN_UVCL_ACTIVE_BF | IIN_LIMIT_ACTIVE_BF | CONSTANT_CURRENT_BF | CONSTANT_VOLTAGE_BF |
 *
 * Charge status indicator. Individual bits are mutually exclusive. Only active in charging states.
 *   - CommandCode: 53
 *   - Contains Bit Fields:
 *     + @ref LTC4015_VIN_UVCL_ACTIVE_BF "VIN_UVCL_ACTIVE_BF" : Indicates the input undervoltage control loop is actively controlling power delivery based on VIN_UVCL_SETTING
 *     + @ref LTC4015_IIN_LIMIT_ACTIVE_BF "IIN_LIMIT_ACTIVE_BF" : Indicates the input current limit control loop is actively controlling power delivery based on IIN_LIMIT[_DAC][_SETTING]
 *     + @ref LTC4015_CONSTANT_CURRENT_BF "CONSTANT_CURRENT_BF" : Indicates the charge current control loop is actively controlling power delivery based on ICHARGE_DAC
 *     + @ref LTC4015_CONSTANT_VOLTAGE_BF "CONSTANT_VOLTAGE_BF" : Indicates the battery voltage control loop is actively controlling power delivery based on VCHARGE_DAC
*/

//!@{
#define LTC4015_CHARGE_STATUS_SUBADDR 53
#define LTC4015_CHARGE_STATUS (0 << 12 | (16 - 1) << 8 | LTC4015_CHARGE_STATUS_SUBADDR)
//!@}
/*! @defgroup LTC4015_VIN_UVCL_ACTIVE_BF VIN_UVCL_ACTIVE_BF
 *  @ingroup LTC4015_register_map
 *  @brief VIN_UVCL_ACTIVE_BF Bit Field
 *
 *  Indicates the input undervoltage control loop is actively controlling power delivery based on VIN_UVCL_SETTING
 *   - Register: @ref LTC4015_CHARGE_STATUS "CHARGE_STATUS"
 *   - CommandCode: 53
 *   - Size: 1
 *   - Offset: 3
 *   - MSB: 3
 *   - MASK: 0x0008
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_VIN_UVCL_ACTIVE_BF_SUBADDR LTC4015_CHARGE_STATUS_SUBADDR //!< @ref LTC4015_VIN_UVCL_ACTIVE_BF "VIN_UVCL_ACTIVE_BF"
#define LTC4015_VIN_UVCL_ACTIVE_BF_SIZE 1
#define LTC4015_VIN_UVCL_ACTIVE_BF_OFFSET 3
#define LTC4015_VIN_UVCL_ACTIVE_BF_MASK 0x0008
#define LTC4015_VIN_UVCL_ACTIVE_BF (LTC4015_VIN_UVCL_ACTIVE_BF_OFFSET << 12 | (LTC4015_VIN_UVCL_ACTIVE_BF_SIZE - 1) << 8 | LTC4015_VIN_UVCL_ACTIVE_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_IIN_LIMIT_ACTIVE_BF IIN_LIMIT_ACTIVE_BF
 *  @ingroup LTC4015_register_map
 *  @brief IIN_LIMIT_ACTIVE_BF Bit Field
 *
 *  Indicates the input current limit control loop is actively controlling power delivery based on IIN_LIMIT[_DAC][_SETTING]
 *   - Register: @ref LTC4015_CHARGE_STATUS "CHARGE_STATUS"
 *   - CommandCode: 53
 *   - Size: 1
 *   - Offset: 2
 *   - MSB: 2
 *   - MASK: 0x0004
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_IIN_LIMIT_ACTIVE_BF_SUBADDR LTC4015_CHARGE_STATUS_SUBADDR //!< @ref LTC4015_IIN_LIMIT_ACTIVE_BF "IIN_LIMIT_ACTIVE_BF"
#define LTC4015_IIN_LIMIT_ACTIVE_BF_SIZE 1
#define LTC4015_IIN_LIMIT_ACTIVE_BF_OFFSET 2
#define LTC4015_IIN_LIMIT_ACTIVE_BF_MASK 0x0004
#define LTC4015_IIN_LIMIT_ACTIVE_BF (LTC4015_IIN_LIMIT_ACTIVE_BF_OFFSET << 12 | (LTC4015_IIN_LIMIT_ACTIVE_BF_SIZE - 1) << 8 | LTC4015_IIN_LIMIT_ACTIVE_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_CONSTANT_CURRENT_BF CONSTANT_CURRENT_BF
 *  @ingroup LTC4015_register_map
 *  @brief CONSTANT_CURRENT_BF Bit Field
 *
 *  Indicates the charge current control loop is actively controlling power delivery based on ICHARGE_DAC
 *   - Register: @ref LTC4015_CHARGE_STATUS "CHARGE_STATUS"
 *   - CommandCode: 53
 *   - Size: 1
 *   - Offset: 1
 *   - MSB: 1
 *   - MASK: 0x0002
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_CONSTANT_CURRENT_BF_SUBADDR LTC4015_CHARGE_STATUS_SUBADDR //!< @ref LTC4015_CONSTANT_CURRENT_BF "CONSTANT_CURRENT_BF"
#define LTC4015_CONSTANT_CURRENT_BF_SIZE 1
#define LTC4015_CONSTANT_CURRENT_BF_OFFSET 1
#define LTC4015_CONSTANT_CURRENT_BF_MASK 0x0002
#define LTC4015_CONSTANT_CURRENT_BF (LTC4015_CONSTANT_CURRENT_BF_OFFSET << 12 | (LTC4015_CONSTANT_CURRENT_BF_SIZE - 1) << 8 | LTC4015_CONSTANT_CURRENT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_CONSTANT_VOLTAGE_BF CONSTANT_VOLTAGE_BF
 *  @ingroup LTC4015_register_map
 *  @brief CONSTANT_VOLTAGE_BF Bit Field
 *
 *  Indicates the battery voltage control loop is actively controlling power delivery based on VCHARGE_DAC
 *   - Register: @ref LTC4015_CHARGE_STATUS "CHARGE_STATUS"
 *   - CommandCode: 53
 *   - Size: 1
 *   - Offset: 0
 *   - MSB: 0
 *   - MASK: 0x0001
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_CONSTANT_VOLTAGE_BF_SUBADDR LTC4015_CHARGE_STATUS_SUBADDR //!< @ref LTC4015_CONSTANT_VOLTAGE_BF "CONSTANT_VOLTAGE_BF"
#define LTC4015_CONSTANT_VOLTAGE_BF_SIZE 1
#define LTC4015_CONSTANT_VOLTAGE_BF_OFFSET 0
#define LTC4015_CONSTANT_VOLTAGE_BF_MASK 0x0001
#define LTC4015_CONSTANT_VOLTAGE_BF (LTC4015_CONSTANT_VOLTAGE_BF_OFFSET << 12 | (LTC4015_CONSTANT_VOLTAGE_BF_SIZE - 1) << 8 | LTC4015_CONSTANT_VOLTAGE_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_LIMIT_ALERTS LIMIT_ALERTS
 *  @ingroup LTC4015_register_map
 *  @brief LIMIT_ALERTS Register
 *
 * |                      15 |  14 |                 13 |                 12 |               11 |               10 |               9 |               8 |                7 |                6 |               5 |                4 |                    3 |               2 |                     1 |                     0 |
 * |:-----------------------:|:---:|:------------------:|:------------------:|:----------------:|:----------------:|:---------------:|:---------------:|:----------------:|:----------------:|:---------------:|:----------------:|:--------------------:|:---------------:|:---------------------:|:---------------------:|
 * | MEAS_SYS_VALID_ALERT_BF | n/a | QCOUNT_LO_ALERT_BF | QCOUNT_HI_ALERT_BF | VBAT_LO_ALERT_BF | VBAT_HI_ALERT_BF | VIN_LO_ALERT_BF | VIN_HI_ALERT_BF | VSYS_LO_ALERT_BF | VSYS_HI_ALERT_BF | IIN_HI_ALERT_BF | IBAT_LO_ALERT_BF | DIE_TEMP_HI_ALERT_BF | BSR_HI_ALERT_BF | NTC_RATIO_HI_ALERT_BF | NTC_RATIO_LO_ALERT_BF |
 *
 * Limit alert register.<br />Individual bits are enabled by EN_LIMIT_ALERTS.<br />Writing 0 to any bit clears that alert.<br />Once set, alert bits remain high until cleared or disabled.
 *   - CommandCode: 54
 *   - Contains Bit Fields:
 *     + @ref LTC4015_MEAS_SYS_VALID_ALERT_BF "MEAS_SYS_VALID_ALERT_BF" : Indicates that measurement system results have become valid.
 *     + @ref LTC4015_QCOUNT_LO_ALERT_BF "QCOUNT_LO_ALERT_BF" : Indicates QCOUNT has fallen below QCOUNT_LO_ALERT_LIMIT
 *     + @ref LTC4015_QCOUNT_HI_ALERT_BF "QCOUNT_HI_ALERT_BF" : Indicates QCOUNT has exceeded QCOUNT_HI_ALERT_LIMIT
 *     + @ref LTC4015_VBAT_LO_ALERT_BF "VBAT_LO_ALERT_BF" : Indicates VBAT has fallen below VBAT_LO_ALERT_LIMIT
 *     + @ref LTC4015_VBAT_HI_ALERT_BF "VBAT_HI_ALERT_BF" : Indicates VBAT has exceeded VBAT_HI_ALERT_LIMIT
 *     + @ref LTC4015_VIN_LO_ALERT_BF "VIN_LO_ALERT_BF" : Indicates VIN has fallen below VIN_LO_ALERT_LIMIT
 *     + @ref LTC4015_VIN_HI_ALERT_BF "VIN_HI_ALERT_BF" : Indicates VIN has exceeded VIN_HI_ALERT_LIMIT
 *     + @ref LTC4015_VSYS_LO_ALERT_BF "VSYS_LO_ALERT_BF" : Indicates VSYS has fallen below VSYS_LO_ALERT_LIMIT
 *     + @ref LTC4015_VSYS_HI_ALERT_BF "VSYS_HI_ALERT_BF" : Indicates VSYS has exceeded VSYS_HI_ALERT_LIMIT
 *     + @ref LTC4015_IIN_HI_ALERT_BF "IIN_HI_ALERT_BF" : Indicates IIN has exceeded IIN_HI_ALERT_LIMIT
 *     + @ref LTC4015_IBAT_LO_ALERT_BF "IBAT_LO_ALERT_BF" : Indicates IBAT has fallen below IBAT_LO_ALERT_LIMIT
 *     + @ref LTC4015_DIE_TEMP_HI_ALERT_BF "DIE_TEMP_HI_ALERT_BF" : Indicates DIE_TEMP has exceeded DIE_TEMP_HI_ALERT_LIMIT
 *     + @ref LTC4015_BSR_HI_ALERT_BF "BSR_HI_ALERT_BF" : Indicates BSR has exceeded BSR_HI_ALERT_LIMIT
 *     + @ref LTC4015_NTC_RATIO_HI_ALERT_BF "NTC_RATIO_HI_ALERT_BF" : Indicates NTC_RATIO has exceeded NTC_RATIO_HI_ALERT_LIMIT
 *     + @ref LTC4015_NTC_RATIO_LO_ALERT_BF "NTC_RATIO_LO_ALERT_BF" : Indicates NTC_RATIO has fallen below NTC_RATIO_LO_ALERT_LIMIT
*/

