YY-Edwards/STM32_USB-FS-Device_v4.1/mylib/DC2039A/LTC4015/LTC4015_reg_defs.h
//!@{
#define LTC4015_LIMIT_ALERTS_SUBADDR 54
#define LTC4015_LIMIT_ALERTS (0 << 12 | (16 - 1) << 8 | LTC4015_LIMIT_ALERTS_SUBADDR)
//!@}
/*! @defgroup LTC4015_MEAS_SYS_VALID_ALERT_BF MEAS_SYS_VALID_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief MEAS_SYS_VALID_ALERT_BF Bit Field
 *
 *  Indicates that measurement system results have become valid.
 *   - Register: @ref LTC4015_LIMIT_ALERTS "LIMIT_ALERTS"
 *   - CommandCode: 54
 *   - Size: 1
 *   - Offset: 15
 *   - MSB: 15
 *   - MASK: 0x8000
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_MEAS_SYS_VALID_ALERT_BF_SUBADDR LTC4015_LIMIT_ALERTS_SUBADDR //!< @ref LTC4015_MEAS_SYS_VALID_ALERT_BF "MEAS_SYS_VALID_ALERT_BF"
#define LTC4015_MEAS_SYS_VALID_ALERT_BF_SIZE 1
#define LTC4015_MEAS_SYS_VALID_ALERT_BF_OFFSET 15
#define LTC4015_MEAS_SYS_VALID_ALERT_BF_MASK 0x8000
#define LTC4015_MEAS_SYS_VALID_ALERT_BF (LTC4015_MEAS_SYS_VALID_ALERT_BF_OFFSET << 12 | (LTC4015_MEAS_SYS_VALID_ALERT_BF_SIZE - 1) << 8 | LTC4015_MEAS_SYS_VALID_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_QCOUNT_LO_ALERT_BF QCOUNT_LO_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief QCOUNT_LO_ALERT_BF Bit Field
 *
 *  Indicates QCOUNT has fallen below QCOUNT_LO_ALERT_LIMIT
 *   - Register: @ref LTC4015_LIMIT_ALERTS "LIMIT_ALERTS"
 *   - CommandCode: 54
 *   - Size: 1
 *   - Offset: 13
 *   - MSB: 13
 *   - MASK: 0x2000
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_QCOUNT_LO_ALERT_BF_SUBADDR LTC4015_LIMIT_ALERTS_SUBADDR //!< @ref LTC4015_QCOUNT_LO_ALERT_BF "QCOUNT_LO_ALERT_BF"
#define LTC4015_QCOUNT_LO_ALERT_BF_SIZE 1
#define LTC4015_QCOUNT_LO_ALERT_BF_OFFSET 13
#define LTC4015_QCOUNT_LO_ALERT_BF_MASK 0x2000
#define LTC4015_QCOUNT_LO_ALERT_BF (LTC4015_QCOUNT_LO_ALERT_BF_OFFSET << 12 | (LTC4015_QCOUNT_LO_ALERT_BF_SIZE - 1) << 8 | LTC4015_QCOUNT_LO_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_QCOUNT_HI_ALERT_BF QCOUNT_HI_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief QCOUNT_HI_ALERT_BF Bit Field
 *
 *  Indicates QCOUNT has exceeded QCOUNT_HI_ALERT_LIMIT
 *   - Register: @ref LTC4015_LIMIT_ALERTS "LIMIT_ALERTS"
 *   - CommandCode: 54
 *   - Size: 1
 *   - Offset: 12
 *   - MSB: 12
 *   - MASK: 0x1000
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_QCOUNT_HI_ALERT_BF_SUBADDR LTC4015_LIMIT_ALERTS_SUBADDR //!< @ref LTC4015_QCOUNT_HI_ALERT_BF "QCOUNT_HI_ALERT_BF"
#define LTC4015_QCOUNT_HI_ALERT_BF_SIZE 1
#define LTC4015_QCOUNT_HI_ALERT_BF_OFFSET 12
#define LTC4015_QCOUNT_HI_ALERT_BF_MASK 0x1000
#define LTC4015_QCOUNT_HI_ALERT_BF (LTC4015_QCOUNT_HI_ALERT_BF_OFFSET << 12 | (LTC4015_QCOUNT_HI_ALERT_BF_SIZE - 1) << 8 | LTC4015_QCOUNT_HI_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_VBAT_LO_ALERT_BF VBAT_LO_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief VBAT_LO_ALERT_BF Bit Field
 *
 *  Indicates VBAT has fallen below VBAT_LO_ALERT_LIMIT
 *   - Register: @ref LTC4015_LIMIT_ALERTS "LIMIT_ALERTS"
 *   - CommandCode: 54
 *   - Size: 1
 *   - Offset: 11
 *   - MSB: 11
 *   - MASK: 0x0800
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_VBAT_LO_ALERT_BF_SUBADDR LTC4015_LIMIT_ALERTS_SUBADDR //!< @ref LTC4015_VBAT_LO_ALERT_BF "VBAT_LO_ALERT_BF"
#define LTC4015_VBAT_LO_ALERT_BF_SIZE 1
#define LTC4015_VBAT_LO_ALERT_BF_OFFSET 11
#define LTC4015_VBAT_LO_ALERT_BF_MASK 0x0800
#define LTC4015_VBAT_LO_ALERT_BF (LTC4015_VBAT_LO_ALERT_BF_OFFSET << 12 | (LTC4015_VBAT_LO_ALERT_BF_SIZE - 1) << 8 | LTC4015_VBAT_LO_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_VBAT_HI_ALERT_BF VBAT_HI_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief VBAT_HI_ALERT_BF Bit Field
 *
 *  Indicates VBAT has exceeded VBAT_HI_ALERT_LIMIT
 *   - Register: @ref LTC4015_LIMIT_ALERTS "LIMIT_ALERTS"
 *   - CommandCode: 54
 *   - Size: 1
 *   - Offset: 10
 *   - MSB: 10
 *   - MASK: 0x0400
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_VBAT_HI_ALERT_BF_SUBADDR LTC4015_LIMIT_ALERTS_SUBADDR //!< @ref LTC4015_VBAT_HI_ALERT_BF "VBAT_HI_ALERT_BF"
#define LTC4015_VBAT_HI_ALERT_BF_SIZE 1
#define LTC4015_VBAT_HI_ALERT_BF_OFFSET 10
#define LTC4015_VBAT_HI_ALERT_BF_MASK 0x0400
#define LTC4015_VBAT_HI_ALERT_BF (LTC4015_VBAT_HI_ALERT_BF_OFFSET << 12 | (LTC4015_VBAT_HI_ALERT_BF_SIZE - 1) << 8 | LTC4015_VBAT_HI_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_VIN_LO_ALERT_BF VIN_LO_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief VIN_LO_ALERT_BF Bit Field
 *
 *  Indicates VIN has fallen below VIN_LO_ALERT_LIMIT
 *   - Register: @ref LTC4015_LIMIT_ALERTS "LIMIT_ALERTS"
 *   - CommandCode: 54
 *   - Size: 1
 *   - Offset: 9
 *   - MSB: 9
 *   - MASK: 0x0200
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_VIN_LO_ALERT_BF_SUBADDR LTC4015_LIMIT_ALERTS_SUBADDR //!< @ref LTC4015_VIN_LO_ALERT_BF "VIN_LO_ALERT_BF"
#define LTC4015_VIN_LO_ALERT_BF_SIZE 1
#define LTC4015_VIN_LO_ALERT_BF_OFFSET 9
#define LTC4015_VIN_LO_ALERT_BF_MASK 0x0200
#define LTC4015_VIN_LO_ALERT_BF (LTC4015_VIN_LO_ALERT_BF_OFFSET << 12 | (LTC4015_VIN_LO_ALERT_BF_SIZE - 1) << 8 | LTC4015_VIN_LO_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_VIN_HI_ALERT_BF VIN_HI_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief VIN_HI_ALERT_BF Bit Field
 *
 *  Indicates VIN has exceeded VIN_HI_ALERT_LIMIT
 *   - Register: @ref LTC4015_LIMIT_ALERTS "LIMIT_ALERTS"
 *   - CommandCode: 54
 *   - Size: 1
 *   - Offset: 8
 *   - MSB: 8
 *   - MASK: 0x0100
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_VIN_HI_ALERT_BF_SUBADDR LTC4015_LIMIT_ALERTS_SUBADDR //!< @ref LTC4015_VIN_HI_ALERT_BF "VIN_HI_ALERT_BF"
#define LTC4015_VIN_HI_ALERT_BF_SIZE 1
#define LTC4015_VIN_HI_ALERT_BF_OFFSET 8
#define LTC4015_VIN_HI_ALERT_BF_MASK 0x0100
#define LTC4015_VIN_HI_ALERT_BF (LTC4015_VIN_HI_ALERT_BF_OFFSET << 12 | (LTC4015_VIN_HI_ALERT_BF_SIZE - 1) << 8 | LTC4015_VIN_HI_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_VSYS_LO_ALERT_BF VSYS_LO_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief VSYS_LO_ALERT_BF Bit Field
 *
 *  Indicates VSYS has fallen below VSYS_LO_ALERT_LIMIT
 *   - Register: @ref LTC4015_LIMIT_ALERTS "LIMIT_ALERTS"
 *   - CommandCode: 54
 *   - Size: 1
 *   - Offset: 7
 *   - MSB: 7
 *   - MASK: 0x0080
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_VSYS_LO_ALERT_BF_SUBADDR LTC4015_LIMIT_ALERTS_SUBADDR //!< @ref LTC4015_VSYS_LO_ALERT_BF "VSYS_LO_ALERT_BF"
#define LTC4015_VSYS_LO_ALERT_BF_SIZE 1
#define LTC4015_VSYS_LO_ALERT_BF_OFFSET 7
#define LTC4015_VSYS_LO_ALERT_BF_MASK 0x0080
#define LTC4015_VSYS_LO_ALERT_BF (LTC4015_VSYS_LO_ALERT_BF_OFFSET << 12 | (LTC4015_VSYS_LO_ALERT_BF_SIZE - 1) << 8 | LTC4015_VSYS_LO_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_VSYS_HI_ALERT_BF VSYS_HI_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief VSYS_HI_ALERT_BF Bit Field
 *
 *  Indicates VSYS has exceeded VSYS_HI_ALERT_LIMIT
 *   - Register: @ref LTC4015_LIMIT_ALERTS "LIMIT_ALERTS"
 *   - CommandCode: 54
 *   - Size: 1
 *   - Offset: 6
 *   - MSB: 6
 *   - MASK: 0x0040
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_VSYS_HI_ALERT_BF_SUBADDR LTC4015_LIMIT_ALERTS_SUBADDR //!< @ref LTC4015_VSYS_HI_ALERT_BF "VSYS_HI_ALERT_BF"
#define LTC4015_VSYS_HI_ALERT_BF_SIZE 1
#define LTC4015_VSYS_HI_ALERT_BF_OFFSET 6
#define LTC4015_VSYS_HI_ALERT_BF_MASK 0x0040
#define LTC4015_VSYS_HI_ALERT_BF (LTC4015_VSYS_HI_ALERT_BF_OFFSET << 12 | (LTC4015_VSYS_HI_ALERT_BF_SIZE - 1) << 8 | LTC4015_VSYS_HI_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_IIN_HI_ALERT_BF IIN_HI_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief IIN_HI_ALERT_BF Bit Field
 *
 *  Indicates IIN has exceeded IIN_HI_ALERT_LIMIT
 *   - Register: @ref LTC4015_LIMIT_ALERTS "LIMIT_ALERTS"
 *   - CommandCode: 54
 *   - Size: 1
 *   - Offset: 5
 *   - MSB: 5
 *   - MASK: 0x0020
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_IIN_HI_ALERT_BF_SUBADDR LTC4015_LIMIT_ALERTS_SUBADDR //!< @ref LTC4015_IIN_HI_ALERT_BF "IIN_HI_ALERT_BF"
#define LTC4015_IIN_HI_ALERT_BF_SIZE 1
#define LTC4015_IIN_HI_ALERT_BF_OFFSET 5
#define LTC4015_IIN_HI_ALERT_BF_MASK 0x0020
#define LTC4015_IIN_HI_ALERT_BF (LTC4015_IIN_HI_ALERT_BF_OFFSET << 12 | (LTC4015_IIN_HI_ALERT_BF_SIZE - 1) << 8 | LTC4015_IIN_HI_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_IBAT_LO_ALERT_BF IBAT_LO_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief IBAT_LO_ALERT_BF Bit Field
 *
 *  Indicates IBAT has fallen below IBAT_LO_ALERT_LIMIT
 *   - Register: @ref LTC4015_LIMIT_ALERTS "LIMIT_ALERTS"
 *   - CommandCode: 54
 *   - Size: 1
 *   - Offset: 4
 *   - MSB: 4
 *   - MASK: 0x0010
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_IBAT_LO_ALERT_BF_SUBADDR LTC4015_LIMIT_ALERTS_SUBADDR //!< @ref LTC4015_IBAT_LO_ALERT_BF "IBAT_LO_ALERT_BF"
#define LTC4015_IBAT_LO_ALERT_BF_SIZE 1
#define LTC4015_IBAT_LO_ALERT_BF_OFFSET 4
#define LTC4015_IBAT_LO_ALERT_BF_MASK 0x0010
#define LTC4015_IBAT_LO_ALERT_BF (LTC4015_IBAT_LO_ALERT_BF_OFFSET << 12 | (LTC4015_IBAT_LO_ALERT_BF_SIZE - 1) << 8 | LTC4015_IBAT_LO_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_DIE_TEMP_HI_ALERT_BF DIE_TEMP_HI_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief DIE_TEMP_HI_ALERT_BF Bit Field
 *
 *  Indicates DIE_TEMP has exceeded DIE_TEMP_HI_ALERT_LIMIT
 *   - Register: @ref LTC4015_LIMIT_ALERTS "LIMIT_ALERTS"
 *   - CommandCode: 54
 *   - Size: 1
 *   - Offset: 3
 *   - MSB: 3
 *   - MASK: 0x0008
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_DIE_TEMP_HI_ALERT_BF_SUBADDR LTC4015_LIMIT_ALERTS_SUBADDR //!< @ref LTC4015_DIE_TEMP_HI_ALERT_BF "DIE_TEMP_HI_ALERT_BF"
#define LTC4015_DIE_TEMP_HI_ALERT_BF_SIZE 1
#define LTC4015_DIE_TEMP_HI_ALERT_BF_OFFSET 3
#define LTC4015_DIE_TEMP_HI_ALERT_BF_MASK 0x0008
#define LTC4015_DIE_TEMP_HI_ALERT_BF (LTC4015_DIE_TEMP_HI_ALERT_BF_OFFSET << 12 | (LTC4015_DIE_TEMP_HI_ALERT_BF_SIZE - 1) << 8 | LTC4015_DIE_TEMP_HI_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_BSR_HI_ALERT_BF BSR_HI_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief BSR_HI_ALERT_BF Bit Field
 *
 *  Indicates BSR has exceeded BSR_HI_ALERT_LIMIT
 *   - Register: @ref LTC4015_LIMIT_ALERTS "LIMIT_ALERTS"
 *   - CommandCode: 54
 *   - Size: 1
 *   - Offset: 2
 *   - MSB: 2
 *   - MASK: 0x0004
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_BSR_HI_ALERT_BF_SUBADDR LTC4015_LIMIT_ALERTS_SUBADDR //!< @ref LTC4015_BSR_HI_ALERT_BF "BSR_HI_ALERT_BF"
#define LTC4015_BSR_HI_ALERT_BF_SIZE 1
#define LTC4015_BSR_HI_ALERT_BF_OFFSET 2
#define LTC4015_BSR_HI_ALERT_BF_MASK 0x0004
#define LTC4015_BSR_HI_ALERT_BF (LTC4015_BSR_HI_ALERT_BF_OFFSET << 12 | (LTC4015_BSR_HI_ALERT_BF_SIZE - 1) << 8 | LTC4015_BSR_HI_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_NTC_RATIO_HI_ALERT_BF NTC_RATIO_HI_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief NTC_RATIO_HI_ALERT_BF Bit Field
 *
 *  Indicates NTC_RATIO has exceeded NTC_RATIO_HI_ALERT_LIMIT
 *   - Register: @ref LTC4015_LIMIT_ALERTS "LIMIT_ALERTS"
 *   - CommandCode: 54
 *   - Size: 1
 *   - Offset: 1
 *   - MSB: 1
 *   - MASK: 0x0002
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_NTC_RATIO_HI_ALERT_BF_SUBADDR LTC4015_LIMIT_ALERTS_SUBADDR //!< @ref LTC4015_NTC_RATIO_HI_ALERT_BF "NTC_RATIO_HI_ALERT_BF"
#define LTC4015_NTC_RATIO_HI_ALERT_BF_SIZE 1
#define LTC4015_NTC_RATIO_HI_ALERT_BF_OFFSET 1
#define LTC4015_NTC_RATIO_HI_ALERT_BF_MASK 0x0002
#define LTC4015_NTC_RATIO_HI_ALERT_BF (LTC4015_NTC_RATIO_HI_ALERT_BF_OFFSET << 12 | (LTC4015_NTC_RATIO_HI_ALERT_BF_SIZE - 1) << 8 | LTC4015_NTC_RATIO_HI_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_NTC_RATIO_LO_ALERT_BF NTC_RATIO_LO_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief NTC_RATIO_LO_ALERT_BF Bit Field
 *
 *  Indicates NTC_RATIO has fallen below NTC_RATIO_LO_ALERT_LIMIT
 *   - Register: @ref LTC4015_LIMIT_ALERTS "LIMIT_ALERTS"
 *   - CommandCode: 54
 *   - Size: 1
 *   - Offset: 0
 *   - MSB: 0
 *   - MASK: 0x0001
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_NTC_RATIO_LO_ALERT_BF_SUBADDR LTC4015_LIMIT_ALERTS_SUBADDR //!< @ref LTC4015_NTC_RATIO_LO_ALERT_BF "NTC_RATIO_LO_ALERT_BF"
#define LTC4015_NTC_RATIO_LO_ALERT_BF_SIZE 1
#define LTC4015_NTC_RATIO_LO_ALERT_BF_OFFSET 0
#define LTC4015_NTC_RATIO_LO_ALERT_BF_MASK 0x0001
#define LTC4015_NTC_RATIO_LO_ALERT_BF (LTC4015_NTC_RATIO_LO_ALERT_BF_OFFSET << 12 | (LTC4015_NTC_RATIO_LO_ALERT_BF_SIZE - 1) << 8 | LTC4015_NTC_RATIO_LO_ALERT_BF_SUBADDR)
//!@}

