YY-Edwards/STM32_USB-FS-Device_v4.1/mylib/DC2039A/LTC4015/LTC4015_reg_defs.h
/*! @defgroup LTC4015_CHARGER_STATE_ALERTS CHARGER_STATE_ALERTS
 *  @ingroup LTC4015_register_map
 *  @brief CHARGER_STATE_ALERTS Register
 *
 * | 15:11 |                       10 |                      9 |                          8 |                  7 |                     6 |                  5 |                   4 |                      3 |                              2 |                          1 |                        0 |
 * |:-----:|:------------------------:|:----------------------:|:--------------------------:|:------------------:|:---------------------:|:------------------:|:-------------------:|:----------------------:|:------------------------------:|:--------------------------:|:------------------------:|
 * |   n/a | EQUALIZE_CHARGE_ALERT_BF | ABSORB_CHARGE_ALERT_BF | CHARGER_SUSPENDED_ALERT_BF | PRECHARGE_ALERT_BF | CC_CV_CHARGE_ALERT_BF | NTC_PAUSE_ALERT_BF | TIMER_TERM_ALERT_BF | C_OVER_X_TERM_ALERT_BF | MAX_CHARGE_TIME_FAULT_ALERT_BF | BAT_MISSING_FAULT_ALERT_BF | BAT_SHORT_FAULT_ALERT_BF |
 *
 * Indicates that charger states have occurred.<br />Individual bits are enabled by EN_CHARGER_STATE_ALERTS.<br />Writing 1 to any bit clears that alert.<br />Once set, alert bits remain high until cleared or disabled.
 *   - CommandCode: 55
 *   - Contains Bit Fields:
 *     + @ref LTC4015_EQUALIZE_CHARGE_ALERT_BF "EQUALIZE_CHARGE_ALERT_BF" : Alert indicates charger has entered equalize charge state
 *     + @ref LTC4015_ABSORB_CHARGE_ALERT_BF "ABSORB_CHARGE_ALERT_BF" : Alert indicates charger has entered absorb charge state
 *     + @ref LTC4015_CHARGER_SUSPENDED_ALERT_BF "CHARGER_SUSPENDED_ALERT_BF" : Alert indicates charger has been suspended
 *     + @ref LTC4015_PRECHARGE_ALERT_BF "PRECHARGE_ALERT_BF" : Alert indicates charger has entered preconditioning charge state
 *     + @ref LTC4015_CC_CV_CHARGE_ALERT_BF "CC_CV_CHARGE_ALERT_BF" : Alert indicates charger has entered CC-CV charge state
 *     + @ref LTC4015_NTC_PAUSE_ALERT_BF "NTC_PAUSE_ALERT_BF" : Alert indicates charger has entered thermistor pause state
 *     + @ref LTC4015_TIMER_TERM_ALERT_BF "TIMER_TERM_ALERT_BF" : Alert indicates timer termination has occurred
 *     + @ref LTC4015_C_OVER_X_TERM_ALERT_BF "C_OVER_X_TERM_ALERT_BF" : Alert indicates C/x termination has occurred
 *     + @ref LTC4015_MAX_CHARGE_TIME_FAULT_ALERT_BF "MAX_CHARGE_TIME_FAULT_ALERT_BF" : Alert indicates charger has entered max_charge_time_fault state
 *     + @ref LTC4015_BAT_MISSING_FAULT_ALERT_BF "BAT_MISSING_FAULT_ALERT_BF" : Alert indicates battery missing fault has occurred
 *     + @ref LTC4015_BAT_SHORT_FAULT_ALERT_BF "BAT_SHORT_FAULT_ALERT_BF" : Alert indicates battery short fault has occurred
*/

//!@{
#define LTC4015_CHARGER_STATE_ALERTS_SUBADDR 55
#define LTC4015_CHARGER_STATE_ALERTS (0 << 12 | (16 - 1) << 8 | LTC4015_CHARGER_STATE_ALERTS_SUBADDR)
//!@}
/*! @defgroup LTC4015_EQUALIZE_CHARGE_ALERT_BF EQUALIZE_CHARGE_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief EQUALIZE_CHARGE_ALERT_BF Bit Field
 *
 *  Alert indicates charger has entered equalize charge state
 *   - Register: @ref LTC4015_CHARGER_STATE_ALERTS "CHARGER_STATE_ALERTS"
 *   - CommandCode: 55
 *   - Size: 1
 *   - Offset: 10
 *   - MSB: 10
 *   - MASK: 0x0400
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_EQUALIZE_CHARGE_ALERT_BF_SUBADDR LTC4015_CHARGER_STATE_ALERTS_SUBADDR //!< @ref LTC4015_EQUALIZE_CHARGE_ALERT_BF "EQUALIZE_CHARGE_ALERT_BF"
#define LTC4015_EQUALIZE_CHARGE_ALERT_BF_SIZE 1
#define LTC4015_EQUALIZE_CHARGE_ALERT_BF_OFFSET 10
#define LTC4015_EQUALIZE_CHARGE_ALERT_BF_MASK 0x0400
#define LTC4015_EQUALIZE_CHARGE_ALERT_BF (LTC4015_EQUALIZE_CHARGE_ALERT_BF_OFFSET << 12 | (LTC4015_EQUALIZE_CHARGE_ALERT_BF_SIZE - 1) << 8 | LTC4015_EQUALIZE_CHARGE_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_ABSORB_CHARGE_ALERT_BF ABSORB_CHARGE_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief ABSORB_CHARGE_ALERT_BF Bit Field
 *
 *  Alert indicates charger has entered absorb charge state
 *   - Register: @ref LTC4015_CHARGER_STATE_ALERTS "CHARGER_STATE_ALERTS"
 *   - CommandCode: 55
 *   - Size: 1
 *   - Offset: 9
 *   - MSB: 9
 *   - MASK: 0x0200
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_ABSORB_CHARGE_ALERT_BF_SUBADDR LTC4015_CHARGER_STATE_ALERTS_SUBADDR //!< @ref LTC4015_ABSORB_CHARGE_ALERT_BF "ABSORB_CHARGE_ALERT_BF"
#define LTC4015_ABSORB_CHARGE_ALERT_BF_SIZE 1
#define LTC4015_ABSORB_CHARGE_ALERT_BF_OFFSET 9
#define LTC4015_ABSORB_CHARGE_ALERT_BF_MASK 0x0200
#define LTC4015_ABSORB_CHARGE_ALERT_BF (LTC4015_ABSORB_CHARGE_ALERT_BF_OFFSET << 12 | (LTC4015_ABSORB_CHARGE_ALERT_BF_SIZE - 1) << 8 | LTC4015_ABSORB_CHARGE_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_CHARGER_SUSPENDED_ALERT_BF CHARGER_SUSPENDED_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief CHARGER_SUSPENDED_ALERT_BF Bit Field
 *
 *  Alert indicates charger has been suspended
 *   - Register: @ref LTC4015_CHARGER_STATE_ALERTS "CHARGER_STATE_ALERTS"
 *   - CommandCode: 55
 *   - Size: 1
 *   - Offset: 8
 *   - MSB: 8
 *   - MASK: 0x0100
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_CHARGER_SUSPENDED_ALERT_BF_SUBADDR LTC4015_CHARGER_STATE_ALERTS_SUBADDR //!< @ref LTC4015_CHARGER_SUSPENDED_ALERT_BF "CHARGER_SUSPENDED_ALERT_BF"
#define LTC4015_CHARGER_SUSPENDED_ALERT_BF_SIZE 1
#define LTC4015_CHARGER_SUSPENDED_ALERT_BF_OFFSET 8
#define LTC4015_CHARGER_SUSPENDED_ALERT_BF_MASK 0x0100
#define LTC4015_CHARGER_SUSPENDED_ALERT_BF (LTC4015_CHARGER_SUSPENDED_ALERT_BF_OFFSET << 12 | (LTC4015_CHARGER_SUSPENDED_ALERT_BF_SIZE - 1) << 8 | LTC4015_CHARGER_SUSPENDED_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_PRECHARGE_ALERT_BF PRECHARGE_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief PRECHARGE_ALERT_BF Bit Field
 *
 *  Alert indicates charger has entered preconditioning charge state
 *   - Register: @ref LTC4015_CHARGER_STATE_ALERTS "CHARGER_STATE_ALERTS"
 *   - CommandCode: 55
 *   - Size: 1
 *   - Offset: 7
 *   - MSB: 7
 *   - MASK: 0x0080
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_PRECHARGE_ALERT_BF_SUBADDR LTC4015_CHARGER_STATE_ALERTS_SUBADDR //!< @ref LTC4015_PRECHARGE_ALERT_BF "PRECHARGE_ALERT_BF"
#define LTC4015_PRECHARGE_ALERT_BF_SIZE 1
#define LTC4015_PRECHARGE_ALERT_BF_OFFSET 7
#define LTC4015_PRECHARGE_ALERT_BF_MASK 0x0080
#define LTC4015_PRECHARGE_ALERT_BF (LTC4015_PRECHARGE_ALERT_BF_OFFSET << 12 | (LTC4015_PRECHARGE_ALERT_BF_SIZE - 1) << 8 | LTC4015_PRECHARGE_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_CC_CV_CHARGE_ALERT_BF CC_CV_CHARGE_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief CC_CV_CHARGE_ALERT_BF Bit Field
 *
 *  Alert indicates charger has entered CC-CV charge state
 *   - Register: @ref LTC4015_CHARGER_STATE_ALERTS "CHARGER_STATE_ALERTS"
 *   - CommandCode: 55
 *   - Size: 1
 *   - Offset: 6
 *   - MSB: 6
 *   - MASK: 0x0040
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_CC_CV_CHARGE_ALERT_BF_SUBADDR LTC4015_CHARGER_STATE_ALERTS_SUBADDR //!< @ref LTC4015_CC_CV_CHARGE_ALERT_BF "CC_CV_CHARGE_ALERT_BF"
#define LTC4015_CC_CV_CHARGE_ALERT_BF_SIZE 1
#define LTC4015_CC_CV_CHARGE_ALERT_BF_OFFSET 6
#define LTC4015_CC_CV_CHARGE_ALERT_BF_MASK 0x0040
#define LTC4015_CC_CV_CHARGE_ALERT_BF (LTC4015_CC_CV_CHARGE_ALERT_BF_OFFSET << 12 | (LTC4015_CC_CV_CHARGE_ALERT_BF_SIZE - 1) << 8 | LTC4015_CC_CV_CHARGE_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_NTC_PAUSE_ALERT_BF NTC_PAUSE_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief NTC_PAUSE_ALERT_BF Bit Field
 *
 *  Alert indicates charger has entered thermistor pause state
 *   - Register: @ref LTC4015_CHARGER_STATE_ALERTS "CHARGER_STATE_ALERTS"
 *   - CommandCode: 55
 *   - Size: 1
 *   - Offset: 5
 *   - MSB: 5
 *   - MASK: 0x0020
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_NTC_PAUSE_ALERT_BF_SUBADDR LTC4015_CHARGER_STATE_ALERTS_SUBADDR //!< @ref LTC4015_NTC_PAUSE_ALERT_BF "NTC_PAUSE_ALERT_BF"
#define LTC4015_NTC_PAUSE_ALERT_BF_SIZE 1
#define LTC4015_NTC_PAUSE_ALERT_BF_OFFSET 5
#define LTC4015_NTC_PAUSE_ALERT_BF_MASK 0x0020
#define LTC4015_NTC_PAUSE_ALERT_BF (LTC4015_NTC_PAUSE_ALERT_BF_OFFSET << 12 | (LTC4015_NTC_PAUSE_ALERT_BF_SIZE - 1) << 8 | LTC4015_NTC_PAUSE_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_TIMER_TERM_ALERT_BF TIMER_TERM_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief TIMER_TERM_ALERT_BF Bit Field
 *
 *  Alert indicates timer termination has occurred
 *   - Register: @ref LTC4015_CHARGER_STATE_ALERTS "CHARGER_STATE_ALERTS"
 *   - CommandCode: 55
 *   - Size: 1
 *   - Offset: 4
 *   - MSB: 4
 *   - MASK: 0x0010
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_TIMER_TERM_ALERT_BF_SUBADDR LTC4015_CHARGER_STATE_ALERTS_SUBADDR //!< @ref LTC4015_TIMER_TERM_ALERT_BF "TIMER_TERM_ALERT_BF"
#define LTC4015_TIMER_TERM_ALERT_BF_SIZE 1
#define LTC4015_TIMER_TERM_ALERT_BF_OFFSET 4
#define LTC4015_TIMER_TERM_ALERT_BF_MASK 0x0010
#define LTC4015_TIMER_TERM_ALERT_BF (LTC4015_TIMER_TERM_ALERT_BF_OFFSET << 12 | (LTC4015_TIMER_TERM_ALERT_BF_SIZE - 1) << 8 | LTC4015_TIMER_TERM_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_C_OVER_X_TERM_ALERT_BF C_OVER_X_TERM_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief C_OVER_X_TERM_ALERT_BF Bit Field
 *
 *  Alert indicates C/x termination has occurred
 *   - Register: @ref LTC4015_CHARGER_STATE_ALERTS "CHARGER_STATE_ALERTS"
 *   - CommandCode: 55
 *   - Size: 1
 *   - Offset: 3
 *   - MSB: 3
 *   - MASK: 0x0008
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_C_OVER_X_TERM_ALERT_BF_SUBADDR LTC4015_CHARGER_STATE_ALERTS_SUBADDR //!< @ref LTC4015_C_OVER_X_TERM_ALERT_BF "C_OVER_X_TERM_ALERT_BF"
#define LTC4015_C_OVER_X_TERM_ALERT_BF_SIZE 1
#define LTC4015_C_OVER_X_TERM_ALERT_BF_OFFSET 3
#define LTC4015_C_OVER_X_TERM_ALERT_BF_MASK 0x0008
#define LTC4015_C_OVER_X_TERM_ALERT_BF (LTC4015_C_OVER_X_TERM_ALERT_BF_OFFSET << 12 | (LTC4015_C_OVER_X_TERM_ALERT_BF_SIZE - 1) << 8 | LTC4015_C_OVER_X_TERM_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_MAX_CHARGE_TIME_FAULT_ALERT_BF MAX_CHARGE_TIME_FAULT_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief MAX_CHARGE_TIME_FAULT_ALERT_BF Bit Field
 *
 *  Alert indicates charger has entered max_charge_time_fault state
 *   - Register: @ref LTC4015_CHARGER_STATE_ALERTS "CHARGER_STATE_ALERTS"
 *   - CommandCode: 55
 *   - Size: 1
 *   - Offset: 2
 *   - MSB: 2
 *   - MASK: 0x0004
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_MAX_CHARGE_TIME_FAULT_ALERT_BF_SUBADDR LTC4015_CHARGER_STATE_ALERTS_SUBADDR //!< @ref LTC4015_MAX_CHARGE_TIME_FAULT_ALERT_BF "MAX_CHARGE_TIME_FAULT_ALERT_BF"
#define LTC4015_MAX_CHARGE_TIME_FAULT_ALERT_BF_SIZE 1
#define LTC4015_MAX_CHARGE_TIME_FAULT_ALERT_BF_OFFSET 2
#define LTC4015_MAX_CHARGE_TIME_FAULT_ALERT_BF_MASK 0x0004
#define LTC4015_MAX_CHARGE_TIME_FAULT_ALERT_BF (LTC4015_MAX_CHARGE_TIME_FAULT_ALERT_BF_OFFSET << 12 | (LTC4015_MAX_CHARGE_TIME_FAULT_ALERT_BF_SIZE - 1) << 8 | LTC4015_MAX_CHARGE_TIME_FAULT_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_BAT_MISSING_FAULT_ALERT_BF BAT_MISSING_FAULT_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief BAT_MISSING_FAULT_ALERT_BF Bit Field
 *
 *  Alert indicates battery missing fault has occurred
 *   - Register: @ref LTC4015_CHARGER_STATE_ALERTS "CHARGER_STATE_ALERTS"
 *   - CommandCode: 55
 *   - Size: 1
 *   - Offset: 1
 *   - MSB: 1
 *   - MASK: 0x0002
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_BAT_MISSING_FAULT_ALERT_BF_SUBADDR LTC4015_CHARGER_STATE_ALERTS_SUBADDR //!< @ref LTC4015_BAT_MISSING_FAULT_ALERT_BF "BAT_MISSING_FAULT_ALERT_BF"
#define LTC4015_BAT_MISSING_FAULT_ALERT_BF_SIZE 1
#define LTC4015_BAT_MISSING_FAULT_ALERT_BF_OFFSET 1
#define LTC4015_BAT_MISSING_FAULT_ALERT_BF_MASK 0x0002
#define LTC4015_BAT_MISSING_FAULT_ALERT_BF (LTC4015_BAT_MISSING_FAULT_ALERT_BF_OFFSET << 12 | (LTC4015_BAT_MISSING_FAULT_ALERT_BF_SIZE - 1) << 8 | LTC4015_BAT_MISSING_FAULT_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_BAT_SHORT_FAULT_ALERT_BF BAT_SHORT_FAULT_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief BAT_SHORT_FAULT_ALERT_BF Bit Field
 *
 *  Alert indicates battery short fault has occurred
 *   - Register: @ref LTC4015_CHARGER_STATE_ALERTS "CHARGER_STATE_ALERTS"
 *   - CommandCode: 55
 *   - Size: 1
 *   - Offset: 0
 *   - MSB: 0
 *   - MASK: 0x0001
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_BAT_SHORT_FAULT_ALERT_BF_SUBADDR LTC4015_CHARGER_STATE_ALERTS_SUBADDR //!< @ref LTC4015_BAT_SHORT_FAULT_ALERT_BF "BAT_SHORT_FAULT_ALERT_BF"
#define LTC4015_BAT_SHORT_FAULT_ALERT_BF_SIZE 1
#define LTC4015_BAT_SHORT_FAULT_ALERT_BF_OFFSET 0
#define LTC4015_BAT_SHORT_FAULT_ALERT_BF_MASK 0x0001
#define LTC4015_BAT_SHORT_FAULT_ALERT_BF (LTC4015_BAT_SHORT_FAULT_ALERT_BF_OFFSET << 12 | (LTC4015_BAT_SHORT_FAULT_ALERT_BF_SIZE - 1) << 8 | LTC4015_BAT_SHORT_FAULT_ALERT_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_CHARGE_STATUS_ALERTS CHARGE_STATUS_ALERTS
 *  @ingroup LTC4015_register_map
 *  @brief CHARGE_STATUS_ALERTS Register
 *
 * | 15:4 |                        3 |                         2 |                         1 |                         0 |
 * |:----:|:------------------------:|:-------------------------:|:-------------------------:|:-------------------------:|
 * |  n/a | VIN_UVCL_ACTIVE_ALERT_BF | IIN_LIMIT_ACTIVE_ALERT_BF | CONSTANT_CURRENT_ALERT_BF | CONSTANT_VOLTAGE_ALERT_BF |
 *
 * Alerts that CHARGE_STATUS indicators have occurred.<br />Individual bits are enabled by EN_CHARGE_STATUS_ALERTS.<br />Writing 1 to any bit clears that alert.<br />Once set, alert bits remain high until cleared or disabled.
 *   - CommandCode: 56
 *   - Contains Bit Fields:
 *     + @ref LTC4015_VIN_UVCL_ACTIVE_ALERT_BF "VIN_UVCL_ACTIVE_ALERT_BF" : Alert indicates that vin_uvcl_active has occurred
 *     + @ref LTC4015_IIN_LIMIT_ACTIVE_ALERT_BF "IIN_LIMIT_ACTIVE_ALERT_BF" : Alert indicates iin_limit_active has occurred
 *     + @ref LTC4015_CONSTANT_CURRENT_ALERT_BF "CONSTANT_CURRENT_ALERT_BF" : Alert indicates constant_current has occurred
 *     + @ref LTC4015_CONSTANT_VOLTAGE_ALERT_BF "CONSTANT_VOLTAGE_ALERT_BF" : Alert indicates constant_voltage has occurred
*/

//!@{
#define LTC4015_CHARGE_STATUS_ALERTS_SUBADDR 56
#define LTC4015_CHARGE_STATUS_ALERTS (0 << 12 | (16 - 1) << 8 | LTC4015_CHARGE_STATUS_ALERTS_SUBADDR)
//!@}
/*! @defgroup LTC4015_VIN_UVCL_ACTIVE_ALERT_BF VIN_UVCL_ACTIVE_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief VIN_UVCL_ACTIVE_ALERT_BF Bit Field
 *
 *  Alert indicates that vin_uvcl_active has occurred
 *   - Register: @ref LTC4015_CHARGE_STATUS_ALERTS "CHARGE_STATUS_ALERTS"
 *   - CommandCode: 56
 *   - Size: 1
 *   - Offset: 3
 *   - MSB: 3
 *   - MASK: 0x0008
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_VIN_UVCL_ACTIVE_ALERT_BF_SUBADDR LTC4015_CHARGE_STATUS_ALERTS_SUBADDR //!< @ref LTC4015_VIN_UVCL_ACTIVE_ALERT_BF "VIN_UVCL_ACTIVE_ALERT_BF"
#define LTC4015_VIN_UVCL_ACTIVE_ALERT_BF_SIZE 1
#define LTC4015_VIN_UVCL_ACTIVE_ALERT_BF_OFFSET 3
#define LTC4015_VIN_UVCL_ACTIVE_ALERT_BF_MASK 0x0008
#define LTC4015_VIN_UVCL_ACTIVE_ALERT_BF (LTC4015_VIN_UVCL_ACTIVE_ALERT_BF_OFFSET << 12 | (LTC4015_VIN_UVCL_ACTIVE_ALERT_BF_SIZE - 1) << 8 | LTC4015_VIN_UVCL_ACTIVE_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_IIN_LIMIT_ACTIVE_ALERT_BF IIN_LIMIT_ACTIVE_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief IIN_LIMIT_ACTIVE_ALERT_BF Bit Field
 *
 *  Alert indicates iin_limit_active has occurred
 *   - Register: @ref LTC4015_CHARGE_STATUS_ALERTS "CHARGE_STATUS_ALERTS"
 *   - CommandCode: 56
 *   - Size: 1
 *   - Offset: 2
 *   - MSB: 2
 *   - MASK: 0x0004
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_IIN_LIMIT_ACTIVE_ALERT_BF_SUBADDR LTC4015_CHARGE_STATUS_ALERTS_SUBADDR //!< @ref LTC4015_IIN_LIMIT_ACTIVE_ALERT_BF "IIN_LIMIT_ACTIVE_ALERT_BF"
#define LTC4015_IIN_LIMIT_ACTIVE_ALERT_BF_SIZE 1
#define LTC4015_IIN_LIMIT_ACTIVE_ALERT_BF_OFFSET 2
#define LTC4015_IIN_LIMIT_ACTIVE_ALERT_BF_MASK 0x0004
#define LTC4015_IIN_LIMIT_ACTIVE_ALERT_BF (LTC4015_IIN_LIMIT_ACTIVE_ALERT_BF_OFFSET << 12 | (LTC4015_IIN_LIMIT_ACTIVE_ALERT_BF_SIZE - 1) << 8 | LTC4015_IIN_LIMIT_ACTIVE_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_CONSTANT_CURRENT_ALERT_BF CONSTANT_CURRENT_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief CONSTANT_CURRENT_ALERT_BF Bit Field
 *
 *  Alert indicates constant_current has occurred
 *   - Register: @ref LTC4015_CHARGE_STATUS_ALERTS "CHARGE_STATUS_ALERTS"
 *   - CommandCode: 56
 *   - Size: 1
 *   - Offset: 1
 *   - MSB: 1
 *   - MASK: 0x0002
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_CONSTANT_CURRENT_ALERT_BF_SUBADDR LTC4015_CHARGE_STATUS_ALERTS_SUBADDR //!< @ref LTC4015_CONSTANT_CURRENT_ALERT_BF "CONSTANT_CURRENT_ALERT_BF"
#define LTC4015_CONSTANT_CURRENT_ALERT_BF_SIZE 1
#define LTC4015_CONSTANT_CURRENT_ALERT_BF_OFFSET 1
#define LTC4015_CONSTANT_CURRENT_ALERT_BF_MASK 0x0002
#define LTC4015_CONSTANT_CURRENT_ALERT_BF (LTC4015_CONSTANT_CURRENT_ALERT_BF_OFFSET << 12 | (LTC4015_CONSTANT_CURRENT_ALERT_BF_SIZE - 1) << 8 | LTC4015_CONSTANT_CURRENT_ALERT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_CONSTANT_VOLTAGE_ALERT_BF CONSTANT_VOLTAGE_ALERT_BF
 *  @ingroup LTC4015_register_map
 *  @brief CONSTANT_VOLTAGE_ALERT_BF Bit Field
 *
 *  Alert indicates constant_voltage has occurred
 *   - Register: @ref LTC4015_CHARGE_STATUS_ALERTS "CHARGE_STATUS_ALERTS"
 *   - CommandCode: 56
 *   - Size: 1
 *   - Offset: 0
 *   - MSB: 0
 *   - MASK: 0x0001
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_CONSTANT_VOLTAGE_ALERT_BF_SUBADDR LTC4015_CHARGE_STATUS_ALERTS_SUBADDR //!< @ref LTC4015_CONSTANT_VOLTAGE_ALERT_BF "CONSTANT_VOLTAGE_ALERT_BF"
#define LTC4015_CONSTANT_VOLTAGE_ALERT_BF_SIZE 1
#define LTC4015_CONSTANT_VOLTAGE_ALERT_BF_OFFSET 0
#define LTC4015_CONSTANT_VOLTAGE_ALERT_BF_MASK 0x0001
#define LTC4015_CONSTANT_VOLTAGE_ALERT_BF (LTC4015_CONSTANT_VOLTAGE_ALERT_BF_OFFSET << 12 | (LTC4015_CONSTANT_VOLTAGE_ALERT_BF_SIZE - 1) << 8 | LTC4015_CONSTANT_VOLTAGE_ALERT_BF_SUBADDR)
//!@}

