YY-Edwards/STM32_USB-FS-Device_v4.1/mylib/DC2039A/LTC4015/LTC4015_reg_defs.h
/*! @defgroup LTC4015_SYSTEM_STATUS SYSTEM_STATUS
 *  @ingroup LTC4015_register_map
 *  @brief SYSTEM_STATUS Register
 *
 * | 15:14 |                 13 |  12 |             11 |              10 |             9 |                   8 |   7 |               6 |        5 |                   4 |           3 |              2 |                 1 |                 0 |
 * |:-----:|:------------------:|:---:|:--------------:|:---------------:|:-------------:|:-------------------:|:---:|:---------------:|:--------:|:-------------------:|:-----------:|:--------------:|:-----------------:|:-----------------:|
 * |   n/a | CHARGER_ENABLED_BF | n/a | MPPT_EN_PIN_BF | EQUALIZE_REQ_BF | DRVCC_GOOD_BF | CELL_COUNT_ERROR_BF | n/a | OK_TO_CHARGE_BF | NO_RT_BF | THERMAL_SHUTDOWN_BF | VIN_OVLO_BF | VIN_GT_VBAT_BF | INTVCC_GT_4P3V_BF | INTVCC_GT_2P8V_BF |
 *
 * Real time system status indicator bits
 *   - CommandCode: 57
 *   - Contains Bit Fields:
 *     + @ref LTC4015_CHARGER_ENABLED_BF "CHARGER_ENABLED_BF" : Indicates that the battery charger is active
 *     + @ref LTC4015_MPPT_EN_PIN_BF "MPPT_EN_PIN_BF" : Indicates the MPPT pin is set to enable Maximum Power Point Tracking
 *     + @ref LTC4015_EQUALIZE_REQ_BF "EQUALIZE_REQ_BF" : Indicates a rising edge has been detected at the EQ pin, and an equalize charge is queued
 *     + @ref LTC4015_DRVCC_GOOD_BF "DRVCC_GOOD_BF" : Indicates DRVCC voltage is above switching regulator undervoltage lockout level (4.3V typ)
 *     + @ref LTC4015_CELL_COUNT_ERROR_BF "CELL_COUNT_ERROR_BF" : Indicates an invalid combination of CELLS pin settings
 *     + @ref LTC4015_OK_TO_CHARGE_BF "OK_TO_CHARGE_BF" : Indicates all system conditions are met to allow battery charger operation.
 *     + @ref LTC4015_NO_RT_BF "NO_RT_BF" : Indicates no resistor has been detected at the RT pin
 *     + @ref LTC4015_THERMAL_SHUTDOWN_BF "THERMAL_SHUTDOWN_BF" : Indicates die temperature is greater than thermal shutdown level (160C typical)
 *     + @ref LTC4015_VIN_OVLO_BF "VIN_OVLO_BF" : Indicates VIN voltage is greater than overvoltage lockout level (38.6V typical)
 *     + @ref LTC4015_VIN_GT_VBAT_BF "VIN_GT_VBAT_BF" : Indicates VIN voltage is sufficiently greater than BATSENSE for switching regulator operation (200mV typical)
 *     + @ref LTC4015_INTVCC_GT_4P3V_BF "INTVCC_GT_4P3V_BF" : Indicates INTVCC voltage is above switching regulator undervoltage lockout level (4.3V typ)
 *     + @ref LTC4015_INTVCC_GT_2P8V_BF "INTVCC_GT_2P8V_BF" : Indicates INTVCC voltage is greater than measurement system lockout level (2.8V typical)
*/

//!@{
#define LTC4015_SYSTEM_STATUS_SUBADDR 57
#define LTC4015_SYSTEM_STATUS (0 << 12 | (16 - 1) << 8 | LTC4015_SYSTEM_STATUS_SUBADDR)
//!@}
/*! @defgroup LTC4015_CHARGER_ENABLED_BF CHARGER_ENABLED_BF
 *  @ingroup LTC4015_register_map
 *  @brief CHARGER_ENABLED_BF Bit Field
 *
 *  Indicates that the battery charger is active
 *   - Register: @ref LTC4015_SYSTEM_STATUS "SYSTEM_STATUS"
 *   - CommandCode: 57
 *   - Size: 1
 *   - Offset: 13
 *   - MSB: 13
 *   - MASK: 0x2000
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_CHARGER_ENABLED_BF_SUBADDR LTC4015_SYSTEM_STATUS_SUBADDR //!< @ref LTC4015_CHARGER_ENABLED_BF "CHARGER_ENABLED_BF"
#define LTC4015_CHARGER_ENABLED_BF_SIZE 1
#define LTC4015_CHARGER_ENABLED_BF_OFFSET 13
#define LTC4015_CHARGER_ENABLED_BF_MASK 0x2000
#define LTC4015_CHARGER_ENABLED_BF (LTC4015_CHARGER_ENABLED_BF_OFFSET << 12 | (LTC4015_CHARGER_ENABLED_BF_SIZE - 1) << 8 | LTC4015_CHARGER_ENABLED_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_MPPT_EN_PIN_BF MPPT_EN_PIN_BF
 *  @ingroup LTC4015_register_map
 *  @brief MPPT_EN_PIN_BF Bit Field
 *
 *  Indicates the MPPT pin is set to enable Maximum Power Point Tracking
 *   - Register: @ref LTC4015_SYSTEM_STATUS "SYSTEM_STATUS"
 *   - CommandCode: 57
 *   - Size: 1
 *   - Offset: 11
 *   - MSB: 11
 *   - MASK: 0x0800
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_MPPT_EN_PIN_BF_SUBADDR LTC4015_SYSTEM_STATUS_SUBADDR //!< @ref LTC4015_MPPT_EN_PIN_BF "MPPT_EN_PIN_BF"
#define LTC4015_MPPT_EN_PIN_BF_SIZE 1
#define LTC4015_MPPT_EN_PIN_BF_OFFSET 11
#define LTC4015_MPPT_EN_PIN_BF_MASK 0x0800
#define LTC4015_MPPT_EN_PIN_BF (LTC4015_MPPT_EN_PIN_BF_OFFSET << 12 | (LTC4015_MPPT_EN_PIN_BF_SIZE - 1) << 8 | LTC4015_MPPT_EN_PIN_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_EQUALIZE_REQ_BF EQUALIZE_REQ_BF
 *  @ingroup LTC4015_register_map
 *  @brief EQUALIZE_REQ_BF Bit Field
 *
 *  Indicates a rising edge has been detected at the EQ pin, and an equalize charge is queued
 *   - Register: @ref LTC4015_SYSTEM_STATUS "SYSTEM_STATUS"
 *   - CommandCode: 57
 *   - Size: 1
 *   - Offset: 10
 *   - MSB: 10
 *   - MASK: 0x0400
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_EQUALIZE_REQ_BF_SUBADDR LTC4015_SYSTEM_STATUS_SUBADDR //!< @ref LTC4015_EQUALIZE_REQ_BF "EQUALIZE_REQ_BF"
#define LTC4015_EQUALIZE_REQ_BF_SIZE 1
#define LTC4015_EQUALIZE_REQ_BF_OFFSET 10
#define LTC4015_EQUALIZE_REQ_BF_MASK 0x0400
#define LTC4015_EQUALIZE_REQ_BF (LTC4015_EQUALIZE_REQ_BF_OFFSET << 12 | (LTC4015_EQUALIZE_REQ_BF_SIZE - 1) << 8 | LTC4015_EQUALIZE_REQ_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_DRVCC_GOOD_BF DRVCC_GOOD_BF
 *  @ingroup LTC4015_register_map
 *  @brief DRVCC_GOOD_BF Bit Field
 *
 *  Indicates DRVCC voltage is above switching regulator undervoltage lockout level (4.3V typ)
 *   - Register: @ref LTC4015_SYSTEM_STATUS "SYSTEM_STATUS"
 *   - CommandCode: 57
 *   - Size: 1
 *   - Offset: 9
 *   - MSB: 9
 *   - MASK: 0x0200
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_DRVCC_GOOD_BF_SUBADDR LTC4015_SYSTEM_STATUS_SUBADDR //!< @ref LTC4015_DRVCC_GOOD_BF "DRVCC_GOOD_BF"
#define LTC4015_DRVCC_GOOD_BF_SIZE 1
#define LTC4015_DRVCC_GOOD_BF_OFFSET 9
#define LTC4015_DRVCC_GOOD_BF_MASK 0x0200
#define LTC4015_DRVCC_GOOD_BF (LTC4015_DRVCC_GOOD_BF_OFFSET << 12 | (LTC4015_DRVCC_GOOD_BF_SIZE - 1) << 8 | LTC4015_DRVCC_GOOD_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_CELL_COUNT_ERROR_BF CELL_COUNT_ERROR_BF
 *  @ingroup LTC4015_register_map
 *  @brief CELL_COUNT_ERROR_BF Bit Field
 *
 *  Indicates an invalid combination of CELLS pin settings
 *   - Register: @ref LTC4015_SYSTEM_STATUS "SYSTEM_STATUS"
 *   - CommandCode: 57
 *   - Size: 1
 *   - Offset: 8
 *   - MSB: 8
 *   - MASK: 0x0100
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_CELL_COUNT_ERROR_BF_SUBADDR LTC4015_SYSTEM_STATUS_SUBADDR //!< @ref LTC4015_CELL_COUNT_ERROR_BF "CELL_COUNT_ERROR_BF"
#define LTC4015_CELL_COUNT_ERROR_BF_SIZE 1
#define LTC4015_CELL_COUNT_ERROR_BF_OFFSET 8
#define LTC4015_CELL_COUNT_ERROR_BF_MASK 0x0100
#define LTC4015_CELL_COUNT_ERROR_BF (LTC4015_CELL_COUNT_ERROR_BF_OFFSET << 12 | (LTC4015_CELL_COUNT_ERROR_BF_SIZE - 1) << 8 | LTC4015_CELL_COUNT_ERROR_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_OK_TO_CHARGE_BF OK_TO_CHARGE_BF
 *  @ingroup LTC4015_register_map
 *  @brief OK_TO_CHARGE_BF Bit Field
 *
 *  Indicates all system conditions are met to allow battery charger operation.
 *   - Register: @ref LTC4015_SYSTEM_STATUS "SYSTEM_STATUS"
 *   - CommandCode: 57
 *   - Size: 1
 *   - Offset: 6
 *   - MSB: 6
 *   - MASK: 0x0040
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_OK_TO_CHARGE_BF_SUBADDR LTC4015_SYSTEM_STATUS_SUBADDR //!< @ref LTC4015_OK_TO_CHARGE_BF "OK_TO_CHARGE_BF"
#define LTC4015_OK_TO_CHARGE_BF_SIZE 1
#define LTC4015_OK_TO_CHARGE_BF_OFFSET 6
#define LTC4015_OK_TO_CHARGE_BF_MASK 0x0040
#define LTC4015_OK_TO_CHARGE_BF (LTC4015_OK_TO_CHARGE_BF_OFFSET << 12 | (LTC4015_OK_TO_CHARGE_BF_SIZE - 1) << 8 | LTC4015_OK_TO_CHARGE_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_NO_RT_BF NO_RT_BF
 *  @ingroup LTC4015_register_map
 *  @brief NO_RT_BF Bit Field
 *
 *  Indicates no resistor has been detected at the RT pin
 *   - Register: @ref LTC4015_SYSTEM_STATUS "SYSTEM_STATUS"
 *   - CommandCode: 57
 *   - Size: 1
 *   - Offset: 5
 *   - MSB: 5
 *   - MASK: 0x0020
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_NO_RT_BF_SUBADDR LTC4015_SYSTEM_STATUS_SUBADDR //!< @ref LTC4015_NO_RT_BF "NO_RT_BF"
#define LTC4015_NO_RT_BF_SIZE 1
#define LTC4015_NO_RT_BF_OFFSET 5
#define LTC4015_NO_RT_BF_MASK 0x0020
#define LTC4015_NO_RT_BF (LTC4015_NO_RT_BF_OFFSET << 12 | (LTC4015_NO_RT_BF_SIZE - 1) << 8 | LTC4015_NO_RT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_THERMAL_SHUTDOWN_BF THERMAL_SHUTDOWN_BF
 *  @ingroup LTC4015_register_map
 *  @brief THERMAL_SHUTDOWN_BF Bit Field
 *
 *  Indicates die temperature is greater than thermal shutdown level (160C typical)
 *   - Register: @ref LTC4015_SYSTEM_STATUS "SYSTEM_STATUS"
 *   - CommandCode: 57
 *   - Size: 1
 *   - Offset: 4
 *   - MSB: 4
 *   - MASK: 0x0010
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_THERMAL_SHUTDOWN_BF_SUBADDR LTC4015_SYSTEM_STATUS_SUBADDR //!< @ref LTC4015_THERMAL_SHUTDOWN_BF "THERMAL_SHUTDOWN_BF"
#define LTC4015_THERMAL_SHUTDOWN_BF_SIZE 1
#define LTC4015_THERMAL_SHUTDOWN_BF_OFFSET 4
#define LTC4015_THERMAL_SHUTDOWN_BF_MASK 0x0010
#define LTC4015_THERMAL_SHUTDOWN_BF (LTC4015_THERMAL_SHUTDOWN_BF_OFFSET << 12 | (LTC4015_THERMAL_SHUTDOWN_BF_SIZE - 1) << 8 | LTC4015_THERMAL_SHUTDOWN_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_VIN_OVLO_BF VIN_OVLO_BF
 *  @ingroup LTC4015_register_map
 *  @brief VIN_OVLO_BF Bit Field
 *
 *  Indicates VIN voltage is greater than overvoltage lockout level (38.6V typical)
 *   - Register: @ref LTC4015_SYSTEM_STATUS "SYSTEM_STATUS"
 *   - CommandCode: 57
 *   - Size: 1
 *   - Offset: 3
 *   - MSB: 3
 *   - MASK: 0x0008
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_VIN_OVLO_BF_SUBADDR LTC4015_SYSTEM_STATUS_SUBADDR //!< @ref LTC4015_VIN_OVLO_BF "VIN_OVLO_BF"
#define LTC4015_VIN_OVLO_BF_SIZE 1
#define LTC4015_VIN_OVLO_BF_OFFSET 3
#define LTC4015_VIN_OVLO_BF_MASK 0x0008
#define LTC4015_VIN_OVLO_BF (LTC4015_VIN_OVLO_BF_OFFSET << 12 | (LTC4015_VIN_OVLO_BF_SIZE - 1) << 8 | LTC4015_VIN_OVLO_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_VIN_GT_VBAT_BF VIN_GT_VBAT_BF
 *  @ingroup LTC4015_register_map
 *  @brief VIN_GT_VBAT_BF Bit Field
 *
 *  Indicates VIN voltage is sufficiently greater than BATSENSE for switching regulator operation (200mV typical)
 *   - Register: @ref LTC4015_SYSTEM_STATUS "SYSTEM_STATUS"
 *   - CommandCode: 57
 *   - Size: 1
 *   - Offset: 2
 *   - MSB: 2
 *   - MASK: 0x0004
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_VIN_GT_VBAT_BF_SUBADDR LTC4015_SYSTEM_STATUS_SUBADDR //!< @ref LTC4015_VIN_GT_VBAT_BF "VIN_GT_VBAT_BF"
#define LTC4015_VIN_GT_VBAT_BF_SIZE 1
#define LTC4015_VIN_GT_VBAT_BF_OFFSET 2
#define LTC4015_VIN_GT_VBAT_BF_MASK 0x0004
#define LTC4015_VIN_GT_VBAT_BF (LTC4015_VIN_GT_VBAT_BF_OFFSET << 12 | (LTC4015_VIN_GT_VBAT_BF_SIZE - 1) << 8 | LTC4015_VIN_GT_VBAT_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_INTVCC_GT_4P3V_BF INTVCC_GT_4P3V_BF
 *  @ingroup LTC4015_register_map
 *  @brief INTVCC_GT_4P3V_BF Bit Field
 *
 *  Indicates INTVCC voltage is above switching regulator undervoltage lockout level (4.3V typ)
 *   - Register: @ref LTC4015_SYSTEM_STATUS "SYSTEM_STATUS"
 *   - CommandCode: 57
 *   - Size: 1
 *   - Offset: 1
 *   - MSB: 1
 *   - MASK: 0x0002
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_INTVCC_GT_4P3V_BF_SUBADDR LTC4015_SYSTEM_STATUS_SUBADDR //!< @ref LTC4015_INTVCC_GT_4P3V_BF "INTVCC_GT_4P3V_BF"
#define LTC4015_INTVCC_GT_4P3V_BF_SIZE 1
#define LTC4015_INTVCC_GT_4P3V_BF_OFFSET 1
#define LTC4015_INTVCC_GT_4P3V_BF_MASK 0x0002
#define LTC4015_INTVCC_GT_4P3V_BF (LTC4015_INTVCC_GT_4P3V_BF_OFFSET << 12 | (LTC4015_INTVCC_GT_4P3V_BF_SIZE - 1) << 8 | LTC4015_INTVCC_GT_4P3V_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_INTVCC_GT_2P8V_BF INTVCC_GT_2P8V_BF
 *  @ingroup LTC4015_register_map
 *  @brief INTVCC_GT_2P8V_BF Bit Field
 *
 *  Indicates INTVCC voltage is greater than measurement system lockout level (2.8V typical)
 *   - Register: @ref LTC4015_SYSTEM_STATUS "SYSTEM_STATUS"
 *   - CommandCode: 57
 *   - Size: 1
 *   - Offset: 0
 *   - MSB: 0
 *   - MASK: 0x0001
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_INTVCC_GT_2P8V_BF_SUBADDR LTC4015_SYSTEM_STATUS_SUBADDR //!< @ref LTC4015_INTVCC_GT_2P8V_BF "INTVCC_GT_2P8V_BF"
#define LTC4015_INTVCC_GT_2P8V_BF_SIZE 1
#define LTC4015_INTVCC_GT_2P8V_BF_OFFSET 0
#define LTC4015_INTVCC_GT_2P8V_BF_MASK 0x0001
#define LTC4015_INTVCC_GT_2P8V_BF (LTC4015_INTVCC_GT_2P8V_BF_OFFSET << 12 | (LTC4015_INTVCC_GT_2P8V_BF_SIZE - 1) << 8 | LTC4015_INTVCC_GT_2P8V_BF_SUBADDR)
//!@}

