YY-Edwards/STM32_USB-FS-Device_v4.1/mylib/DC2039A/LTC4015/LTC4015_reg_defs.h
/*! @defgroup LTC4015_VBAT VBAT
 *  @ingroup LTC4015_register_map
 *  @brief VBAT Register
 *
 * |    15:0 |
 * |:-------:|
 * | VBAT_BF |
 *
 *   - CommandCode: 58
 *   - Contains Bit Fields:
 *     + @ref LTC4015_VBAT_BF "VBAT_BF" : VBATSENS/cellcount = [VBAT] • 192.264μV for lithium chemistries.
				VBATSENS/cellcount = [VBAT] • 128.176μV for lead-acid.
*/

//!@{
#define LTC4015_VBAT_SUBADDR 58
#define LTC4015_VBAT (0 << 12 | (16 - 1) << 8 | LTC4015_VBAT_SUBADDR)
//!@}
/*! @defgroup LTC4015_VBAT_BF VBAT_BF
 *  @ingroup LTC4015_register_map
 *  @brief VBAT_BF Bit Field
 *
 *  VBATSENS/cellcount = [VBAT] • 192.264μV for lithium chemistries.
				VBATSENS/cellcount = [VBAT] • 128.176μV for lead-acid.
 *   - Register: @ref LTC4015_VBAT "VBAT"
 *   - CommandCode: 58
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_VBAT_BF_SUBADDR LTC4015_VBAT_SUBADDR //!< @ref LTC4015_VBAT_BF "VBAT_BF"
#define LTC4015_VBAT_BF_SIZE 16
#define LTC4015_VBAT_BF_OFFSET 0
#define LTC4015_VBAT_BF_MASK 0xFFFF
#define LTC4015_VBAT_BF (LTC4015_VBAT_BF_OFFSET << 12 | (LTC4015_VBAT_BF_SIZE - 1) << 8 | LTC4015_VBAT_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_VIN VIN
 *  @ingroup LTC4015_register_map
 *  @brief VIN Register
 *
 * |   15:0 |
 * |:------:|
 * | VIN_BF |
 *
 *   - CommandCode: 59
 *   - Contains Bit Fields:
 *     + @ref LTC4015_VIN_BF "VIN_BF" : Two's complement ADC measurement result for VIN. VVIN = [VIN] • 1.648mV
*/

//!@{
#define LTC4015_VIN_SUBADDR 59
#define LTC4015_VIN (0 << 12 | (16 - 1) << 8 | LTC4015_VIN_SUBADDR)
//!@}
/*! @defgroup LTC4015_VIN_BF VIN_BF
 *  @ingroup LTC4015_register_map
 *  @brief VIN_BF Bit Field
 *
 *  Two's complement ADC measurement result for VIN. VVIN = [VIN] • 1.648mV
 *   - Register: @ref LTC4015_VIN "VIN"
 *   - CommandCode: 59
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_VIN_BF_SUBADDR LTC4015_VIN_SUBADDR //!< @ref LTC4015_VIN_BF "VIN_BF"
#define LTC4015_VIN_BF_SIZE 16
#define LTC4015_VIN_BF_OFFSET 0
#define LTC4015_VIN_BF_MASK 0xFFFF
#define LTC4015_VIN_BF (LTC4015_VIN_BF_OFFSET << 12 | (LTC4015_VIN_BF_SIZE - 1) << 8 | LTC4015_VIN_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_VSYS VSYS
 *  @ingroup LTC4015_register_map
 *  @brief VSYS Register
 *
 * |    15:0 |
 * |:-------:|
 * | VSYS_BF |
 *
 *   - CommandCode: 60
 *   - Contains Bit Fields:
 *     + @ref LTC4015_VSYS_BF "VSYS_BF" : Two's complement ADC measurement result for VSYS. VSYS = [VSYS] • 1.648mV
*/

//!@{
#define LTC4015_VSYS_SUBADDR 60
#define LTC4015_VSYS (0 << 12 | (16 - 1) << 8 | LTC4015_VSYS_SUBADDR)
//!@}
/*! @defgroup LTC4015_VSYS_BF VSYS_BF
 *  @ingroup LTC4015_register_map
 *  @brief VSYS_BF Bit Field
 *
 *  Two's complement ADC measurement result for VSYS. VSYS = [VSYS] • 1.648mV
 *   - Register: @ref LTC4015_VSYS "VSYS"
 *   - CommandCode: 60
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_VSYS_BF_SUBADDR LTC4015_VSYS_SUBADDR //!< @ref LTC4015_VSYS_BF "VSYS_BF"
#define LTC4015_VSYS_BF_SIZE 16
#define LTC4015_VSYS_BF_OFFSET 0
#define LTC4015_VSYS_BF_MASK 0xFFFF
#define LTC4015_VSYS_BF (LTC4015_VSYS_BF_OFFSET << 12 | (LTC4015_VSYS_BF_SIZE - 1) << 8 | LTC4015_VSYS_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_IBAT IBAT
 *  @ingroup LTC4015_register_map
 *  @brief IBAT Register
 *
 * |    15:0 |
 * |:-------:|
 * | IBAT_BF |
 *
 *   - CommandCode: 61
 *   - Contains Bit Fields:
 *     + @ref LTC4015_IBAT_BF "IBAT_BF" : Two's complement ADC measurement result for battery charge current. Battery current = [IBAT] • 1.46487μV/RSNSB
*/

//!@{
#define LTC4015_IBAT_SUBADDR 61
#define LTC4015_IBAT (0 << 12 | (16 - 1) << 8 | LTC4015_IBAT_SUBADDR)
//!@}
/*! @defgroup LTC4015_IBAT_BF IBAT_BF
 *  @ingroup LTC4015_register_map
 *  @brief IBAT_BF Bit Field
 *
 *  Two's complement ADC measurement result for battery charge current. Battery current = [IBAT] • 1.46487μV/RSNSB
 *   - Register: @ref LTC4015_IBAT "IBAT"
 *   - CommandCode: 61
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_IBAT_BF_SUBADDR LTC4015_IBAT_SUBADDR //!< @ref LTC4015_IBAT_BF "IBAT_BF"
#define LTC4015_IBAT_BF_SIZE 16
#define LTC4015_IBAT_BF_OFFSET 0
#define LTC4015_IBAT_BF_MASK 0xFFFF
#define LTC4015_IBAT_BF (LTC4015_IBAT_BF_OFFSET << 12 | (LTC4015_IBAT_BF_SIZE - 1) << 8 | LTC4015_IBAT_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_IIN IIN
 *  @ingroup LTC4015_register_map
 *  @brief IIN Register
 *
 * |   15:0 |
 * |:------:|
 * | IIN_BF |
 *
 *   - CommandCode: 62
 *   - Contains Bit Fields:
 *     + @ref LTC4015_IIN_BF "IIN_BF" : Two's complement ADC measurement result for (VCLP – VCLN). Input current = [IIN] • 1.46487μV/RSNSI * [18204][682656])
*/

//!@{
#define LTC4015_IIN_SUBADDR 62
#define LTC4015_IIN (0 << 12 | (16 - 1) << 8 | LTC4015_IIN_SUBADDR)
//!@}
/*! @defgroup LTC4015_IIN_BF IIN_BF
 *  @ingroup LTC4015_register_map
 *  @brief IIN_BF Bit Field
 *
 *  Two's complement ADC measurement result for (VCLP – VCLN). Input current = [IIN] • 1.46487μV/RSNSI * [18204][682656])
 *   - Register: @ref LTC4015_IIN "IIN"
 *   - CommandCode: 62
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_IIN_BF_SUBADDR LTC4015_IIN_SUBADDR //!< @ref LTC4015_IIN_BF "IIN_BF"
#define LTC4015_IIN_BF_SIZE 16
#define LTC4015_IIN_BF_OFFSET 0
#define LTC4015_IIN_BF_MASK 0xFFFF
#define LTC4015_IIN_BF (LTC4015_IIN_BF_OFFSET << 12 | (LTC4015_IIN_BF_SIZE - 1) << 8 | LTC4015_IIN_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_DIE_TEMP DIE_TEMP
 *  @ingroup LTC4015_register_map
 *  @brief DIE_TEMP Register
 *
 * |        15:0 |
 * |:-----------:|
 * | DIE_TEMP_BF |
 *
 *   - CommandCode: 63
 *   - Contains Bit Fields:
 *     + @ref LTC4015_DIE_TEMP_BF "DIE_TEMP_BF" : Two's complement ADC measurement result for die temperature. Temperature = (DIE_TEMP – 12010)/45.6°C
*/

//!@{
#define LTC4015_DIE_TEMP_SUBADDR 63
#define LTC4015_DIE_TEMP (0 << 12 | (16 - 1) << 8 | LTC4015_DIE_TEMP_SUBADDR)
//!@}
/*! @defgroup LTC4015_DIE_TEMP_BF DIE_TEMP_BF
 *  @ingroup LTC4015_register_map
 *  @brief DIE_TEMP_BF Bit Field
 *
 *  Two's complement ADC measurement result for die temperature. Temperature = (DIE_TEMP – 12010)/45.6°C
 *   - Register: @ref LTC4015_DIE_TEMP "DIE_TEMP"
 *   - CommandCode: 63
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_DIE_TEMP_BF_SUBADDR LTC4015_DIE_TEMP_SUBADDR //!< @ref LTC4015_DIE_TEMP_BF "DIE_TEMP_BF"
#define LTC4015_DIE_TEMP_BF_SIZE 16
#define LTC4015_DIE_TEMP_BF_OFFSET 0
#define LTC4015_DIE_TEMP_BF_MASK 0xFFFF
#define LTC4015_DIE_TEMP_BF (LTC4015_DIE_TEMP_BF_OFFSET << 12 | (LTC4015_DIE_TEMP_BF_SIZE - 1) << 8 | LTC4015_DIE_TEMP_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_NTC_RATIO NTC_RATIO
 *  @ingroup LTC4015_register_map
 *  @brief NTC_RATIO Register
 *
 * |         15:0 |
 * |:------------:|
 * | NTC_RATIO_BF |
 *
 *   - CommandCode: 64
 *   - Contains Bit Fields:
 *     + @ref LTC4015_NTC_RATIO_BF "NTC_RATIO_BF" : ADC measurement result for NTC thermistor ratio. R<sub>NTC</sub> = NTC_RATIO * R<sub>NTCBIAS</sub> / (21845 - NTC_RATIO)
*/

//!@{
#define LTC4015_NTC_RATIO_SUBADDR 64
#define LTC4015_NTC_RATIO (0 << 12 | (16 - 1) << 8 | LTC4015_NTC_RATIO_SUBADDR)
//!@}
/*! @defgroup LTC4015_NTC_RATIO_BF NTC_RATIO_BF
 *  @ingroup LTC4015_register_map
 *  @brief NTC_RATIO_BF Bit Field
 *
 *  ADC measurement result for NTC thermistor ratio. R<sub>NTC</sub> = NTC_RATIO * R<sub>NTCBIAS</sub> / (21845 - NTC_RATIO)
 *   - Register: @ref LTC4015_NTC_RATIO "NTC_RATIO"
 *   - CommandCode: 64
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_NTC_RATIO_BF_SUBADDR LTC4015_NTC_RATIO_SUBADDR //!< @ref LTC4015_NTC_RATIO_BF "NTC_RATIO_BF"
#define LTC4015_NTC_RATIO_BF_SIZE 16
#define LTC4015_NTC_RATIO_BF_OFFSET 0
#define LTC4015_NTC_RATIO_BF_MASK 0xFFFF
#define LTC4015_NTC_RATIO_BF (LTC4015_NTC_RATIO_BF_OFFSET << 12 | (LTC4015_NTC_RATIO_BF_SIZE - 1) << 8 | LTC4015_NTC_RATIO_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_BSR BSR
 *  @ingroup LTC4015_register_map
 *  @brief BSR Register
 *
 * |   15:0 |
 * |:------:|
 * | BSR_BF |
 *
 *   - CommandCode: 65
 *   - Contains Bit Fields:
 *     + @ref LTC4015_BSR_BF "BSR_BF" : Calculated battery series resistance.  Series resistance = BSR * R<sub>PROG</sub> / 500
*/

//!@{
#define LTC4015_BSR_SUBADDR 65
#define LTC4015_BSR (0 << 12 | (16 - 1) << 8 | LTC4015_BSR_SUBADDR)
//!@}
/*! @defgroup LTC4015_BSR_BF BSR_BF
 *  @ingroup LTC4015_register_map
 *  @brief BSR_BF Bit Field
 *
 *  Calculated battery series resistance.  Series resistance = BSR * R<sub>PROG</sub> / 500
 *   - Register: @ref LTC4015_BSR "BSR"
 *   - CommandCode: 65
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_BSR_BF_SUBADDR LTC4015_BSR_SUBADDR //!< @ref LTC4015_BSR_BF "BSR_BF"
#define LTC4015_BSR_BF_SIZE 16
#define LTC4015_BSR_BF_OFFSET 0
#define LTC4015_BSR_BF_MASK 0xFFFF
#define LTC4015_BSR_BF (LTC4015_BSR_BF_OFFSET << 12 | (LTC4015_BSR_BF_SIZE - 1) << 8 | LTC4015_BSR_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_JEITA_REGION JEITA_REGION
 *  @ingroup LTC4015_register_map
 *  @brief JEITA_REGION Register
 *
 * | 15:3 |             2:0 |
 * |:----:|:---------------:|
 * |  n/a | JEITA_REGION_BF |
 *
 *   - CommandCode: 66
 *   - Contains Bit Fields:
 *     + @ref LTC4015_JEITA_REGION_BF "JEITA_REGION_BF" : JEITA temperature region of the NTC thermistor[(Li Only)]. Active only when EN_JEITA=1
*/

//!@{
#define LTC4015_JEITA_REGION_SUBADDR 66
#define LTC4015_JEITA_REGION (0 << 12 | (16 - 1) << 8 | LTC4015_JEITA_REGION_SUBADDR)
//!@}
/*! @defgroup LTC4015_JEITA_REGION_BF JEITA_REGION_BF
 *  @ingroup LTC4015_register_map
 *  @brief JEITA_REGION_BF Bit Field
 *
 *  JEITA temperature region of the NTC thermistor[(Li Only)]. Active only when EN_JEITA=1
 *   - Register: @ref LTC4015_JEITA_REGION "JEITA_REGION"
 *   - CommandCode: 66
 *   - Size: 3
 *   - Offset: 0
 *   - MSB: 2
 *   - MASK: 0x0007
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_JEITA_REGION_BF_SUBADDR LTC4015_JEITA_REGION_SUBADDR //!< @ref LTC4015_JEITA_REGION_BF "JEITA_REGION_BF"
#define LTC4015_JEITA_REGION_BF_SIZE 3
#define LTC4015_JEITA_REGION_BF_OFFSET 0
#define LTC4015_JEITA_REGION_BF_MASK 0x0007
#define LTC4015_JEITA_REGION_BF (LTC4015_JEITA_REGION_BF_OFFSET << 12 | (LTC4015_JEITA_REGION_BF_SIZE - 1) << 8 | LTC4015_JEITA_REGION_BF_SUBADDR)
#define LTC4015_JEITA_REGION_BF_PRESET_T1 1
#define LTC4015_JEITA_REGION_BF_PRESET_T2 2
#define LTC4015_JEITA_REGION_BF_PRESET_T3 3
#define LTC4015_JEITA_REGION_BF_PRESET_T4 4
#define LTC4015_JEITA_REGION_BF_PRESET_T5 5
#define LTC4015_JEITA_REGION_BF_PRESET_T6 6
#define LTC4015_JEITA_REGION_BF_PRESET_T7 7
//!@}

/*! @defgroup LTC4015_CHEM_CELLS CHEM_CELLS
 *  @ingroup LTC4015_register_map
 *  @brief CHEM_CELLS Register
 *
 * | 15:12 |    11:8 |              7:4 |                3:0 |
 * |:-----:|:-------:|:----------------:|:------------------:|
 * |   n/a | CHEM_BF | RESERVED_0X67_BF | CELL_COUNT_PINS_BF |
 *
 * Readout of CHEM and CELLS pin settings
 *   - CommandCode: 67
 *   - Contains Bit Fields:
 *     + @ref LTC4015_CHEM_BF "CHEM_BF" : programmed battery chemistry
 *     + @ref LTC4015_RESERVED_0X67_BF "RESERVED_0X67_BF" : Reserved
 *     + @ref LTC4015_CELL_COUNT_PINS_BF "CELL_COUNT_PINS_BF" : Cell count as set by CELLS pins
*/

//!@{
#define LTC4015_CHEM_CELLS_SUBADDR 67
#define LTC4015_CHEM_CELLS (0 << 12 | (16 - 1) << 8 | LTC4015_CHEM_CELLS_SUBADDR)
//!@}
/*! @defgroup LTC4015_CHEM_BF CHEM_BF
 *  @ingroup LTC4015_register_map
 *  @brief CHEM_BF Bit Field
 *
 *  programmed battery chemistry
 *   - Register: @ref LTC4015_CHEM_CELLS "CHEM_CELLS"
 *   - CommandCode: 67
 *   - Size: 4
 *   - Offset: 8
 *   - MSB: 11
 *   - MASK: 0x0F00
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_CHEM_BF_SUBADDR LTC4015_CHEM_CELLS_SUBADDR //!< @ref LTC4015_CHEM_BF "CHEM_BF"
#define LTC4015_CHEM_BF_SIZE 4
#define LTC4015_CHEM_BF_OFFSET 8
#define LTC4015_CHEM_BF_MASK 0x0F00
#define LTC4015_CHEM_BF (LTC4015_CHEM_BF_OFFSET << 12 | (LTC4015_CHEM_BF_SIZE - 1) << 8 | LTC4015_CHEM_BF_SUBADDR)
#define LTC4015_CHEM_BF_PRESET_LI_ION_PROGRAMMABLE 0
#define LTC4015_CHEM_BF_PRESET_LI_ION_FIXED_4P2V 1
#define LTC4015_CHEM_BF_PRESET_LI_ION_FIXED_4P1V 2
#define LTC4015_CHEM_BF_PRESET_LI_ION_FIXED_4P0V 3
#define LTC4015_CHEM_BF_PRESET_LIFEPO4_PROGRAMMABLE 4
#define LTC4015_CHEM_BF_PRESET_LIFEPO4_FIXED_FAST_CHARGE 5
#define LTC4015_CHEM_BF_PRESET_LIFEPO4_FIXED_3P6V 6
#define LTC4015_CHEM_BF_PRESET_LEAD_ACID_FIXED 7
#define LTC4015_CHEM_BF_PRESET_LEAD_ACID_PROGRAMMABLE 8
//!@}
/*! @defgroup LTC4015_RESERVED_0X67_BF RESERVED_0X67_BF
 *  @ingroup LTC4015_register_map
 *  @brief RESERVED_0X67_BF Bit Field
 *
 *  Reserved
 *   - Register: @ref LTC4015_CHEM_CELLS "CHEM_CELLS"
 *   - CommandCode: 67
 *   - Size: 4
 *   - Offset: 4
 *   - MSB: 7
 *   - MASK: 0x00F0
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_RESERVED_0X67_BF_SUBADDR LTC4015_CHEM_CELLS_SUBADDR //!< @ref LTC4015_RESERVED_0X67_BF "RESERVED_0X67_BF"
#define LTC4015_RESERVED_0X67_BF_SIZE 4
#define LTC4015_RESERVED_0X67_BF_OFFSET 4
#define LTC4015_RESERVED_0X67_BF_MASK 0x00F0
#define LTC4015_RESERVED_0X67_BF (LTC4015_RESERVED_0X67_BF_OFFSET << 12 | (LTC4015_RESERVED_0X67_BF_SIZE - 1) << 8 | LTC4015_RESERVED_0X67_BF_SUBADDR)
//!@}
/*! @defgroup LTC4015_CELL_COUNT_PINS_BF CELL_COUNT_PINS_BF
 *  @ingroup LTC4015_register_map
 *  @brief CELL_COUNT_PINS_BF Bit Field
 *
 *  Cell count as set by CELLS pins
 *   - Register: @ref LTC4015_CHEM_CELLS "CHEM_CELLS"
 *   - CommandCode: 67
 *   - Size: 4
 *   - Offset: 0
 *   - MSB: 3
 *   - MASK: 0x000F
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_CELL_COUNT_PINS_BF_SUBADDR LTC4015_CHEM_CELLS_SUBADDR //!< @ref LTC4015_CELL_COUNT_PINS_BF "CELL_COUNT_PINS_BF"
#define LTC4015_CELL_COUNT_PINS_BF_SIZE 4
#define LTC4015_CELL_COUNT_PINS_BF_OFFSET 0
#define LTC4015_CELL_COUNT_PINS_BF_MASK 0x000F
#define LTC4015_CELL_COUNT_PINS_BF (LTC4015_CELL_COUNT_PINS_BF_OFFSET << 12 | (LTC4015_CELL_COUNT_PINS_BF_SIZE - 1) << 8 | LTC4015_CELL_COUNT_PINS_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_ICHARGE_DAC ICHARGE_DAC
 *  @ingroup LTC4015_register_map
 *  @brief ICHARGE_DAC Register
 *
 * | 15:5 |            4:0 |
 * |:----:|:--------------:|
 * |  n/a | ICHARGE_DAC_BF |
 *
 *   - CommandCode: 68
 *   - Contains Bit Fields:
 *     + @ref LTC4015_ICHARGE_DAC_BF "ICHARGE_DAC_BF" : Charge current control DAC control bits
*/

//!@{
#define LTC4015_ICHARGE_DAC_SUBADDR 68
#define LTC4015_ICHARGE_DAC (0 << 12 | (16 - 1) << 8 | LTC4015_ICHARGE_DAC_SUBADDR)
//!@}
/*! @defgroup LTC4015_ICHARGE_DAC_BF ICHARGE_DAC_BF
 *  @ingroup LTC4015_register_map
 *  @brief ICHARGE_DAC_BF Bit Field
 *
 *  Charge current control DAC control bits
 *   - Register: @ref LTC4015_ICHARGE_DAC "ICHARGE_DAC"
 *   - CommandCode: 68
 *   - Size: 5
 *   - Offset: 0
 *   - MSB: 4
 *   - MASK: 0x001F
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_ICHARGE_DAC_BF_SUBADDR LTC4015_ICHARGE_DAC_SUBADDR //!< @ref LTC4015_ICHARGE_DAC_BF "ICHARGE_DAC_BF"
#define LTC4015_ICHARGE_DAC_BF_SIZE 5
#define LTC4015_ICHARGE_DAC_BF_OFFSET 0
#define LTC4015_ICHARGE_DAC_BF_MASK 0x001F
#define LTC4015_ICHARGE_DAC_BF (LTC4015_ICHARGE_DAC_BF_OFFSET << 12 | (LTC4015_ICHARGE_DAC_BF_SIZE - 1) << 8 | LTC4015_ICHARGE_DAC_BF_SUBADDR)
//!@}

