YY-Edwards/STM32_USB-FS-Device_v4.1/mylib/DC2039A/LTC4015/LTC4015_reg_defs.h
/*! @defgroup LTC4015_VCHARGE_DAC VCHARGE_DAC
 *  @ingroup LTC4015_register_map
 *  @brief VCHARGE_DAC Register
 *
 * | 15:6 |            5:0 |
 * |:----:|:--------------:|
 * |  n/a | VCHARGE_DAC_BF |
 *
 *   - CommandCode: 69
 *   - Contains Bit Fields:
 *     + @ref LTC4015_VCHARGE_DAC_BF "VCHARGE_DAC_BF" : Charge voltage control DAC control bits
*/

//!@{
#define LTC4015_VCHARGE_DAC_SUBADDR 69
#define LTC4015_VCHARGE_DAC (0 << 12 | (16 - 1) << 8 | LTC4015_VCHARGE_DAC_SUBADDR)
//!@}
/*! @defgroup LTC4015_VCHARGE_DAC_BF VCHARGE_DAC_BF
 *  @ingroup LTC4015_register_map
 *  @brief VCHARGE_DAC_BF Bit Field
 *
 *  Charge voltage control DAC control bits
 *   - Register: @ref LTC4015_VCHARGE_DAC "VCHARGE_DAC"
 *   - CommandCode: 69
 *   - Size: 6
 *   - Offset: 0
 *   - MSB: 5
 *   - MASK: 0x003F
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_VCHARGE_DAC_BF_SUBADDR LTC4015_VCHARGE_DAC_SUBADDR //!< @ref LTC4015_VCHARGE_DAC_BF "VCHARGE_DAC_BF"
#define LTC4015_VCHARGE_DAC_BF_SIZE 6
#define LTC4015_VCHARGE_DAC_BF_OFFSET 0
#define LTC4015_VCHARGE_DAC_BF_MASK 0x003F
#define LTC4015_VCHARGE_DAC_BF (LTC4015_VCHARGE_DAC_BF_OFFSET << 12 | (LTC4015_VCHARGE_DAC_BF_SIZE - 1) << 8 | LTC4015_VCHARGE_DAC_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_IIN_LIMIT_DAC IIN_LIMIT_DAC
 *  @ingroup LTC4015_register_map
 *  @brief IIN_LIMIT_DAC Register
 *
 * | 15:6 |              5:0 |
 * |:----:|:----------------:|
 * |  n/a | IIN_LIMIT_DAC_BF |
 *
 *   - CommandCode: 70
 *   - Contains Bit Fields:
 *     + @ref LTC4015_IIN_LIMIT_DAC_BF "IIN_LIMIT_DAC_BF" : Input current limit control DAC control word
*/

//!@{
#define LTC4015_IIN_LIMIT_DAC_SUBADDR 70
#define LTC4015_IIN_LIMIT_DAC (0 << 12 | (16 - 1) << 8 | LTC4015_IIN_LIMIT_DAC_SUBADDR)
//!@}
/*! @defgroup LTC4015_IIN_LIMIT_DAC_BF IIN_LIMIT_DAC_BF
 *  @ingroup LTC4015_register_map
 *  @brief IIN_LIMIT_DAC_BF Bit Field
 *
 *  Input current limit control DAC control word
 *   - Register: @ref LTC4015_IIN_LIMIT_DAC "IIN_LIMIT_DAC"
 *   - CommandCode: 70
 *   - Size: 6
 *   - Offset: 0
 *   - MSB: 5
 *   - MASK: 0x003F
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_IIN_LIMIT_DAC_BF_SUBADDR LTC4015_IIN_LIMIT_DAC_SUBADDR //!< @ref LTC4015_IIN_LIMIT_DAC_BF "IIN_LIMIT_DAC_BF"
#define LTC4015_IIN_LIMIT_DAC_BF_SIZE 6
#define LTC4015_IIN_LIMIT_DAC_BF_OFFSET 0
#define LTC4015_IIN_LIMIT_DAC_BF_MASK 0x003F
#define LTC4015_IIN_LIMIT_DAC_BF (LTC4015_IIN_LIMIT_DAC_BF_OFFSET << 12 | (LTC4015_IIN_LIMIT_DAC_BF_SIZE - 1) << 8 | LTC4015_IIN_LIMIT_DAC_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_VBAT_FILT VBAT_FILT
 *  @ingroup LTC4015_register_map
 *  @brief VBAT_FILT Register
 *
 * |         15:0 |
 * |:------------:|
 * | VBAT_FILT_BF |
 *
 *   - CommandCode: 71
 *   - Contains Bit Fields:
 *     + @ref LTC4015_VBAT_FILT_BF "VBAT_FILT_BF" : Digitally filtered ADC measurement result for battery voltage
*/

//!@{
#define LTC4015_VBAT_FILT_SUBADDR 71
#define LTC4015_VBAT_FILT (0 << 12 | (16 - 1) << 8 | LTC4015_VBAT_FILT_SUBADDR)
//!@}
/*! @defgroup LTC4015_VBAT_FILT_BF VBAT_FILT_BF
 *  @ingroup LTC4015_register_map
 *  @brief VBAT_FILT_BF Bit Field
 *
 *  Digitally filtered ADC measurement result for battery voltage
 *   - Register: @ref LTC4015_VBAT_FILT "VBAT_FILT"
 *   - CommandCode: 71
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_VBAT_FILT_BF_SUBADDR LTC4015_VBAT_FILT_SUBADDR //!< @ref LTC4015_VBAT_FILT_BF "VBAT_FILT_BF"
#define LTC4015_VBAT_FILT_BF_SIZE 16
#define LTC4015_VBAT_FILT_BF_OFFSET 0
#define LTC4015_VBAT_FILT_BF_MASK 0xFFFF
#define LTC4015_VBAT_FILT_BF (LTC4015_VBAT_FILT_BF_OFFSET << 12 | (LTC4015_VBAT_FILT_BF_SIZE - 1) << 8 | LTC4015_VBAT_FILT_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_ICHARGE_BSR ICHARGE_BSR
 *  @ingroup LTC4015_register_map
 *  @brief ICHARGE_BSR Register
 *
 * |           15:0 |
 * |:--------------:|
 * | ICHARGE_BSR_BF |
 *
 *   - CommandCode: 72
 *   - Contains Bit Fields:
 *     + @ref LTC4015_ICHARGE_BSR_BF "ICHARGE_BSR_BF" : This 16-bit two's complement word is the value of IBAT (0x3D) used in calculating BSR.
*/

//!@{
#define LTC4015_ICHARGE_BSR_SUBADDR 72
#define LTC4015_ICHARGE_BSR (0 << 12 | (16 - 1) << 8 | LTC4015_ICHARGE_BSR_SUBADDR)
//!@}
/*! @defgroup LTC4015_ICHARGE_BSR_BF ICHARGE_BSR_BF
 *  @ingroup LTC4015_register_map
 *  @brief ICHARGE_BSR_BF Bit Field
 *
 *  This 16-bit two's complement word is the value of IBAT (0x3D) used in calculating BSR.
 *   - Register: @ref LTC4015_ICHARGE_BSR "ICHARGE_BSR"
 *   - CommandCode: 72
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_ICHARGE_BSR_BF_SUBADDR LTC4015_ICHARGE_BSR_SUBADDR //!< @ref LTC4015_ICHARGE_BSR_BF "ICHARGE_BSR_BF"
#define LTC4015_ICHARGE_BSR_BF_SIZE 16
#define LTC4015_ICHARGE_BSR_BF_OFFSET 0
#define LTC4015_ICHARGE_BSR_BF_MASK 0xFFFF
#define LTC4015_ICHARGE_BSR_BF (LTC4015_ICHARGE_BSR_BF_OFFSET << 12 | (LTC4015_ICHARGE_BSR_BF_SIZE - 1) << 8 | LTC4015_ICHARGE_BSR_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_RESERVED_0X49 RESERVED_0X49
 *  @ingroup LTC4015_register_map
 *  @brief RESERVED_0X49 Register
 *
 * |             15:0 |
 * |:----------------:|
 * | RESERVED_0X49_BF |
 *
 *   - CommandCode: 73
 *   - Contains Bit Fields:
 *     + @ref LTC4015_RESERVED_0X49_BF "RESERVED_0X49_BF" : RESERVED
*/

//!@{
#define LTC4015_RESERVED_0X49_SUBADDR 73
#define LTC4015_RESERVED_0X49 (0 << 12 | (16 - 1) << 8 | LTC4015_RESERVED_0X49_SUBADDR)
//!@}
/*! @defgroup LTC4015_RESERVED_0X49_BF RESERVED_0X49_BF
 *  @ingroup LTC4015_register_map
 *  @brief RESERVED_0X49_BF Bit Field
 *
 *  RESERVED
 *   - Register: @ref LTC4015_RESERVED_0X49 "RESERVED_0X49"
 *   - CommandCode: 73
 *   - Size: 16
 *   - Offset: 0
 *   - MSB: 15
 *   - MASK: 0xFFFF
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_RESERVED_0X49_BF_SUBADDR LTC4015_RESERVED_0X49_SUBADDR //!< @ref LTC4015_RESERVED_0X49_BF "RESERVED_0X49_BF"
#define LTC4015_RESERVED_0X49_BF_SIZE 16
#define LTC4015_RESERVED_0X49_BF_OFFSET 0
#define LTC4015_RESERVED_0X49_BF_MASK 0xFFFF
#define LTC4015_RESERVED_0X49_BF (LTC4015_RESERVED_0X49_BF_OFFSET << 12 | (LTC4015_RESERVED_0X49_BF_SIZE - 1) << 8 | LTC4015_RESERVED_0X49_BF_SUBADDR)
//!@}

/*! @defgroup LTC4015_MEAS_SYS_VALID MEAS_SYS_VALID
 *  @ingroup LTC4015_register_map
 *  @brief MEAS_SYS_VALID Register
 *
 * | 15:1 |                 0 |
 * |:----:|:-----------------:|
 * |  n/a | MEAS_SYS_VALID_BF |
 *
 *   - CommandCode: 74
 *   - Contains Bit Fields:
 *     + @ref LTC4015_MEAS_SYS_VALID_BF "MEAS_SYS_VALID_BF" : Measurement valid bit, bit 0 is a 1 when the telemetry(ADC) system is ready
*/

//!@{
#define LTC4015_MEAS_SYS_VALID_SUBADDR 74
#define LTC4015_MEAS_SYS_VALID (0 << 12 | (16 - 1) << 8 | LTC4015_MEAS_SYS_VALID_SUBADDR)
//!@}
/*! @defgroup LTC4015_MEAS_SYS_VALID_BF MEAS_SYS_VALID_BF
 *  @ingroup LTC4015_register_map
 *  @brief MEAS_SYS_VALID_BF Bit Field
 *
 *  Measurement valid bit, bit 0 is a 1 when the telemetry(ADC) system is ready
 *   - Register: @ref LTC4015_MEAS_SYS_VALID "MEAS_SYS_VALID"
 *   - CommandCode: 74
 *   - Size: 1
 *   - Offset: 0
 *   - MSB: 0
 *   - MASK: 0x0001
 *   - Access: R
 *   - Default: n/a
 */
//!@{
#define LTC4015_MEAS_SYS_VALID_BF_SUBADDR LTC4015_MEAS_SYS_VALID_SUBADDR //!< @ref LTC4015_MEAS_SYS_VALID_BF "MEAS_SYS_VALID_BF"
#define LTC4015_MEAS_SYS_VALID_BF_SIZE 1
#define LTC4015_MEAS_SYS_VALID_BF_OFFSET 0
#define LTC4015_MEAS_SYS_VALID_BF_MASK 0x0001
#define LTC4015_MEAS_SYS_VALID_BF (LTC4015_MEAS_SYS_VALID_BF_OFFSET << 12 | (LTC4015_MEAS_SYS_VALID_BF_SIZE - 1) << 8 | LTC4015_MEAS_SYS_VALID_BF_SUBADDR)
//!@}

#endif
